[Killed] BlockStatement
src/models/product.js:7:82
  */
 
 export class Product {
-  constructor(id, title, author, price, category, isbn, stock, description = '') {
-    this.id = id;
-    this.title = title;
-    this.author = author;
-    this.price = price;
-    this.category = category;
-    this.isbn = isbn;
-    this.stock = stock;
-    this.description = description;
-    this.createdAt = new Date();
-  }
+  constructor(id, title, author, price, category, isbn, stock, description = '') {}
 
   /**
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] BlockStatement
src/models/product.js:23:15
    * Checks if product is in stock
    * @returns {boolean} true if stock > 0
    */
-  isInStock() {
-    return this.stock > 0;
-  }
+  isInStock() {}
 
   /**
killedBy: CatalogService - Unit Tests filterProducts should return products with zero stock when inStock is false
statusReason: Expected values to be strictly equal:

10 !== 0

[Killed] EqualityOperator
src/models/product.js:24:12
    * @returns {boolean} true if stock > 0
    */
   isInStock() {
-    return this.stock > 0;
+    return this.stock >= 0;
   }
 
killedBy: CatalogService - Unit Tests filterProducts should filter by stock availability
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.stock > 0)

[Killed] EqualityOperator
src/models/product.js:24:12
    * @returns {boolean} true if stock > 0
    */
   isInStock() {
-    return this.stock > 0;
+    return this.stock <= 0;
   }
 
killedBy: CatalogService - Unit Tests filterProducts should filter by stock availability
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.stock > 0)

[Killed] BlockStatement
src/models/product.js:32:29
    * @param {number} threshold - Stock level to compare against (default 5)
    * @returns {boolean} true if stock is below threshold
    */
-  isLowStock(threshold = 5) {
-    // Edge case: threshold must be positive
-    if (threshold < 0) {
-      threshold = 0;
-    }
-    return this.stock > 0 && this.stock <= threshold;
-  }
+  isLowStock(threshold = 5) {}
 
   /**
killedBy: Product Model - Unit Tests isLowStock should return true when stock is below default threshold
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] ConditionalExpression
src/models/product.js:34:9
    */
   isLowStock(threshold = 5) {
     // Edge case: threshold must be positive
-    if (threshold < 0) {
+    if (true) {
       threshold = 0;
     }
killedBy: Product Model - Unit Tests isLowStock should return true when stock is below default threshold
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/models/product.js:34:9
    */
   isLowStock(threshold = 5) {
     // Edge case: threshold must be positive
-    if (threshold < 0) {
+    if (threshold >= 0) {
       threshold = 0;
     }
killedBy: Product Model - Unit Tests isLowStock should return true when stock is below default threshold
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/models/product.js:37:12
     if (threshold < 0) {
       threshold = 0;
     }
-    return this.stock > 0 && this.stock <= threshold;
+    return false;
   }
 
killedBy: Product Model - Unit Tests isLowStock should return true when stock is below default threshold
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/models/product.js:37:12
     if (threshold < 0) {
       threshold = 0;
     }
-    return this.stock > 0 && this.stock <= threshold;
+    return this.stock <= 0 && this.stock <= threshold;
   }
 
killedBy: Product Model - Unit Tests isLowStock should return true when stock is below default threshold
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/models/product.js:45:32
    * @param {number} quantity - Requested quantity
    * @returns {boolean} true if stock is sufficient
    */
-  hasSufficientStock(quantity) {
-    // Nested validation for edge cases
-    if (typeof quantity !== 'number' || quantity < 0) {
-      return false;
-    }
-    
-    if (quantity === 0) {
-      return true; // Zero quantity is always available
-    }
-
-    return this.stock >= quantity;
-  }
+  hasSufficientStock(quantity) {}
 
   /**
killedBy: InventoryService - Unit Tests checkStock should return available true when stock is sufficient
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] ConditionalExpression
src/models/product.js:47:9
    */
   hasSufficientStock(quantity) {
     // Nested validation for edge cases
-    if (typeof quantity !== 'number' || quantity < 0) {
+    if (false) {
       return false;
     }
killedBy: Product Model - Unit Tests hasSufficientStock should return false for negative quantity
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/models/product.js:47:9
    */
   hasSufficientStock(quantity) {
     // Nested validation for edge cases
-    if (typeof quantity !== 'number' || quantity < 0) {
+    if (false || quantity < 0) {
       return false;
     }
killedBy: Product Model - Unit Tests hasSufficientStock should return false for non-number quantity
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/models/product.js:48:14
   hasSufficientStock(quantity) {
     // Nested validation for edge cases
     if (typeof quantity !== 'number' || quantity < 0) {
-      return false;
+      return true;
     }
     
killedBy: Product Model - Unit Tests hasSufficientStock should return false for negative quantity
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/models/product.js:51:9
       return false;
     }
     
-    if (quantity === 0) {
+    if (true) {
       return true; // Zero quantity is always available
     }
killedBy: InventoryService - Unit Tests checkStock should return available false when stock is insufficient
statusReason: Expected values to be strictly equal:

true !== false

[Killed] EqualityOperator
src/models/product.js:51:9
       return false;
     }
     
-    if (quantity === 0) {
+    if (quantity !== 0) {
       return true; // Zero quantity is always available
     }
killedBy: InventoryService - Unit Tests checkStock should return available false when stock is insufficient
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/models/product.js:52:14
     }
     
     if (quantity === 0) {
-      return true; // Zero quantity is always available
+      return false; // Zero quantity is always available
     }
 
killedBy: InventoryService - Unit Tests checkStock should handle zero quantity check
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/models/product.js:55:12
       return true; // Zero quantity is always available
     }
 
-    return this.stock >= quantity;
+    return true;
   }
 
killedBy: InventoryService - Unit Tests checkStock should return available false when stock is insufficient
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/models/product.js:55:12
       return true; // Zero quantity is always available
     }
 
-    return this.stock >= quantity;
+    return false;
   }
 
killedBy: InventoryService - Unit Tests checkStock should return available true when stock is sufficient
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/models/product.js:63:25
    * @param {number} quantity - Amount to reduce
    * @returns {boolean} true if reduction successful
    */
-  reduceStock(quantity) {
-    // Complex validation with nested conditions
-    if (!this.hasSufficientStock(quantity)) {
-      return false;
-    }
-
-    if (quantity <= 0) {
-      return false;
-    }
-
-    this.stock -= quantity;
-    return true;
-  }
+  reduceStock(quantity) {}
 
   /**
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/models/product.js:65:45
    */
   reduceStock(quantity) {
     // Complex validation with nested conditions
-    if (!this.hasSufficientStock(quantity)) {
-      return false;
-    }
+    if (!this.hasSufficientStock(quantity)) {}
 
     if (quantity <= 0) {
killedBy: Product Model - Unit Tests reduceStock should return false when quantity exceeds stock
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/models/product.js:65:9
    */
   reduceStock(quantity) {
     // Complex validation with nested conditions
-    if (!this.hasSufficientStock(quantity)) {
+    if (true) {
       return false;
     }
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/models/product.js:66:14
   reduceStock(quantity) {
     // Complex validation with nested conditions
     if (!this.hasSufficientStock(quantity)) {
-      return false;
+      return true;
     }
 
killedBy: Product Model - Unit Tests reduceStock should return false when quantity exceeds stock
statusReason: Expected values to be strictly equal:

true !== false

[Killed] EqualityOperator
src/models/product.js:69:9
       return false;
     }
 
-    if (quantity <= 0) {
+    if (quantity < 0) {
       return false;
     }
killedBy: Product Model - Unit Tests reduceStock should return false for zero or negative quantity
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/models/product.js:69:9
       return false;
     }
 
-    if (quantity <= 0) {
+    if (true) {
       return false;
     }
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/models/product.js:70:14
     }
 
     if (quantity <= 0) {
-      return false;
+      return true;
     }
 
killedBy: Product Model - Unit Tests reduceStock should return false for zero or negative quantity
statusReason: Expected values to be strictly equal:

true !== false

[Killed] AssignmentOperator
src/models/product.js:73:5
       return false;
     }
 
-    this.stock -= quantity;
+    this.stock += quantity;
     return true;
   }
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Expected values to be strictly equal:

15 !== 5

[Killed] BooleanLiteral
src/models/product.js:74:12
     }
 
     this.stock -= quantity;
-    return true;
+    return false;
   }
 
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/models/product.js:82:27
    * @param {number} quantity - Amount to add
    * @returns {boolean} true if increase successful
    */
-  increaseStock(quantity) {
-    // Validate quantity is positive
-    if (typeof quantity !== 'number' || quantity <= 0) {
-      return false;
-    }
-
-    this.stock += quantity;
-    return true;
-  }
+  increaseStock(quantity) {}
 
   /**
killedBy: InventoryService - Unit Tests releaseStock should successfully release stock
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/models/product.js:84:41
    */
   increaseStock(quantity) {
     // Validate quantity is positive
-    if (typeof quantity !== 'number' || quantity <= 0) {
+    if (typeof quantity !== 'number' || quantity < 0) {
       return false;
     }
killedBy: InventoryService - Unit Tests restockProduct should fail when product already at max stock with autoAdjust
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BlockStatement
src/models/product.js:84:56
    */
   increaseStock(quantity) {
     // Validate quantity is positive
-    if (typeof quantity !== 'number' || quantity <= 0) {
-      return false;
-    }
+    if (typeof quantity !== 'number' || quantity <= 0) {}
 
     this.stock += quantity;
killedBy: Product Model - Unit Tests increaseStock should return false for zero or negative quantity
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/models/product.js:85:14
   increaseStock(quantity) {
     // Validate quantity is positive
     if (typeof quantity !== 'number' || quantity <= 0) {
-      return false;
+      return true;
     }
 
killedBy: Product Model - Unit Tests increaseStock should return false for zero or negative quantity
statusReason: Expected values to be strictly equal:

true !== false

[Killed] AssignmentOperator
src/models/product.js:88:5
       return false;
     }
 
-    this.stock += quantity;
+    this.stock -= quantity;
     return true;
   }
killedBy: InventoryService - Unit Tests releaseStock should successfully release stock
statusReason: Expected values to be strictly equal:

5 !== 15

[Killed] BooleanLiteral
src/models/product.js:89:12
     }
 
     this.stock += quantity;
-    return true;
+    return false;
   }
 
killedBy: InventoryService - Unit Tests releaseStock should successfully release stock
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/models/product.js:97:31
    * @param {number} markup - Percentage markup (0-100)
    * @returns {number} Calculated price
    */
-  getDisplayPrice(markup = 0) {
-    // Nested conditionals for markup calculation
-    if (markup < 0) {
-      markup = 0;
-    } else if (markup > 100) {
-      markup = 100;
-    }
-
-    const finalPrice = this.price * (1 + markup / 100);
-    return Math.round(finalPrice * 100) / 100; // Round to 2 decimal places
-  }
+  getDisplayPrice(markup = 0) {}
 
   /**
killedBy: Product Model - Unit Tests getDisplayPrice should return price with 0% markup
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- 19.99

[Killed] EqualityOperator
src/models/product.js:99:9
    */
   getDisplayPrice(markup = 0) {
     // Nested conditionals for markup calculation
-    if (markup < 0) {
+    if (markup >= 0) {
       markup = 0;
     } else if (markup > 100) {
killedBy: Product Model - Unit Tests getDisplayPrice should apply positive markup correctly
statusReason: Expected values to be strictly equal:

20 !== 22

[Killed] ConditionalExpression
src/models/product.js:99:9
    */
   getDisplayPrice(markup = 0) {
     // Nested conditionals for markup calculation
-    if (markup < 0) {
+    if (true) {
       markup = 0;
     } else if (markup > 100) {
killedBy: Product Model - Unit Tests getDisplayPrice should apply positive markup correctly
statusReason: Expected values to be strictly equal:

20 !== 22

[Killed] ConditionalExpression
src/models/product.js:101:16
     // Nested conditionals for markup calculation
     if (markup < 0) {
       markup = 0;
-    } else if (markup > 100) {
+    } else if (false) {
       markup = 100;
     }
killedBy: Product Model - Unit Tests getDisplayPrice should clamp markup > 100 to 100
statusReason: Expected values to be strictly equal:

50 !== 40

[Killed] EqualityOperator
src/models/product.js:101:16
     // Nested conditionals for markup calculation
     if (markup < 0) {
       markup = 0;
-    } else if (markup > 100) {
+    } else if (markup <= 100) {
       markup = 100;
     }
killedBy: Product Model - Unit Tests getDisplayPrice should return price with 0% markup
statusReason: Expected values to be strictly equal:

39.98 !== 19.99

[Killed] ArithmeticOperator
src/models/product.js:105:38
       markup = 100;
     }
 
-    const finalPrice = this.price * (1 + markup / 100);
+    const finalPrice = this.price * (1 - markup / 100);
     return Math.round(finalPrice * 100) / 100; // Round to 2 decimal places
   }
killedBy: Product Model - Unit Tests getDisplayPrice should apply positive markup correctly
statusReason: Expected values to be strictly equal:

18 !== 22

[Killed] ArithmeticOperator
src/models/product.js:105:24
       markup = 100;
     }
 
-    const finalPrice = this.price * (1 + markup / 100);
+    const finalPrice = this.price / (1 + markup / 100);
     return Math.round(finalPrice * 100) / 100; // Round to 2 decimal places
   }
killedBy: Product Model - Unit Tests getDisplayPrice should apply positive markup correctly
statusReason: Expected values to be strictly equal:

18.18 !== 22

[Killed] ArithmeticOperator
src/models/product.js:106:23
     }
 
     const finalPrice = this.price * (1 + markup / 100);
-    return Math.round(finalPrice * 100) / 100; // Round to 2 decimal places
+    return Math.round(finalPrice / 100) / 100; // Round to 2 decimal places
   }
 
killedBy: Product Model - Unit Tests getDisplayPrice should return price with 0% markup
statusReason: Expected values to be strictly equal:

0 !== 19.99

[Killed] ArithmeticOperator
src/models/product.js:106:12
     }
 
     const finalPrice = this.price * (1 + markup / 100);
-    return Math.round(finalPrice * 100) / 100; // Round to 2 decimal places
+    return Math.round(finalPrice * 100) * 100; // Round to 2 decimal places
   }
 
killedBy: Product Model - Unit Tests getDisplayPrice should return price with 0% markup
statusReason: Expected values to be strictly equal:

199900 !== 19.99

[Killed] BlockStatement
src/models/product.js:113:24
    * Determines if product qualifies for discount based on category and price
    * @returns {boolean} true if eligible for discount
    */
-  isDiscountEligible() {
-    // Complex business logic with multiple conditions
-    const highValueThreshold = 50;
-    const discountCategories = ['fiction', 'non-fiction', 'science'];
-
-    // Nested if-else for eligibility
-    if (this.price >= highValueThreshold) {
-      if (discountCategories.includes(this.category.toLowerCase())) {
-        return true;
-      } else if (this.price >= 100) {
-        // High-value items always eligible regardless of category
-        return true;
-      }
-    }
-
-    return false;
-  }
+  isDiscountEligible() {}
 
   /**
killedBy: Product Model - Unit Tests isDiscountEligible should return true for fiction >= $50
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] ConditionalExpression
src/models/product.js:119:9
     const discountCategories = ['fiction', 'non-fiction', 'science'];
 
     // Nested if-else for eligibility
-    if (this.price >= highValueThreshold) {
+    if (true) {
       if (discountCategories.includes(this.category.toLowerCase())) {
         return true;
killedBy: Product Model - Unit Tests isDiscountEligible should return false for fiction < $50
statusReason: Expected values to be strictly equal:

true !== false

[Killed] EqualityOperator
src/models/product.js:119:9
     const discountCategories = ['fiction', 'non-fiction', 'science'];
 
     // Nested if-else for eligibility
-    if (this.price >= highValueThreshold) {
+    if (this.price > highValueThreshold) {
       if (discountCategories.includes(this.category.toLowerCase())) {
         return true;
killedBy: Product Model - Unit Tests isDiscountEligible should return true for fiction >= $50
statusReason: Expected values to be strictly equal:

false !== true

[Killed] MethodExpression
src/models/product.js:120:39
 
     // Nested if-else for eligibility
     if (this.price >= highValueThreshold) {
-      if (discountCategories.includes(this.category.toLowerCase())) {
+      if (discountCategories.includes(this.category.toUpperCase())) {
         return true;
       } else if (this.price >= 100) {
killedBy: Product Model - Unit Tests isDiscountEligible should return true for fiction >= $50
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/models/product.js:120:11
 
     // Nested if-else for eligibility
     if (this.price >= highValueThreshold) {
-      if (discountCategories.includes(this.category.toLowerCase())) {
+      if (false) {
         return true;
       } else if (this.price >= 100) {
killedBy: Product Model - Unit Tests isDiscountEligible should return true for fiction >= $50
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/models/product.js:121:16
     // Nested if-else for eligibility
     if (this.price >= highValueThreshold) {
       if (discountCategories.includes(this.category.toLowerCase())) {
-        return true;
+        return false;
       } else if (this.price >= 100) {
         // High-value items always eligible regardless of category
killedBy: Product Model - Unit Tests isDiscountEligible should return true for fiction >= $50
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/models/product.js:122:18
     if (this.price >= highValueThreshold) {
       if (discountCategories.includes(this.category.toLowerCase())) {
         return true;
-      } else if (this.price >= 100) {
+      } else if (this.price > 100) {
         // High-value items always eligible regardless of category
         return true;
killedBy: Product Model - Unit Tests isDiscountEligible should return true for any category >= $100
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/models/product.js:122:37
     if (this.price >= highValueThreshold) {
       if (discountCategories.includes(this.category.toLowerCase())) {
         return true;
-      } else if (this.price >= 100) {
-        // High-value items always eligible regardless of category
-        return true;
-      }
+      } else if (this.price >= 100) {}
     }
 
killedBy: Product Model - Unit Tests isDiscountEligible should return true for any category >= $100
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/models/product.js:124:16
         return true;
       } else if (this.price >= 100) {
         // High-value items always eligible regardless of category
-        return true;
+        return false;
       }
     }
killedBy: Product Model - Unit Tests isDiscountEligible should return true for any category >= $100
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/models/product.js:135:12
    * Converts product to plain object for JSON serialization
    * @returns {object} Plain object representation
    */
-  toJSON() {
-    return {
-      id: this.id,
-      title: this.title,
-      author: this.author,
-      price: this.price,
-      category: this.category,
-      isbn: this.isbn,
-      stock: this.stock,
-      description: this.description,
-      createdAt: this.createdAt
-    };
-  }
+  toJSON() {}
 
   /**
killedBy: Product Model - Unit Tests toJSON should serialize product to JSON object
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/models/product.js:154:25
    * @param {object} data - Plain object with product data
    * @returns {Product} Product instance
    */
-  static fromJSON(data) {
-    const product = new Product(
-      data.id,
-      data.title,
-      data.author,
-      data.price,
-      data.category,
-      data.isbn,
-      data.stock,
-      data.description
-    );
-    
-    if (data.createdAt) {
-      product.createdAt = new Date(data.createdAt);
-    }
-    
-    return product;
-  }
+  static fromJSON(data) {}
 }
 
killedBy: CatalogService - Unit Tests updateProduct should reject non-number stock values
statusReason: Expected values to be strictly equal:

0 !== 10

[Killed] ConditionalExpression
src/models/product.js:166:9
       data.description
     );
     
-    if (data.createdAt) {
+    if (true) {
       product.createdAt = new Date(data.createdAt);
     }
killedBy: InventoryService - Unit Tests restockProduct should auto-adjust when exceeding max stock with autoAdjust
statusReason: Expected values to be strictly equal:

30 !== 40

[Killed] ConditionalExpression
src/models/product.js:166:9
       data.description
     );
     
-    if (data.createdAt) {
+    if (false) {
       product.createdAt = new Date(data.createdAt);
     }
killedBy: CatalogService - Unit Tests updateProduct should ignore title when not a string
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'New Title'
- 'Test Book One'
