[Killed] BlockStatement
src/models/user.js:7:36
  */
 
 export class User {
-  constructor(userId, email, name) {
-    this.userId = userId;
-    this.email = email;
-    this.name = name;
-    this.createdAt = new Date();
-    this.lastLogin = null;
-    this.isActive = true;
-    this.role = 'customer'; // customer, admin
-    this.orderHistory = [];
-  }
+  constructor(userId, email, name) {}
 
   /**
killedBy: User Model - Unit Tests constructor should create user with required fields
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- 'user-001'

[Killed] BooleanLiteral
src/models/user.js:13:21
     this.name = name;
     this.createdAt = new Date();
     this.lastLogin = null;
-    this.isActive = true;
+    this.isActive = false;
     this.role = 'customer'; // customer, admin
     this.orderHistory = [];
killedBy: User Model - Unit Tests constructor should create user with required fields
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/models/user.js:21:17
   /**
    * Updates last login timestamp
    */
-  recordLogin() {
-    this.lastLogin = new Date();
-  }
+  recordLogin() {}
 
   /**
killedBy: User Model - Unit Tests recordLogin should update lastLogin timestamp
statusReason: The expression evaluated to a falsy value:

  assert.ok(user.lastLogin instanceof Date)

[Killed] BlockStatement
src/models/user.js:29:21
    * Checks if user account is active
    * @returns {boolean} true if active
    */
-  isAccountActive() {
-    return this.isActive === true;
-  }
+  isAccountActive() {}
 
   /**
killedBy: User Model - Unit Tests isAccountActive should return true for active account
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] ConditionalExpression
src/models/user.js:30:12
    * @returns {boolean} true if active
    */
   isAccountActive() {
-    return this.isActive === true;
+    return true;
   }
 
killedBy: User Model - Unit Tests isAccountActive should return false for deactivated account
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/models/user.js:30:12
    * @returns {boolean} true if active
    */
   isAccountActive() {
-    return this.isActive === true;
+    return false;
   }
 
killedBy: User Model - Unit Tests isAccountActive should return true for active account
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/models/user.js:37:23
    * Deactivates user account
    * @returns {boolean} true if successful
    */
-  deactivateAccount() {
-    if (!this.isActive) {
-      return false; // Already deactivated
-    }
-    
-    this.isActive = false;
-    return true;
-  }
+  deactivateAccount() {}
 
   /**
killedBy: User Model - Unit Tests deactivateAccount should deactivate active account
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] ConditionalExpression
src/models/user.js:38:9
    * @returns {boolean} true if successful
    */
   deactivateAccount() {
-    if (!this.isActive) {
+    if (true) {
       return false; // Already deactivated
     }
killedBy: User Model - Unit Tests deactivateAccount should deactivate active account
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/models/user.js:38:9
    * @returns {boolean} true if successful
    */
   deactivateAccount() {
-    if (!this.isActive) {
+    if (this.isActive) {
       return false; // Already deactivated
     }
killedBy: User Model - Unit Tests deactivateAccount should deactivate active account
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/models/user.js:39:14
    */
   deactivateAccount() {
     if (!this.isActive) {
-      return false; // Already deactivated
+      return true; // Already deactivated
     }
     
killedBy: User Model - Unit Tests deactivateAccount should return false if already deactivated
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/models/user.js:42:21
       return false; // Already deactivated
     }
     
-    this.isActive = false;
+    this.isActive = true;
     return true;
   }
killedBy: User Model - Unit Tests deactivateAccount should deactivate active account
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/models/user.js:43:12
     }
     
     this.isActive = false;
-    return true;
+    return false;
   }
 
killedBy: User Model - Unit Tests deactivateAccount should deactivate active account
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/models/user.js:50:21
    * Activates user account
    * @returns {boolean} true if successful
    */
-  activateAccount() {
-    if (this.isActive) {
-      return false; // Already active
-    }
-    
-    this.isActive = true;
-    return true;
-  }
+  activateAccount() {}
 
   /**
killedBy: User Model - Unit Tests activateAccount should activate deactivated account
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] BlockStatement
src/models/user.js:51:24
    * @returns {boolean} true if successful
    */
   activateAccount() {
-    if (this.isActive) {
-      return false; // Already active
-    }
+    if (this.isActive) {}
     
     this.isActive = true;
killedBy: User Model - Unit Tests activateAccount should return false if already active
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/models/user.js:51:9
    * @returns {boolean} true if successful
    */
   activateAccount() {
-    if (this.isActive) {
+    if (true) {
       return false; // Already active
     }
killedBy: User Model - Unit Tests activateAccount should activate deactivated account
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/models/user.js:52:14
    */
   activateAccount() {
     if (this.isActive) {
-      return false; // Already active
+      return true; // Already active
     }
     
killedBy: User Model - Unit Tests activateAccount should return false if already active
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/models/user.js:55:21
       return false; // Already active
     }
     
-    this.isActive = true;
+    this.isActive = false;
     return true;
   }
killedBy: User Model - Unit Tests activateAccount should activate deactivated account
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/models/user.js:56:12
     }
     
     this.isActive = true;
-    return true;
+    return false;
   }
 
killedBy: User Model - Unit Tests activateAccount should activate deactivated account
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/models/user.js:63:30
    * Adds order to user's history
    * @param {string} orderId - Order identifier
    */
-  addOrderToHistory(orderId) {
-    if (orderId && !this.orderHistory.includes(orderId)) {
-      this.orderHistory.push(orderId);
-    }
-  }
+  addOrderToHistory(orderId) {}
 
   /**
killedBy: User Model - Unit Tests addOrderToHistory should add order to empty history
statusReason: Expected values to be strictly equal:

0 !== 1

[Killed] ConditionalExpression
src/models/user.js:64:9
    * @param {string} orderId - Order identifier
    */
   addOrderToHistory(orderId) {
-    if (orderId && !this.orderHistory.includes(orderId)) {
+    if (true) {
       this.orderHistory.push(orderId);
     }
killedBy: User Model - Unit Tests addOrderToHistory should not add duplicate orders
statusReason: Expected values to be strictly equal:

2 !== 1

[Killed] LogicalOperator
src/models/user.js:64:9
    * @param {string} orderId - Order identifier
    */
   addOrderToHistory(orderId) {
-    if (orderId && !this.orderHistory.includes(orderId)) {
+    if (orderId || !this.orderHistory.includes(orderId)) {
       this.orderHistory.push(orderId);
     }
killedBy: User Model - Unit Tests addOrderToHistory should not add duplicate orders
statusReason: Expected values to be strictly equal:

2 !== 1

[Killed] BlockStatement
src/models/user.js:73:21
    * Checks if user has placed any orders
    * @returns {boolean} true if user has order history
    */
-  hasOrderHistory() {
-    return this.orderHistory.length > 0;
-  }
+  hasOrderHistory() {}
 
   /**
killedBy: User Model - Unit Tests hasOrderHistory should return false for new user
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] EqualityOperator
src/models/user.js:74:12
    * @returns {boolean} true if user has order history
    */
   hasOrderHistory() {
-    return this.orderHistory.length > 0;
+    return this.orderHistory.length >= 0;
   }
 
killedBy: User Model - Unit Tests hasOrderHistory should return false for new user
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/models/user.js:74:12
    * @returns {boolean} true if user has order history
    */
   hasOrderHistory() {
-    return this.orderHistory.length > 0;
+    return true;
   }
 
killedBy: User Model - Unit Tests hasOrderHistory should return false for new user
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BlockStatement
src/models/user.js:81:13
    * Checks if user is an admin
    * @returns {boolean} true if admin role
    */
-  isAdmin() {
-    return this.role === 'admin';
-  }
+  isAdmin() {}
 
   /**
killedBy: User Model - Unit Tests isAdmin should return false for customer role
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] ConditionalExpression
src/models/user.js:82:12
    * @returns {boolean} true if admin role
    */
   isAdmin() {
-    return this.role === 'admin';
+    return true;
   }
 
killedBy: User Model - Unit Tests isAdmin should return false for customer role
statusReason: Expected values to be strictly equal:

true !== false

[Killed] EqualityOperator
src/models/user.js:82:12
    * @returns {boolean} true if admin role
    */
   isAdmin() {
-    return this.role === 'admin';
+    return this.role !== 'admin';
   }
 
killedBy: User Model - Unit Tests isAdmin should return false for customer role
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BlockStatement
src/models/user.js:89:12
    * Converts user to plain object (without sensitive data)
    * @returns {object} Plain object representation
    */
-  toJSON() {
-    return {
-      userId: this.userId,
-      email: this.email,
-      name: this.name,
-      createdAt: this.createdAt,
-      lastLogin: this.lastLogin,
-      isActive: this.isActive,
-      role: this.role,
-      orderHistory: this.orderHistory
-    };
-  }
+  toJSON() {}
 
   /**
killedBy: User Model - Unit Tests toJSON should convert user to plain object
statusReason: Cannot read properties of undefined (reading 'userId')

[NoCoverage] BlockStatement
src/models/user.js:107:25
    * @param {object} data - Plain object with user data
    * @returns {User} User instance
    */
-  static fromJSON(data) {
-    const user = new User(data.userId, data.email, data.name);
-    user.createdAt = data.createdAt ? new Date(data.createdAt) : new Date();
-    user.lastLogin = data.lastLogin ? new Date(data.lastLogin) : null;
-    user.isActive = data.isActive !== undefined ? data.isActive : true;
-    user.role = data.role || 'customer';
-    user.orderHistory = data.orderHistory || [];
-    return user;
-  }
+  static fromJSON(data) {}
 }
 

[NoCoverage] ConditionalExpression
src/models/user.js:111:21
     const user = new User(data.userId, data.email, data.name);
     user.createdAt = data.createdAt ? new Date(data.createdAt) : new Date();
     user.lastLogin = data.lastLogin ? new Date(data.lastLogin) : null;
-    user.isActive = data.isActive !== undefined ? data.isActive : true;
+    user.isActive = false ? data.isActive : true;
     user.role = data.role || 'customer';
     user.orderHistory = data.orderHistory || [];

[NoCoverage] EqualityOperator
src/models/user.js:111:21
     const user = new User(data.userId, data.email, data.name);
     user.createdAt = data.createdAt ? new Date(data.createdAt) : new Date();
     user.lastLogin = data.lastLogin ? new Date(data.lastLogin) : null;
-    user.isActive = data.isActive !== undefined ? data.isActive : true;
+    user.isActive = data.isActive === undefined ? data.isActive : true;
     user.role = data.role || 'customer';
     user.orderHistory = data.orderHistory || [];

[NoCoverage] ConditionalExpression
src/models/user.js:112:17
     user.createdAt = data.createdAt ? new Date(data.createdAt) : new Date();
     user.lastLogin = data.lastLogin ? new Date(data.lastLogin) : null;
     user.isActive = data.isActive !== undefined ? data.isActive : true;
-    user.role = data.role || 'customer';
+    user.role = true;
     user.orderHistory = data.orderHistory || [];
     return user;

[NoCoverage] ConditionalExpression
src/models/user.js:112:17
     user.createdAt = data.createdAt ? new Date(data.createdAt) : new Date();
     user.lastLogin = data.lastLogin ? new Date(data.lastLogin) : null;
     user.isActive = data.isActive !== undefined ? data.isActive : true;
-    user.role = data.role || 'customer';
+    user.role = false;
     user.orderHistory = data.orderHistory || [];
     return user;

[NoCoverage] LogicalOperator
src/models/user.js:113:25
     user.lastLogin = data.lastLogin ? new Date(data.lastLogin) : null;
     user.isActive = data.isActive !== undefined ? data.isActive : true;
     user.role = data.role || 'customer';
-    user.orderHistory = data.orderHistory || [];
+    user.orderHistory = data.orderHistory && [];
     return user;
   }

[NoCoverage] ConditionalExpression
src/models/user.js:113:25
     user.lastLogin = data.lastLogin ? new Date(data.lastLogin) : null;
     user.isActive = data.isActive !== undefined ? data.isActive : true;
     user.role = data.role || 'customer';
-    user.orderHistory = data.orderHistory || [];
+    user.orderHistory = false;
     return user;
   }
