[Killed] BlockStatement
src/services/catalogService.js:22:38
  * Loads products from JSON file
  * @returns {Promise<boolean>} true if successful
  */
-export async function loadProducts() {
-  try {
-    const dataPath = path.join(__dirname, '../../data/products.json');
-    const data = await fs.readFile(dataPath, 'utf-8');
-    const productsData = JSON.parse(data);
-    
-    productCatalog = productsData.map(p => Product.fromJSON(p));
-    return true;
-  } catch (error) {
-    console.error('Failed to load products:', error.message);
-    return false;
-  }
-}
+export async function loadProducts() {}
 
 /**
killedBy: CatalogService - Unit Tests updateProduct should reject non-number stock values
statusReason: Expected values to be strictly equal:

0 !== 10

[Killed] BlockStatement
src/services/catalogService.js:23:7
  * @returns {Promise<boolean>} true if successful
  */
 export async function loadProducts() {
-  try {
-    const dataPath = path.join(__dirname, '../../data/products.json');
-    const data = await fs.readFile(dataPath, 'utf-8');
-    const productsData = JSON.parse(data);
-    
-    productCatalog = productsData.map(p => Product.fromJSON(p));
-    return true;
-  } catch (error) {
+  try {} catch (error) {
     console.error('Failed to load products:', error.message);
     return false;
killedBy: CatalogService - Unit Tests updateProduct should reject non-number stock values
statusReason: Expected values to be strictly equal:

0 !== 10

[Killed] ArrowFunction
src/services/catalogService.js:28:39
     const data = await fs.readFile(dataPath, 'utf-8');
     const productsData = JSON.parse(data);
     
-    productCatalog = productsData.map(p => Product.fromJSON(p));
+    productCatalog = productsData.map(() => undefined);
     return true;
   } catch (error) {
killedBy: CatalogService - Unit Tests searchProducts should find products matching title
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/services/catalogService.js:29:12
     const productsData = JSON.parse(data);
     
     productCatalog = productsData.map(p => Product.fromJSON(p));
-    return true;
+    return false;
   } catch (error) {
     console.error('Failed to load products:', error.message);
killedBy: CatalogService - Unit Tests searchProducts should find products matching title
statusReason: Expected values to be strictly equal:

false !== true

[NoCoverage] BlockStatement
src/services/catalogService.js:30:19
     
     productCatalog = productsData.map(p => Product.fromJSON(p));
     return true;
-  } catch (error) {
-    console.error('Failed to load products:', error.message);
-    return false;
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BooleanLiteral
src/services/catalogService.js:32:12
     return true;
   } catch (error) {
     console.error('Failed to load products:', error.message);
-    return false;
+    return true;
   }
 }

[NoCoverage] BlockStatement
src/services/catalogService.js:40:38
  * Saves products to JSON file
  * @returns {Promise<boolean>} true if successful
  */
-export async function saveProducts() {
-  try {
-    const dataPath = path.join(__dirname, '../../data/products.json');
-    const data = JSON.stringify(productCatalog.map(p => p.toJSON()), null, 2);
-    await fs.writeFile(dataPath, data, 'utf-8');
-    return true;
-  } catch (error) {
-    console.error('Failed to save products:', error.message);
-    return false;
-  }
-}
+export async function saveProducts() {}
 
 /**

[NoCoverage] BlockStatement
src/services/catalogService.js:41:7
  * @returns {Promise<boolean>} true if successful
  */
 export async function saveProducts() {
-  try {
-    const dataPath = path.join(__dirname, '../../data/products.json');
-    const data = JSON.stringify(productCatalog.map(p => p.toJSON()), null, 2);
-    await fs.writeFile(dataPath, data, 'utf-8');
-    return true;
-  } catch (error) {
+  try {} catch (error) {
     console.error('Failed to save products:', error.message);
     return false;

[NoCoverage] ArrowFunction
src/services/catalogService.js:43:52
 export async function saveProducts() {
   try {
     const dataPath = path.join(__dirname, '../../data/products.json');
-    const data = JSON.stringify(productCatalog.map(p => p.toJSON()), null, 2);
+    const data = JSON.stringify(productCatalog.map(() => undefined), null, 2);
     await fs.writeFile(dataPath, data, 'utf-8');
     return true;

[NoCoverage] BooleanLiteral
src/services/catalogService.js:45:12
     const dataPath = path.join(__dirname, '../../data/products.json');
     const data = JSON.stringify(productCatalog.map(p => p.toJSON()), null, 2);
     await fs.writeFile(dataPath, data, 'utf-8');
-    return true;
+    return false;
   } catch (error) {
     console.error('Failed to save products:', error.message);

[NoCoverage] BlockStatement
src/services/catalogService.js:46:19
     const data = JSON.stringify(productCatalog.map(p => p.toJSON()), null, 2);
     await fs.writeFile(dataPath, data, 'utf-8');
     return true;
-  } catch (error) {
-    console.error('Failed to save products:', error.message);
-    return false;
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BooleanLiteral
src/services/catalogService.js:48:12
     return true;
   } catch (error) {
     console.error('Failed to save products:', error.message);
-    return false;
+    return true;
   }
 }

[Killed] BlockStatement
src/services/catalogService.js:60:45
  */
 export function getAllProducts(page = 1, limit = 20) {
   // Validation with nested conditions
-  if (typeof page !== 'number' || page < 1) {
-    page = 1;
-  }
+  if (typeof page !== 'number' || page < 1) {}
 
   if (typeof limit !== 'number' || limit < 1) {
killedBy: CatalogService - Unit Tests getAllProducts - pagination should handle page parameter less than 1
statusReason: Expected values to be strictly equal:

0 !== 1

[Killed] ConditionalExpression
src/services/catalogService.js:60:35
  */
 export function getAllProducts(page = 1, limit = 20) {
   // Validation with nested conditions
-  if (typeof page !== 'number' || page < 1) {
+  if (typeof page !== 'number' || false) {
     page = 1;
   }
killedBy: CatalogService - Unit Tests getAllProducts - pagination should handle page parameter less than 1
statusReason: Expected values to be strictly equal:

0 !== 1

[Killed] LogicalOperator
src/services/catalogService.js:64:7
     page = 1;
   }
 
-  if (typeof limit !== 'number' || limit < 1) {
+  if (typeof limit !== 'number' && limit < 1) {
     limit = 20;
   } else if (limit > 100) {
killedBy: CatalogService - Unit Tests getAllProducts - pagination should handle limit less than 1
statusReason: Expected values to be strictly equal:

0 !== 20

[Killed] BlockStatement
src/services/catalogService.js:64:47
     page = 1;
   }
 
-  if (typeof limit !== 'number' || limit < 1) {
-    limit = 20;
-  } else if (limit > 100) {
+  if (typeof limit !== 'number' || limit < 1) {} else if (limit > 100) {
     limit = 100; // Cap maximum limit
   }
killedBy: CatalogService - Unit Tests getAllProducts - pagination should handle limit less than 1
statusReason: Expected values to be strictly equal:

0 !== 20

[Killed] ConditionalExpression
src/services/catalogService.js:66:14
 
   if (typeof limit !== 'number' || limit < 1) {
     limit = 20;
-  } else if (limit > 100) {
+  } else if (false) {
     limit = 100; // Cap maximum limit
   }
killedBy: CatalogService - Unit Tests getAllProducts - pagination should cap limit at 100
statusReason: Expected values to be strictly equal:

200 !== 100

[Killed] ConditionalExpression
src/services/catalogService.js:66:14
 
   if (typeof limit !== 'number' || limit < 1) {
     limit = 20;
-  } else if (limit > 100) {
+  } else if (true) {
     limit = 100; // Cap maximum limit
   }
killedBy: CatalogService - Unit Tests getAllProducts - pagination should return first page with default limit
statusReason: Expected values to be strictly equal:

100 !== 20

[Survived] ArithmeticOperator
src/services/catalogService.js:70:23
     limit = 100; // Cap maximum limit
   }
 
-  const startIndex = (page - 1) * limit;
+  const startIndex = (page + 1) * limit;
   const endIndex = startIndex + limit;
   

[Survived] ArithmeticOperator
src/services/catalogService.js:70:22
     limit = 100; // Cap maximum limit
   }
 
-  const startIndex = (page - 1) * limit;
+  const startIndex = (page - 1) / limit;
   const endIndex = startIndex + limit;
   

[Killed] ArithmeticOperator
src/services/catalogService.js:71:20
   }
 
   const startIndex = (page - 1) * limit;
-  const endIndex = startIndex + limit;
+  const endIndex = startIndex - limit;
   
   const paginatedProducts = productCatalog.slice(startIndex, endIndex);
killedBy: CatalogService - Unit Tests getAllProducts - pagination should set hasMore to false on last page
statusReason: Expected values to be strictly equal:

true !== false

[Survived] MethodExpression
src/services/catalogService.js:73:29
   const startIndex = (page - 1) * limit;
   const endIndex = startIndex + limit;
   
-  const paginatedProducts = productCatalog.slice(startIndex, endIndex);
+  const paginatedProducts = productCatalog;
   
   return {

[Killed] ArithmeticOperator
src/services/catalogService.js:80:27
     page,
     limit,
     total: productCatalog.length,
-    totalPages: Math.ceil(productCatalog.length / limit),
+    totalPages: Math.ceil(productCatalog.length * limit),
     hasMore: endIndex < productCatalog.length
   };
killedBy: CatalogService - Unit Tests getAllProducts - pagination should calculate total pages correctly
statusReason: Expected values to be strictly equal:

8 !== 2

[Killed] EqualityOperator
src/services/catalogService.js:81:14
     limit,
     total: productCatalog.length,
     totalPages: Math.ceil(productCatalog.length / limit),
-    hasMore: endIndex < productCatalog.length
+    hasMore: endIndex >= productCatalog.length
   };
 }
killedBy: CatalogService - Unit Tests getAllProducts - pagination should set hasMore to false on last page
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/services/catalogService.js:81:14
     limit,
     total: productCatalog.length,
     totalPages: Math.ceil(productCatalog.length / limit),
-    hasMore: endIndex < productCatalog.length
+    hasMore: true
   };
 }
killedBy: CatalogService - Unit Tests getAllProducts - pagination should set hasMore to false on last page
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BlockStatement
src/services/catalogService.js:90:43
  * @param {string} productId - Product identifier
  * @returns {Product|null} Product or null if not found
  */
-export function getProductById(productId) {
-  if (!productId) {
-    return null;
-  }
-
-  return productCatalog.find(p => p.id === productId) || null;
-}
+export function getProductById(productId) {}
 
 /**
killedBy: CatalogService - Unit Tests getProductById should return product when ID exists
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'undefined'
- 'object'

[Killed] ConditionalExpression
src/services/catalogService.js:91:7
  * @returns {Product|null} Product or null if not found
  */
 export function getProductById(productId) {
-  if (!productId) {
+  if (true) {
     return null;
   }
killedBy: CatalogService - Unit Tests getProductById should return product when ID exists
statusReason: Cannot read properties of null (reading 'id')

[Killed] BooleanLiteral
src/services/catalogService.js:91:7
  * @returns {Product|null} Product or null if not found
  */
 export function getProductById(productId) {
-  if (!productId) {
+  if (productId) {
     return null;
   }
killedBy: CatalogService - Unit Tests getProductById should return product when ID exists
statusReason: Cannot read properties of null (reading 'id')

[Killed] ConditionalExpression
src/services/catalogService.js:95:35
     return null;
   }
 
-  return productCatalog.find(p => p.id === productId) || null;
+  return productCatalog.find(p => false) || null;
 }
 
killedBy: CatalogService - Unit Tests getProductById should return product when ID exists
statusReason: Cannot read properties of null (reading 'id')

[Killed] ConditionalExpression
src/services/catalogService.js:95:10
     return null;
   }
 
-  return productCatalog.find(p => p.id === productId) || null;
+  return false;
 }
 
killedBy: CatalogService - Unit Tests getProductById should return product when ID exists
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'boolean'
- 'object'

[Killed] BooleanLiteral
src/services/catalogService.js:108:7
   // console.log('Searching products with query inside catalogServices.js:', query);
   // Validate query
   const validation = validateSearchQuery(query);
-  if (!validation.valid) {
+  if (validation.valid) {
     return [];
   }
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] ConditionalExpression
src/services/catalogService.js:108:7
   // console.log('Searching products with query inside catalogServices.js:', query);
   // Validate query
   const validation = validateSearchQuery(query);
-  if (!validation.valid) {
+  if (true) {
     return [];
   }
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] MethodExpression
src/services/catalogService.js:112:22
     return [];
   }
 
-  const searchTerm = query.toLowerCase().trim();
+  const searchTerm = query.toUpperCase().trim();
   const { searchFields = ['title', 'author', 'description'], caseSensitive = false } = options;
 
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Survived] MethodExpression
src/services/catalogService.js:112:22
     return [];
   }
 
-  const searchTerm = query.toLowerCase().trim();
+  const searchTerm = query.toLowerCase();
   const { searchFields = ['title', 'author', 'description'], caseSensitive = false } = options;
 

[Killed] BooleanLiteral
src/services/catalogService.js:113:78
   }
 
   const searchTerm = query.toLowerCase().trim();
-  const { searchFields = ['title', 'author', 'description'], caseSensitive = false } = options;
+  const { searchFields = ['title', 'author', 'description'], caseSensitive = true } = options;
 
   const results = [];
killedBy: CatalogService - Unit Tests searchProducts should handle case-insensitive search
statusReason: Expected values to be strictly equal:

2 !== 0

[Killed] UpdateOperator
src/services/catalogService.js:118:46
   const results = [];
 
   // Iterate through catalog with nested matching logic
-  for (let i = 0; i < productCatalog.length; i++) {
+  for (let i = 0; i < productCatalog.length; i--) {
     const product = productCatalog[i];
     let matched = false;
killedBy: CatalogService - Unit Tests searchProducts should find products matching title
statusReason: Cannot read properties of undefined (reading 'title')

[Killed] EqualityOperator
src/services/catalogService.js:118:19
   const results = [];
 
   // Iterate through catalog with nested matching logic
-  for (let i = 0; i < productCatalog.length; i++) {
+  for (let i = 0; i >= productCatalog.length; i++) {
     const product = productCatalog[i];
     let matched = false;
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] BooleanLiteral
src/services/catalogService.js:120:19
   // Iterate through catalog with nested matching logic
   for (let i = 0; i < productCatalog.length; i++) {
     const product = productCatalog[i];
-    let matched = false;
+    let matched = true;
 
     // Check each search field
killedBy: CatalogService - Unit Tests searchProducts should find products matching title
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/services/catalogService.js:124:11
 
     // Check each search field
     for (const field of searchFields) {
-      if (matched) break; // Already matched, skip remaining fields
+      if (true) break; // Already matched, skip remaining fields
 
       let fieldValue = product[field];
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Survived] ConditionalExpression
src/services/catalogService.js:124:11
 
     // Check each search field
     for (const field of searchFields) {
-      if (matched) break; // Already matched, skip remaining fields
+      if (false) break; // Already matched, skip remaining fields
 
       let fieldValue = product[field];

[Killed] ConditionalExpression
src/services/catalogService.js:128:11
 
       let fieldValue = product[field];
       
-      if (!fieldValue) continue;
+      if (true) continue;
 
       if (typeof fieldValue !== 'string') {
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] BooleanLiteral
src/services/catalogService.js:128:11
 
       let fieldValue = product[field];
       
-      if (!fieldValue) continue;
+      if (fieldValue) continue;
 
       if (typeof fieldValue !== 'string') {
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] BlockStatement
src/services/catalogService.js:130:43
       
       if (!fieldValue) continue;
 
-      if (typeof fieldValue !== 'string') {
-        fieldValue = String(fieldValue);
-      }
+      if (typeof fieldValue !== 'string') {}
 
       const compareValue = caseSensitive ? fieldValue : fieldValue.toLowerCase();
killedBy: CatalogService - Unit Tests searchProducts - advanced should handle numeric field values
statusReason: fieldValue.toLowerCase is not a function

[Killed] EqualityOperator
src/services/catalogService.js:130:11
       
       if (!fieldValue) continue;
 
-      if (typeof fieldValue !== 'string') {
+      if (typeof fieldValue === 'string') {
         fieldValue = String(fieldValue);
       }
killedBy: CatalogService - Unit Tests searchProducts - advanced should handle numeric field values
statusReason: fieldValue.toLowerCase is not a function

[Killed] MethodExpression
src/services/catalogService.js:134:57
         fieldValue = String(fieldValue);
       }
 
-      const compareValue = caseSensitive ? fieldValue : fieldValue.toLowerCase();
+      const compareValue = caseSensitive ? fieldValue : fieldValue.toUpperCase();
       const compareQuery = caseSensitive ? query : searchTerm;
 
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] BlockStatement
src/services/catalogService.js:138:48
       const compareQuery = caseSensitive ? query : searchTerm;
 
       // Multiple matching strategies
-      if (compareValue.includes(compareQuery)) {
-        matched = true;
-      } else if (compareValue.startsWith(compareQuery)) {
+      if (compareValue.includes(compareQuery)) {} else if (compareValue.startsWith(compareQuery)) {
         matched = true;
       } else {
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] ConditionalExpression
src/services/catalogService.js:138:11
       const compareQuery = caseSensitive ? query : searchTerm;
 
       // Multiple matching strategies
-      if (compareValue.includes(compareQuery)) {
+      if (true) {
         matched = true;
       } else if (compareValue.startsWith(compareQuery)) {
killedBy: CatalogService - Unit Tests searchProducts should find products matching title
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/services/catalogService.js:139:19
 
       // Multiple matching strategies
       if (compareValue.includes(compareQuery)) {
-        matched = true;
+        matched = false;
       } else if (compareValue.startsWith(compareQuery)) {
         matched = true;
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] ConditionalExpression
src/services/catalogService.js:140:18
       // Multiple matching strategies
       if (compareValue.includes(compareQuery)) {
         matched = true;
-      } else if (compareValue.startsWith(compareQuery)) {
+      } else if (true) {
         matched = true;
       } else {
killedBy: CatalogService - Unit Tests searchProducts should find products matching title
statusReason: Expected values to be strictly equal:

false !== true

[Survived] ConditionalExpression
src/services/catalogService.js:140:18
       // Multiple matching strategies
       if (compareValue.includes(compareQuery)) {
         matched = true;
-      } else if (compareValue.startsWith(compareQuery)) {
+      } else if (false) {
         matched = true;
       } else {

[NoCoverage] BooleanLiteral
src/services/catalogService.js:141:19
       if (compareValue.includes(compareQuery)) {
         matched = true;
       } else if (compareValue.startsWith(compareQuery)) {
-        matched = true;
+        matched = false;
       } else {
         // Word-by-word matching

[Survived] BlockStatement
src/services/catalogService.js:142:14
         matched = true;
       } else if (compareValue.startsWith(compareQuery)) {
         matched = true;
-      } else {
-        // Word-by-word matching
-        const words = compareQuery.split(/\s+/);
-        let allWordsMatch = true;
-        
-        for (const word of words) {
-          if (word.length >= 3 && !compareValue.includes(word)) {
-            allWordsMatch = false;
-            break;
-          }
-        }
-        
-        if (allWordsMatch && words.length > 0) {
-          matched = true;
-        }
-      }
+      } else {}
     }
 

[Survived] BooleanLiteral
src/services/catalogService.js:145:29
       } else {
         // Word-by-word matching
         const words = compareQuery.split(/\s+/);
-        let allWordsMatch = true;
+        let allWordsMatch = false;
         
         for (const word of words) {

[Killed] BlockStatement
src/services/catalogService.js:147:35
         const words = compareQuery.split(/\s+/);
         let allWordsMatch = true;
         
-        for (const word of words) {
-          if (word.length >= 3 && !compareValue.includes(word)) {
-            allWordsMatch = false;
-            break;
-          }
-        }
+        for (const word of words) {}
         
         if (allWordsMatch && words.length > 0) {
killedBy: CatalogService - Unit Tests searchProducts should find products matching title
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/services/catalogService.js:148:65
         let allWordsMatch = true;
         
         for (const word of words) {
-          if (word.length >= 3 && !compareValue.includes(word)) {
-            allWordsMatch = false;
-            break;
-          }
+          if (word.length >= 3 && !compareValue.includes(word)) {}
         }
         
killedBy: CatalogService - Unit Tests searchProducts should find products matching title
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/services/catalogService.js:148:35
         let allWordsMatch = true;
         
         for (const word of words) {
-          if (word.length >= 3 && !compareValue.includes(word)) {
+          if (word.length >= 3 && compareValue.includes(word)) {
             allWordsMatch = false;
             break;
killedBy: CatalogService - Unit Tests searchProducts should find products matching title
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/services/catalogService.js:149:29
         
         for (const word of words) {
           if (word.length >= 3 && !compareValue.includes(word)) {
-            allWordsMatch = false;
+            allWordsMatch = true;
             break;
           }
killedBy: CatalogService - Unit Tests searchProducts should find products matching title
statusReason: Expected values to be strictly equal:

false !== true

[Killed] LogicalOperator
src/services/catalogService.js:154:13
           }
         }
         
-        if (allWordsMatch && words.length > 0) {
+        if (allWordsMatch || words.length > 0) {
           matched = true;
         }
killedBy: CatalogService - Unit Tests searchProducts should find products matching title
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/services/catalogService.js:154:13
           }
         }
         
-        if (allWordsMatch && words.length > 0) {
+        if (true) {
           matched = true;
         }
killedBy: CatalogService - Unit Tests searchProducts should find products matching title
statusReason: Expected values to be strictly equal:

false !== true

[Survived] BooleanLiteral
src/services/catalogService.js:155:21
         }
         
         if (allWordsMatch && words.length > 0) {
-          matched = true;
+          matched = false;
         }
       }

[Killed] ConditionalExpression
src/services/catalogService.js:160:9
       }
     }
 
-    if (matched) {
+    if (true) {
       results.push(product);
     }
killedBy: CatalogService - Unit Tests searchProducts should find products matching title
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/services/catalogService.js:160:18
       }
     }
 
-    if (matched) {
-      results.push(product);
-    }
+    if (matched) {}
   }
 
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] BlockStatement
src/services/catalogService.js:177:25
   let results = [...productCatalog];
 
   // Category filter
-  if (filters.category) {
-    if (validateCategory(filters.category)) {
-      const categoryLower = filters.category.toLowerCase();
-      results = results.filter(p => p.category.toLowerCase() === categoryLower);
-    }
-  }
+  if (filters.category) {}
 
   // Price range filter with nested conditions
killedBy: CatalogService - Unit Tests filterProducts should filter by category
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'Non-Fiction'
- 'Fiction'

[Killed] ConditionalExpression
src/services/catalogService.js:177:7
   let results = [...productCatalog];
 
   // Category filter
-  if (filters.category) {
+  if (false) {
     if (validateCategory(filters.category)) {
       const categoryLower = filters.category.toLowerCase();
killedBy: CatalogService - Unit Tests filterProducts should filter by category
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'Non-Fiction'
- 'Fiction'

[Killed] ConditionalExpression
src/services/catalogService.js:178:9
 
   // Category filter
   if (filters.category) {
-    if (validateCategory(filters.category)) {
+    if (false) {
       const categoryLower = filters.category.toLowerCase();
       results = results.filter(p => p.category.toLowerCase() === categoryLower);
killedBy: CatalogService - Unit Tests filterProducts should filter by category
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'Non-Fiction'
- 'Fiction'

[Killed] BlockStatement
src/services/catalogService.js:178:45
 
   // Category filter
   if (filters.category) {
-    if (validateCategory(filters.category)) {
-      const categoryLower = filters.category.toLowerCase();
-      results = results.filter(p => p.category.toLowerCase() === categoryLower);
-    }
+    if (validateCategory(filters.category)) {}
   }
 
killedBy: CatalogService - Unit Tests filterProducts should filter by category
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'Non-Fiction'
- 'Fiction'

[Survived] MethodExpression
src/services/catalogService.js:179:29
   // Category filter
   if (filters.category) {
     if (validateCategory(filters.category)) {
-      const categoryLower = filters.category.toLowerCase();
+      const categoryLower = filters.category.toUpperCase();
       results = results.filter(p => p.category.toLowerCase() === categoryLower);
     }

[Killed] MethodExpression
src/services/catalogService.js:180:17
   if (filters.category) {
     if (validateCategory(filters.category)) {
       const categoryLower = filters.category.toLowerCase();
-      results = results.filter(p => p.category.toLowerCase() === categoryLower);
+      results = results;
     }
   }
killedBy: CatalogService - Unit Tests filterProducts should filter by category
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'Non-Fiction'
- 'Fiction'
