[Killed] ConditionalExpression
src/services/catalogService.js:180:37
   if (filters.category) {
     if (validateCategory(filters.category)) {
       const categoryLower = filters.category.toLowerCase();
-      results = results.filter(p => p.category.toLowerCase() === categoryLower);
+      results = results.filter(p => true);
     }
   }
killedBy: CatalogService - Unit Tests filterProducts should filter by category
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'Non-Fiction'
- 'Fiction'

[Killed] BlockStatement
src/services/catalogService.js:185:73
   }
 
   // Price range filter with nested conditions
-  if (filters.minPrice !== undefined || filters.maxPrice !== undefined) {
-    results = results.filter(product => {
-      const price = product.price;
-      
-      if (filters.minPrice !== undefined && filters.maxPrice !== undefined) {
-        // Both min and max specified
-        return price >= filters.minPrice && price <= filters.maxPrice;
-      } else if (filters.minPrice !== undefined) {
-        // Only min specified
-        return price >= filters.minPrice;
-      } else {
-        // Only max specified
-        return price <= filters.maxPrice;
-      }
-    });
-  }
+  if (filters.minPrice !== undefined || filters.maxPrice !== undefined) {}
 
   // In stock filter
killedBy: CatalogService - Unit Tests filterProducts should filter by minimum price
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.price >= minPrice)

[Killed] EqualityOperator
src/services/catalogService.js:185:7
   }
 
   // Price range filter with nested conditions
-  if (filters.minPrice !== undefined || filters.maxPrice !== undefined) {
+  if (filters.minPrice === undefined || filters.maxPrice !== undefined) {
     results = results.filter(product => {
       const price = product.price;
killedBy: CatalogService - Unit Tests filterProducts should filter by minimum price
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.price >= minPrice)

[Killed] MethodExpression
src/services/catalogService.js:186:15
 
   // Price range filter with nested conditions
   if (filters.minPrice !== undefined || filters.maxPrice !== undefined) {
-    results = results.filter(product => {
-      const price = product.price;
-      
-      if (filters.minPrice !== undefined && filters.maxPrice !== undefined) {
-        // Both min and max specified
-        return price >= filters.minPrice && price <= filters.maxPrice;
-      } else if (filters.minPrice !== undefined) {
-        // Only min specified
-        return price >= filters.minPrice;
-      } else {
-        // Only max specified
-        return price <= filters.maxPrice;
-      }
-    });
+    results = results;
   }
 
killedBy: CatalogService - Unit Tests filterProducts should filter by minimum price
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.price >= minPrice)

[Survived] BlockStatement
src/services/catalogService.js:186:41
 
   // Price range filter with nested conditions
   if (filters.minPrice !== undefined || filters.maxPrice !== undefined) {
-    results = results.filter(product => {
-      const price = product.price;
-      
-      if (filters.minPrice !== undefined && filters.maxPrice !== undefined) {
-        // Both min and max specified
-        return price >= filters.minPrice && price <= filters.maxPrice;
-      } else if (filters.minPrice !== undefined) {
-        // Only min specified
-        return price >= filters.minPrice;
-      } else {
-        // Only max specified
-        return price <= filters.maxPrice;
-      }
-    });
+    results = results.filter(product => {});
   }
 

[Killed] ConditionalExpression
src/services/catalogService.js:189:11
     results = results.filter(product => {
       const price = product.price;
       
-      if (filters.minPrice !== undefined && filters.maxPrice !== undefined) {
+      if (false) {
         // Both min and max specified
         return price >= filters.minPrice && price <= filters.maxPrice;
killedBy: CatalogService - Unit Tests filterProducts should filter by price range
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.price <= 30)

[Killed] EqualityOperator
src/services/catalogService.js:189:45
     results = results.filter(product => {
       const price = product.price;
       
-      if (filters.minPrice !== undefined && filters.maxPrice !== undefined) {
+      if (filters.minPrice !== undefined && filters.maxPrice === undefined) {
         // Both min and max specified
         return price >= filters.minPrice && price <= filters.maxPrice;
killedBy: CatalogService - Unit Tests filterProducts should filter by price range
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.price <= 30)

[Killed] ConditionalExpression
src/services/catalogService.js:191:16
       
       if (filters.minPrice !== undefined && filters.maxPrice !== undefined) {
         // Both min and max specified
-        return price >= filters.minPrice && price <= filters.maxPrice;
+        return true;
       } else if (filters.minPrice !== undefined) {
         // Only min specified
killedBy: CatalogService - Unit Tests filterProducts should filter by price range
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.price <= 30)

[Killed] LogicalOperator
src/services/catalogService.js:191:16
       
       if (filters.minPrice !== undefined && filters.maxPrice !== undefined) {
         // Both min and max specified
-        return price >= filters.minPrice && price <= filters.maxPrice;
+        return price >= filters.minPrice || price <= filters.maxPrice;
       } else if (filters.minPrice !== undefined) {
         // Only min specified
killedBy: CatalogService - Unit Tests filterProducts should filter by price range
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.price <= 30)

[Survived] BlockStatement
src/services/catalogService.js:192:50
       if (filters.minPrice !== undefined && filters.maxPrice !== undefined) {
         // Both min and max specified
         return price >= filters.minPrice && price <= filters.maxPrice;
-      } else if (filters.minPrice !== undefined) {
-        // Only min specified
-        return price >= filters.minPrice;
-      } else {
+      } else if (filters.minPrice !== undefined) {} else {
         // Only max specified
         return price <= filters.maxPrice;

[Survived] ConditionalExpression
src/services/catalogService.js:192:18
       if (filters.minPrice !== undefined && filters.maxPrice !== undefined) {
         // Both min and max specified
         return price >= filters.minPrice && price <= filters.maxPrice;
-      } else if (filters.minPrice !== undefined) {
+      } else if (true) {
         // Only min specified
         return price >= filters.minPrice;

[Killed] EqualityOperator
src/services/catalogService.js:194:16
         return price >= filters.minPrice && price <= filters.maxPrice;
       } else if (filters.minPrice !== undefined) {
         // Only min specified
-        return price >= filters.minPrice;
+        return price < filters.minPrice;
       } else {
         // Only max specified
killedBy: CatalogService - Unit Tests filterProducts should filter by minimum price
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.price >= minPrice)

[Killed] ConditionalExpression
src/services/catalogService.js:194:16
         return price >= filters.minPrice && price <= filters.maxPrice;
       } else if (filters.minPrice !== undefined) {
         // Only min specified
-        return price >= filters.minPrice;
+        return true;
       } else {
         // Only max specified
killedBy: CatalogService - Unit Tests filterProducts should filter by minimum price
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.price >= minPrice)

[Survived] BlockStatement
src/services/catalogService.js:195:14
       } else if (filters.minPrice !== undefined) {
         // Only min specified
         return price >= filters.minPrice;
-      } else {
-        // Only max specified
-        return price <= filters.maxPrice;
-      }
+      } else {}
     });
   }

[Killed] EqualityOperator
src/services/catalogService.js:197:16
         return price >= filters.minPrice;
       } else {
         // Only max specified
-        return price <= filters.maxPrice;
+        return price > filters.maxPrice;
       }
     });
killedBy: CatalogService - Unit Tests filterProducts should filter by maximum price
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.price <= maxPrice)

[Killed] ConditionalExpression
src/services/catalogService.js:197:16
         return price >= filters.minPrice;
       } else {
         // Only max specified
-        return price <= filters.maxPrice;
+        return true;
       }
     });
killedBy: CatalogService - Unit Tests filterProducts should filter by maximum price
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.price <= maxPrice)

[Killed] ConditionalExpression
src/services/catalogService.js:203:7
   }
 
   // In stock filter
-  if (filters.inStock === true) {
+  if (false) {
     results = results.filter(p => p.isInStock());
   } else if (filters.inStock === false) {
killedBy: CatalogService - Unit Tests filterProducts should filter by stock availability
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.stock > 0)

[Killed] EqualityOperator
src/services/catalogService.js:203:7
   }
 
   // In stock filter
-  if (filters.inStock === true) {
+  if (filters.inStock !== true) {
     results = results.filter(p => p.isInStock());
   } else if (filters.inStock === false) {
killedBy: CatalogService - Unit Tests filterProducts should filter by stock availability
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.stock > 0)

[Killed] MethodExpression
src/services/catalogService.js:204:15
 
   // In stock filter
   if (filters.inStock === true) {
-    results = results.filter(p => p.isInStock());
+    results = results;
   } else if (filters.inStock === false) {
     results = results.filter(p => !p.isInStock());
killedBy: CatalogService - Unit Tests filterProducts should filter by stock availability
statusReason: The expression evaluated to a falsy value:

  assert.ok(product.stock > 0)

[Survived] ArrowFunction
src/services/catalogService.js:204:30
 
   // In stock filter
   if (filters.inStock === true) {
-    results = results.filter(p => p.isInStock());
+    results = results.filter(() => undefined);
   } else if (filters.inStock === false) {
     results = results.filter(p => !p.isInStock());

[Killed] EqualityOperator
src/services/catalogService.js:205:14
   // In stock filter
   if (filters.inStock === true) {
     results = results.filter(p => p.isInStock());
-  } else if (filters.inStock === false) {
+  } else if (filters.inStock !== false) {
     results = results.filter(p => !p.isInStock());
   }
killedBy: CatalogService - Unit Tests filterProducts should return products with zero stock when inStock is false
statusReason: Expected values to be strictly equal:

10 !== 0

[Killed] BlockStatement
src/services/catalogService.js:205:41
   // In stock filter
   if (filters.inStock === true) {
     results = results.filter(p => p.isInStock());
-  } else if (filters.inStock === false) {
-    results = results.filter(p => !p.isInStock());
-  }
+  } else if (filters.inStock === false) {}
 
   // Low stock filter
killedBy: CatalogService - Unit Tests filterProducts should return products with zero stock when inStock is false
statusReason: Expected values to be strictly equal:

10 !== 0

[Killed] BooleanLiteral
src/services/catalogService.js:206:35
   if (filters.inStock === true) {
     results = results.filter(p => p.isInStock());
   } else if (filters.inStock === false) {
-    results = results.filter(p => !p.isInStock());
+    results = results.filter(p => p.isInStock());
   }
 
killedBy: CatalogService - Unit Tests filterProducts should return products with zero stock when inStock is false
statusReason: Expected values to be strictly equal:

10 !== 0

[Killed] MethodExpression
src/services/catalogService.js:206:15
   if (filters.inStock === true) {
     results = results.filter(p => p.isInStock());
   } else if (filters.inStock === false) {
-    results = results.filter(p => !p.isInStock());
+    results = results;
   }
 
killedBy: CatalogService - Unit Tests filterProducts should return products with zero stock when inStock is false
statusReason: Expected values to be strictly equal:

10 !== 0

[Killed] EqualityOperator
src/services/catalogService.js:210:7
   }
 
   // Low stock filter
-  if (filters.lowStock === true) {
+  if (filters.lowStock !== true) {
     const threshold = filters.lowStockThreshold || 5;
     results = results.filter(p => p.isLowStock(threshold));
killedBy: CatalogService - Unit Tests filterProducts - comprehensive should filter by lowStock
statusReason: The expression evaluated to a falsy value:

  assert.ok(p.isLowStock())

[Killed] BooleanLiteral
src/services/catalogService.js:210:28
   }
 
   // Low stock filter
-  if (filters.lowStock === true) {
+  if (filters.lowStock === false) {
     const threshold = filters.lowStockThreshold || 5;
     results = results.filter(p => p.isLowStock(threshold));
killedBy: CatalogService - Unit Tests filterProducts - comprehensive should filter by lowStock
statusReason: The expression evaluated to a falsy value:

  assert.ok(p.isLowStock())

[Survived] LogicalOperator
src/services/catalogService.js:211:23
 
   // Low stock filter
   if (filters.lowStock === true) {
-    const threshold = filters.lowStockThreshold || 5;
+    const threshold = filters.lowStockThreshold && 5;
     results = results.filter(p => p.isLowStock(threshold));
   }

[Survived] ConditionalExpression
src/services/catalogService.js:211:23
 
   // Low stock filter
   if (filters.lowStock === true) {
-    const threshold = filters.lowStockThreshold || 5;
+    const threshold = false;
     results = results.filter(p => p.isLowStock(threshold));
   }

[Killed] MethodExpression
src/services/catalogService.js:212:15
   // Low stock filter
   if (filters.lowStock === true) {
     const threshold = filters.lowStockThreshold || 5;
-    results = results.filter(p => p.isLowStock(threshold));
+    results = results;
   }
 
killedBy: CatalogService - Unit Tests filterProducts - comprehensive should filter by lowStock
statusReason: The expression evaluated to a falsy value:

  assert.ok(p.isLowStock())

[Survived] ArrowFunction
src/services/catalogService.js:212:30
   // Low stock filter
   if (filters.lowStock === true) {
     const threshold = filters.lowStockThreshold || 5;
-    results = results.filter(p => p.isLowStock(threshold));
+    results = results.filter(() => undefined);
   }
 

[Killed] ConditionalExpression
src/services/catalogService.js:216:7
   }
 
   // Author filter with partial matching
-  if (filters.author) {
+  if (true) {
     const authorLower = filters.author.toLowerCase();
     results = results.filter(p => 
killedBy: CatalogService - Unit Tests filterProducts should filter by category
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
src/services/catalogService.js:216:7
   }
 
   // Author filter with partial matching
-  if (filters.author) {
+  if (false) {
     const authorLower = filters.author.toLowerCase();
     results = results.filter(p => 
killedBy: CatalogService - Unit Tests filterProducts - comprehensive should filter by author
statusReason: The expression evaluated to a falsy value:

  assert.ok(p.author.toLowerCase().includes('test'))

[Survived] MethodExpression
src/services/catalogService.js:217:25
 
   // Author filter with partial matching
   if (filters.author) {
-    const authorLower = filters.author.toLowerCase();
+    const authorLower = filters.author.toUpperCase();
     results = results.filter(p => 
       p.author.toLowerCase().includes(authorLower)

[Killed] MethodExpression
src/services/catalogService.js:218:15
   // Author filter with partial matching
   if (filters.author) {
     const authorLower = filters.author.toLowerCase();
-    results = results.filter(p => 
-      p.author.toLowerCase().includes(authorLower)
-    );
+    results = results;
   }
 
killedBy: CatalogService - Unit Tests filterProducts - comprehensive should filter by author
statusReason: The expression evaluated to a falsy value:

  assert.ok(p.author.toLowerCase().includes('test'))

[Survived] ArrowFunction
src/services/catalogService.js:218:30
   // Author filter with partial matching
   if (filters.author) {
     const authorLower = filters.author.toLowerCase();
-    results = results.filter(p => 
-      p.author.toLowerCase().includes(authorLower)
+    results = results.filter(() => undefined
     );
   }

[Survived] MethodExpression
src/services/catalogService.js:219:7
   if (filters.author) {
     const authorLower = filters.author.toLowerCase();
     results = results.filter(p => 
-      p.author.toLowerCase().includes(authorLower)
+      p.author.toUpperCase().includes(authorLower)
     );
   }

[Killed] BooleanLiteral
src/services/catalogService.js:224:36
   }
 
   // Discount eligible filter
-  if (filters.discountEligible === true) {
+  if (filters.discountEligible === false) {
     results = results.filter(p => p.isDiscountEligible());
   }
killedBy: CatalogService - Unit Tests filterProducts - comprehensive should filter by discountEligible
statusReason: The expression evaluated to a falsy value:

  assert.ok(p.isDiscountEligible())

[Killed] BlockStatement
src/services/catalogService.js:224:42
   }
 
   // Discount eligible filter
-  if (filters.discountEligible === true) {
-    results = results.filter(p => p.isDiscountEligible());
-  }
+  if (filters.discountEligible === true) {}
 
   return results;
killedBy: CatalogService - Unit Tests filterProducts - comprehensive should filter by discountEligible
statusReason: The expression evaluated to a falsy value:

  assert.ok(p.isDiscountEligible())

[Killed] MethodExpression
src/services/catalogService.js:225:15
 
   // Discount eligible filter
   if (filters.discountEligible === true) {
-    results = results.filter(p => p.isDiscountEligible());
+    results = results;
   }
 
killedBy: CatalogService - Unit Tests filterProducts - comprehensive should filter by discountEligible
statusReason: The expression evaluated to a falsy value:

  assert.ok(p.isDiscountEligible())

[Survived] ArrowFunction
src/services/catalogService.js:225:30
 
   // Discount eligible filter
   if (filters.discountEligible === true) {
-    results = results.filter(p => p.isDiscountEligible());
+    results = results.filter(() => undefined);
   }
 

[Killed] BooleanLiteral
src/services/catalogService.js:239:7
  * @returns {Array<Product>} Sorted products
  */
 export function sortProducts(products, sortBy = 'title', order = 'asc') {
-  if (!Array.isArray(products) || products.length === 0) {
+  if (Array.isArray(products) || products.length === 0) {
     return products;
   }
killedBy: CatalogService - Unit Tests sortProducts should sort by title ascending
statusReason: Expected values to be strictly equal:

false !== true

[Killed] LogicalOperator
src/services/catalogService.js:239:7
  * @returns {Array<Product>} Sorted products
  */
 export function sortProducts(products, sortBy = 'title', order = 'asc') {
-  if (!Array.isArray(products) || products.length === 0) {
+  if (!Array.isArray(products) && products.length === 0) {
     return products;
   }
killedBy: CatalogService - Unit Tests sortProducts - comprehensive should handle null input
statusReason: Cannot read properties of null (reading 'length')

[Killed] LogicalOperator
src/services/catalogService.js:247:7
   const sorted = [...products];
 
   // Validate sort order
-  if (order !== 'asc' && order !== 'desc') {
+  if (order !== 'asc' || order !== 'desc') {
     order = 'asc';
   }
killedBy: CatalogService - Unit Tests sortProducts should sort by title descending
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/services/catalogService.js:247:26
   const sorted = [...products];
 
   // Validate sort order
-  if (order !== 'asc' && order !== 'desc') {
+  if (order !== 'asc' && true) {
     order = 'asc';
   }
killedBy: CatalogService - Unit Tests sortProducts should sort by title descending
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/services/catalogService.js:256:9
     let compareValueA, compareValueB;
 
     // Get comparison values based on sortBy field
-    if (sortBy === 'price') {
+    if (false) {
       compareValueA = a.price;
       compareValueB = b.price;
killedBy: CatalogService - Unit Tests sortProducts should sort by price ascending
statusReason: The expression evaluated to a falsy value:

  assert.ok(sorted[i].price <= sorted[i + 1].price)

[Killed] BlockStatement
src/services/catalogService.js:256:29
     let compareValueA, compareValueB;
 
     // Get comparison values based on sortBy field
-    if (sortBy === 'price') {
-      compareValueA = a.price;
-      compareValueB = b.price;
-    } else if (sortBy === 'stock') {
+    if (sortBy === 'price') {} else if (sortBy === 'stock') {
       compareValueA = a.stock;
       compareValueB = b.stock;
killedBy: CatalogService - Unit Tests sortProducts should sort by price ascending
statusReason: The expression evaluated to a falsy value:

  assert.ok(sorted[i].price <= sorted[i + 1].price)

[Killed] ConditionalExpression
src/services/catalogService.js:259:16
     if (sortBy === 'price') {
       compareValueA = a.price;
       compareValueB = b.price;
-    } else if (sortBy === 'stock') {
+    } else if (false) {
       compareValueA = a.stock;
       compareValueB = b.stock;
killedBy: CatalogService - Unit Tests sortProducts should sort by stock level
statusReason: The expression evaluated to a falsy value:

  assert.ok(sorted[i].stock <= sorted[i + 1].stock)

[Killed] BlockStatement
src/services/catalogService.js:259:36
     if (sortBy === 'price') {
       compareValueA = a.price;
       compareValueB = b.price;
-    } else if (sortBy === 'stock') {
-      compareValueA = a.stock;
-      compareValueB = b.stock;
-    } else if (sortBy === 'title') {
+    } else if (sortBy === 'stock') {} else if (sortBy === 'title') {
       compareValueA = a.title.toLowerCase();
       compareValueB = b.title.toLowerCase();
killedBy: CatalogService - Unit Tests sortProducts should sort by stock level
statusReason: The expression evaluated to a falsy value:

  assert.ok(sorted[i].stock <= sorted[i + 1].stock)

[Killed] EqualityOperator
src/services/catalogService.js:262:16
     } else if (sortBy === 'stock') {
       compareValueA = a.stock;
       compareValueB = b.stock;
-    } else if (sortBy === 'title') {
+    } else if (sortBy !== 'title') {
       compareValueA = a.title.toLowerCase();
       compareValueB = b.title.toLowerCase();
killedBy: CatalogService - Unit Tests sortProducts - comprehensive should sort by author ascending
statusReason: The expression evaluated to a falsy value:

  assert.ok(sorted[i].author.toLowerCase() >= sorted[i-1].author.toLowerCase())

[Killed] BlockStatement
src/services/catalogService.js:262:36
     } else if (sortBy === 'stock') {
       compareValueA = a.stock;
       compareValueB = b.stock;
-    } else if (sortBy === 'title') {
-      compareValueA = a.title.toLowerCase();
-      compareValueB = b.title.toLowerCase();
-    } else if (sortBy === 'author') {
+    } else if (sortBy === 'title') {} else if (sortBy === 'author') {
       compareValueA = a.author.toLowerCase();
       compareValueB = b.author.toLowerCase();
killedBy: CatalogService - Unit Tests sortProducts should sort by title ascending
statusReason: Expected values to be strictly equal:

false !== true

[Killed] MethodExpression
src/services/catalogService.js:263:23
       compareValueA = a.stock;
       compareValueB = b.stock;
     } else if (sortBy === 'title') {
-      compareValueA = a.title.toLowerCase();
+      compareValueA = a.title.toUpperCase();
       compareValueB = b.title.toLowerCase();
     } else if (sortBy === 'author') {
killedBy: CatalogService - Unit Tests sortProducts should sort by title ascending
statusReason: Expected values to be strictly equal:

false !== true

[Killed] MethodExpression
src/services/catalogService.js:264:23
       compareValueB = b.stock;
     } else if (sortBy === 'title') {
       compareValueA = a.title.toLowerCase();
-      compareValueB = b.title.toLowerCase();
+      compareValueB = b.title.toUpperCase();
     } else if (sortBy === 'author') {
       compareValueA = a.author.toLowerCase();
killedBy: CatalogService - Unit Tests sortProducts should sort by title ascending
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/services/catalogService.js:265:16
     } else if (sortBy === 'title') {
       compareValueA = a.title.toLowerCase();
       compareValueB = b.title.toLowerCase();
-    } else if (sortBy === 'author') {
+    } else if (sortBy !== 'author') {
       compareValueA = a.author.toLowerCase();
       compareValueB = b.author.toLowerCase();
killedBy: CatalogService - Unit Tests sortProducts - comprehensive should sort by author ascending
statusReason: The expression evaluated to a falsy value:

  assert.ok(sorted[i].author.toLowerCase() >= sorted[i-1].author.toLowerCase())

[Killed] ConditionalExpression
src/services/catalogService.js:265:16
     } else if (sortBy === 'title') {
       compareValueA = a.title.toLowerCase();
       compareValueB = b.title.toLowerCase();
-    } else if (sortBy === 'author') {
+    } else if (false) {
       compareValueA = a.author.toLowerCase();
       compareValueB = b.author.toLowerCase();
killedBy: CatalogService - Unit Tests sortProducts - comprehensive should sort by author ascending
statusReason: The expression evaluated to a falsy value:

  assert.ok(sorted[i].author.toLowerCase() >= sorted[i-1].author.toLowerCase())

[Killed] MethodExpression
src/services/catalogService.js:266:23
       compareValueA = a.title.toLowerCase();
       compareValueB = b.title.toLowerCase();
     } else if (sortBy === 'author') {
-      compareValueA = a.author.toLowerCase();
+      compareValueA = a.author.toUpperCase();
       compareValueB = b.author.toLowerCase();
     } else if (sortBy === 'category') {
killedBy: CatalogService - Unit Tests sortProducts - comprehensive should sort by author ascending
statusReason: The expression evaluated to a falsy value:

  assert.ok(sorted[i].author.toLowerCase() >= sorted[i-1].author.toLowerCase())

[Killed] MethodExpression
src/services/catalogService.js:267:23
       compareValueB = b.title.toLowerCase();
     } else if (sortBy === 'author') {
       compareValueA = a.author.toLowerCase();
-      compareValueB = b.author.toLowerCase();
+      compareValueB = b.author.toUpperCase();
     } else if (sortBy === 'category') {
       compareValueA = a.category.toLowerCase();
killedBy: CatalogService - Unit Tests sortProducts - comprehensive should sort by author ascending
statusReason: The expression evaluated to a falsy value:

  assert.ok(sorted[i].author.toLowerCase() >= sorted[i-1].author.toLowerCase())

[Survived] ConditionalExpression
src/services/catalogService.js:268:16
     } else if (sortBy === 'author') {
       compareValueA = a.author.toLowerCase();
       compareValueB = b.author.toLowerCase();
-    } else if (sortBy === 'category') {
+    } else if (false) {
       compareValueA = a.category.toLowerCase();
       compareValueB = b.category.toLowerCase();

[Survived] ConditionalExpression
src/services/catalogService.js:268:16
     } else if (sortBy === 'author') {
       compareValueA = a.author.toLowerCase();
       compareValueB = b.author.toLowerCase();
-    } else if (sortBy === 'category') {
+    } else if (true) {
       compareValueA = a.category.toLowerCase();
       compareValueB = b.category.toLowerCase();

[Survived] MethodExpression
src/services/catalogService.js:269:23
       compareValueA = a.author.toLowerCase();
       compareValueB = b.author.toLowerCase();
     } else if (sortBy === 'category') {
-      compareValueA = a.category.toLowerCase();
+      compareValueA = a.category.toUpperCase();
       compareValueB = b.category.toLowerCase();
     } else {

[Survived] MethodExpression
src/services/catalogService.js:270:23
       compareValueB = b.author.toLowerCase();
     } else if (sortBy === 'category') {
       compareValueA = a.category.toLowerCase();
-      compareValueB = b.category.toLowerCase();
+      compareValueB = b.category.toUpperCase();
     } else {
       // Default to title

[Survived] BlockStatement
src/services/catalogService.js:271:12
     } else if (sortBy === 'category') {
       compareValueA = a.category.toLowerCase();
       compareValueB = b.category.toLowerCase();
-    } else {
-      // Default to title
-      compareValueA = a.title.toLowerCase();
-      compareValueB = b.title.toLowerCase();
-    }
+    } else {}
 
     // Perform comparison based on type

[Survived] MethodExpression
src/services/catalogService.js:273:23
       compareValueB = b.category.toLowerCase();
     } else {
       // Default to title
-      compareValueA = a.title.toLowerCase();
+      compareValueA = a.title.toUpperCase();
       compareValueB = b.title.toLowerCase();
     }
