[Killed] BlockStatement
src/services/catalogService.js:280:81
     // Perform comparison based on type
     let comparison = 0;
     
-    if (typeof compareValueA === 'number' && typeof compareValueB === 'number') {
-      comparison = compareValueA - compareValueB;
-    } else {
+    if (typeof compareValueA === 'number' && typeof compareValueB === 'number') {} else {
       // String comparison
       if (compareValueA < compareValueB) {
killedBy: CatalogService - Unit Tests sortProducts should sort by price ascending
statusReason: The expression evaluated to a falsy value:

  assert.ok(sorted[i].price <= sorted[i + 1].price)

[Killed] ConditionalExpression
src/services/catalogService.js:280:9
     // Perform comparison based on type
     let comparison = 0;
     
-    if (typeof compareValueA === 'number' && typeof compareValueB === 'number') {
+    if (true) {
       comparison = compareValueA - compareValueB;
     } else {
killedBy: CatalogService - Unit Tests sortProducts should sort by title ascending
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ArithmeticOperator
src/services/catalogService.js:281:20
     let comparison = 0;
     
     if (typeof compareValueA === 'number' && typeof compareValueB === 'number') {
-      comparison = compareValueA - compareValueB;
+      comparison = compareValueA + compareValueB;
     } else {
       // String comparison
killedBy: CatalogService - Unit Tests sortProducts should sort by price ascending
statusReason: The expression evaluated to a falsy value:

  assert.ok(sorted[i].price <= sorted[i + 1].price)

[Killed] BlockStatement
src/services/catalogService.js:282:12
     
     if (typeof compareValueA === 'number' && typeof compareValueB === 'number') {
       comparison = compareValueA - compareValueB;
-    } else {
-      // String comparison
-      if (compareValueA < compareValueB) {
-        comparison = -1;
-      } else if (compareValueA > compareValueB) {
-        comparison = 1;
-      }
-    }
+    } else {}
 
     // Apply order direction
killedBy: CatalogService - Unit Tests sortProducts should sort by title ascending
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/services/catalogService.js:284:11
       comparison = compareValueA - compareValueB;
     } else {
       // String comparison
-      if (compareValueA < compareValueB) {
+      if (compareValueA >= compareValueB) {
         comparison = -1;
       } else if (compareValueA > compareValueB) {
killedBy: CatalogService - Unit Tests sortProducts should sort by title ascending
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/services/catalogService.js:284:42
       comparison = compareValueA - compareValueB;
     } else {
       // String comparison
-      if (compareValueA < compareValueB) {
-        comparison = -1;
-      } else if (compareValueA > compareValueB) {
+      if (compareValueA < compareValueB) {} else if (compareValueA > compareValueB) {
         comparison = 1;
       }
killedBy: CatalogService - Unit Tests sortProducts should sort by title ascending
statusReason: Expected values to be strictly equal:

false !== true

[Killed] UnaryOperator
src/services/catalogService.js:285:22
     } else {
       // String comparison
       if (compareValueA < compareValueB) {
-        comparison = -1;
+        comparison = +1;
       } else if (compareValueA > compareValueB) {
         comparison = 1;
killedBy: CatalogService - Unit Tests sortProducts should sort by title ascending
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/services/catalogService.js:286:18
       // String comparison
       if (compareValueA < compareValueB) {
         comparison = -1;
-      } else if (compareValueA > compareValueB) {
+      } else if (compareValueA <= compareValueB) {
         comparison = 1;
       }
killedBy: CatalogService - Unit Tests sortProducts should sort by title descending
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/services/catalogService.js:286:49
       // String comparison
       if (compareValueA < compareValueB) {
         comparison = -1;
-      } else if (compareValueA > compareValueB) {
-        comparison = 1;
-      }
+      } else if (compareValueA > compareValueB) {}
     }
 
killedBy: CatalogService - Unit Tests sortProducts should sort by title descending
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/services/catalogService.js:292:12
     }
 
     // Apply order direction
-    return order === 'asc' ? comparison : -comparison;
+    return true ? comparison : -comparison;
   });
 
killedBy: CatalogService - Unit Tests sortProducts should sort by title descending
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/services/catalogService.js:292:12
     }
 
     // Apply order direction
-    return order === 'asc' ? comparison : -comparison;
+    return false ? comparison : -comparison;
   });
 
killedBy: CatalogService - Unit Tests sortProducts should sort by title ascending
statusReason: Expected values to be strictly equal:

false !== true

[NoCoverage] BlockStatement
src/services/catalogService.js:305:66
  * @param {number} limit - Items per page
  * @returns {object} Paginated results
  */
-export function paginateProducts(products, page = 1, limit = 10) {
-  if (!Array.isArray(products)) {
-    return { products: [], page: 1, limit, total: 0, totalPages: 0 };
-  }
-
-  const total = products.length;
-  const totalPages = Math.ceil(total / limit);
-  const startIndex = (page - 1) * limit;
-  const endIndex = startIndex + limit;
-  const paginatedProducts = products.slice(startIndex, endIndex);
-
-  return {
-    products: paginatedProducts,
-    page,
-    limit,
-    total,
-    totalPages
-  };
-}
+export function paginateProducts(products, page = 1, limit = 10) {}
 
 /**

[NoCoverage] ConditionalExpression
src/services/catalogService.js:306:7
  * @returns {object} Paginated results
  */
 export function paginateProducts(products, page = 1, limit = 10) {
-  if (!Array.isArray(products)) {
+  if (true) {
     return { products: [], page: 1, limit, total: 0, totalPages: 0 };
   }

[NoCoverage] BooleanLiteral
src/services/catalogService.js:306:7
  * @returns {object} Paginated results
  */
 export function paginateProducts(products, page = 1, limit = 10) {
-  if (!Array.isArray(products)) {
+  if (Array.isArray(products)) {
     return { products: [], page: 1, limit, total: 0, totalPages: 0 };
   }

[NoCoverage] ArithmeticOperator
src/services/catalogService.js:311:32
   }
 
   const total = products.length;
-  const totalPages = Math.ceil(total / limit);
+  const totalPages = Math.ceil(total * limit);
   const startIndex = (page - 1) * limit;
   const endIndex = startIndex + limit;

[NoCoverage] ArithmeticOperator
src/services/catalogService.js:312:23
 
   const total = products.length;
   const totalPages = Math.ceil(total / limit);
-  const startIndex = (page - 1) * limit;
+  const startIndex = (page + 1) * limit;
   const endIndex = startIndex + limit;
   const paginatedProducts = products.slice(startIndex, endIndex);

[NoCoverage] ArithmeticOperator
src/services/catalogService.js:312:22
 
   const total = products.length;
   const totalPages = Math.ceil(total / limit);
-  const startIndex = (page - 1) * limit;
+  const startIndex = (page - 1) / limit;
   const endIndex = startIndex + limit;
   const paginatedProducts = products.slice(startIndex, endIndex);

[NoCoverage] MethodExpression
src/services/catalogService.js:314:29
   const totalPages = Math.ceil(total / limit);
   const startIndex = (page - 1) * limit;
   const endIndex = startIndex + limit;
-  const paginatedProducts = products.slice(startIndex, endIndex);
+  const paginatedProducts = products;
 
   return {

[NoCoverage] ObjectLiteral
src/services/catalogService.js:316:10
   const endIndex = startIndex + limit;
   const paginatedProducts = products.slice(startIndex, endIndex);
 
-  return {
-    products: paginatedProducts,
-    page,
-    limit,
-    total,
-    totalPages
-  };
+  return {};
 }
 

[NoCoverage] BlockStatement
src/services/catalogService.js:332:82
  * @param {string} order - Sort order
  * @returns {Array<Product>} Products in category
  */
-export function getProductsByCategory(category, sortBy = 'title', order = 'asc') {
-  if (!validateCategory(category)) {
-    return [];
-  }
-
-  const filtered = filterProducts({ category });
-  return sortProducts(filtered, sortBy, order);
-}
+export function getProductsByCategory(category, sortBy = 'title', order = 'asc') {}
 
 /**

[NoCoverage] ConditionalExpression
src/services/catalogService.js:333:7
  * @returns {Array<Product>} Products in category
  */
 export function getProductsByCategory(category, sortBy = 'title', order = 'asc') {
-  if (!validateCategory(category)) {
+  if (false) {
     return [];
   }

[NoCoverage] BlockStatement
src/services/catalogService.js:333:36
  * @returns {Array<Product>} Products in category
  */
 export function getProductsByCategory(category, sortBy = 'title', order = 'asc') {
-  if (!validateCategory(category)) {
-    return [];
-  }
+  if (!validateCategory(category)) {}
 
   const filtered = filterProducts({ category });

[NoCoverage] BlockStatement
src/services/catalogService.js:346:49
  * @param {number} limit - Maximum number to return
  * @returns {Array<Product>} Featured products
  */
-export function getFeaturedProducts(limit = 10) {
-  // Complex selection logic
-  const featured = [];
-
-  // Criteria: high stock, discount eligible, popular categories
-  const popularCategories = ['fiction', 'non-fiction', 'science'];
-
-  for (const product of productCatalog) {
-    // Multiple conditions for featuring
-    if (product.stock >= 10 && product.isDiscountEligible()) {
-      featured.push(product);
-    } else if (popularCategories.includes(product.category.toLowerCase()) && product.stock > 0) {
-      featured.push(product);
-    }
-
-    if (featured.length >= limit) {
-      break;
-    }
-  }
-
-  return featured;
-}
+export function getFeaturedProducts(limit = 10) {}
 
 /**

[NoCoverage] BlockStatement
src/services/catalogService.js:353:41
   // Criteria: high stock, discount eligible, popular categories
   const popularCategories = ['fiction', 'non-fiction', 'science'];
 
-  for (const product of productCatalog) {
-    // Multiple conditions for featuring
-    if (product.stock >= 10 && product.isDiscountEligible()) {
-      featured.push(product);
-    } else if (popularCategories.includes(product.category.toLowerCase()) && product.stock > 0) {
-      featured.push(product);
-    }
-
-    if (featured.length >= limit) {
-      break;
-    }
-  }
+  for (const product of productCatalog) {}
 
   return featured;

[NoCoverage] BlockStatement
src/services/catalogService.js:355:62
 
   for (const product of productCatalog) {
     // Multiple conditions for featuring
-    if (product.stock >= 10 && product.isDiscountEligible()) {
-      featured.push(product);
-    } else if (popularCategories.includes(product.category.toLowerCase()) && product.stock > 0) {
+    if (product.stock >= 10 && product.isDiscountEligible()) {} else if (popularCategories.includes(product.category.toLowerCase()) && product.stock > 0) {
       featured.push(product);
     }

[NoCoverage] EqualityOperator
src/services/catalogService.js:355:9
 
   for (const product of productCatalog) {
     // Multiple conditions for featuring
-    if (product.stock >= 10 && product.isDiscountEligible()) {
+    if (product.stock > 10 && product.isDiscountEligible()) {
       featured.push(product);
     } else if (popularCategories.includes(product.category.toLowerCase()) && product.stock > 0) {

[NoCoverage] ConditionalExpression
src/services/catalogService.js:357:16
     // Multiple conditions for featuring
     if (product.stock >= 10 && product.isDiscountEligible()) {
       featured.push(product);
-    } else if (popularCategories.includes(product.category.toLowerCase()) && product.stock > 0) {
+    } else if (true) {
       featured.push(product);
     }

[NoCoverage] EqualityOperator
src/services/catalogService.js:357:78
     // Multiple conditions for featuring
     if (product.stock >= 10 && product.isDiscountEligible()) {
       featured.push(product);
-    } else if (popularCategories.includes(product.category.toLowerCase()) && product.stock > 0) {
+    } else if (popularCategories.includes(product.category.toLowerCase()) && product.stock >= 0) {
       featured.push(product);
     }

[NoCoverage] EqualityOperator
src/services/catalogService.js:361:9
       featured.push(product);
     }
 
-    if (featured.length >= limit) {
+    if (featured.length > limit) {
       break;
     }

[NoCoverage] EqualityOperator
src/services/catalogService.js:361:9
       featured.push(product);
     }
 
-    if (featured.length >= limit) {
+    if (featured.length < limit) {
       break;
     }

[NoCoverage] ArrowFunction
src/services/catalogService.js:385:46
   const recommendations = [];
 
   // Find products in same category
-  const sameCategory = productCatalog.filter(p => 
-    p.id !== productId && 
-    p.category === product.category &&
-    p.isInStock()
+  const sameCategory = productCatalog.filter(() => undefined
   );
 

[NoCoverage] MethodExpression
src/services/catalogService.js:385:24
   const recommendations = [];
 
   // Find products in same category
-  const sameCategory = productCatalog.filter(p => 
-    p.id !== productId && 
-    p.category === product.category &&
-    p.isInStock()
-  );
+  const sameCategory = productCatalog;
 
   // Add products with similar price range (±20%)

[NoCoverage] ConditionalExpression
src/services/catalogService.js:386:5
 
   // Find products in same category
   const sameCategory = productCatalog.filter(p => 
-    p.id !== productId && 
-    p.category === product.category &&
-    p.isInStock()
+    true
   );
 

[NoCoverage] ConditionalExpression
src/services/catalogService.js:386:5
 
   // Find products in same category
   const sameCategory = productCatalog.filter(p => 
-    p.id !== productId && 
-    p.category === product.category &&
+    true &&
     p.isInStock()
   );

[NoCoverage] ConditionalExpression
src/services/catalogService.js:387:5
   // Find products in same category
   const sameCategory = productCatalog.filter(p => 
     p.id !== productId && 
-    p.category === product.category &&
+    true &&
     p.isInStock()
   );

[NoCoverage] EqualityOperator
src/services/catalogService.js:387:5
   // Find products in same category
   const sameCategory = productCatalog.filter(p => 
     p.id !== productId && 
-    p.category === product.category &&
+    p.category !== product.category &&
     p.isInStock()
   );

[NoCoverage] ArithmeticOperator
src/services/catalogService.js:392:20
   );
 
   // Add products with similar price range (±20%)
-  const priceMin = product.price * 0.8;
+  const priceMin = product.price / 0.8;
   const priceMax = product.price * 1.2;
 

[NoCoverage] ArithmeticOperator
src/services/catalogService.js:393:20
 
   // Add products with similar price range (±20%)
   const priceMin = product.price * 0.8;
-  const priceMax = product.price * 1.2;
+  const priceMax = product.price / 1.2;
 
   const similarPrice = productCatalog.filter(p =>

[NoCoverage] ArrowFunction
src/services/catalogService.js:395:46
   const priceMin = product.price * 0.8;
   const priceMax = product.price * 1.2;
 
-  const similarPrice = productCatalog.filter(p =>
-    p.id !== productId &&
-    p.price >= priceMin &&
-    p.price <= priceMax &&
-    p.isInStock()
+  const similarPrice = productCatalog.filter(() => undefined
   );
 

[NoCoverage] MethodExpression
src/services/catalogService.js:395:24
   const priceMin = product.price * 0.8;
   const priceMax = product.price * 1.2;
 
-  const similarPrice = productCatalog.filter(p =>
-    p.id !== productId &&
-    p.price >= priceMin &&
-    p.price <= priceMax &&
-    p.isInStock()
-  );
+  const similarPrice = productCatalog;
 
   // Combine and deduplicate

[NoCoverage] LogicalOperator
src/services/catalogService.js:396:5
   const priceMax = product.price * 1.2;
 
   const similarPrice = productCatalog.filter(p =>
-    p.id !== productId &&
-    p.price >= priceMin &&
+    p.id !== productId || p.price >= priceMin &&
     p.price <= priceMax &&
     p.isInStock()

[NoCoverage] LogicalOperator
src/services/catalogService.js:396:5
   const priceMax = product.price * 1.2;
 
   const similarPrice = productCatalog.filter(p =>
-    p.id !== productId &&
-    p.price >= priceMin &&
-    p.price <= priceMax &&
+    p.id !== productId && p.price >= priceMin || p.price <= priceMax &&
     p.isInStock()
   );

[NoCoverage] ConditionalExpression
src/services/catalogService.js:397:5
 
   const similarPrice = productCatalog.filter(p =>
     p.id !== productId &&
-    p.price >= priceMin &&
+    true &&
     p.price <= priceMax &&
     p.isInStock()

[NoCoverage] EqualityOperator
src/services/catalogService.js:397:5
 
   const similarPrice = productCatalog.filter(p =>
     p.id !== productId &&
-    p.price >= priceMin &&
+    p.price > priceMin &&
     p.price <= priceMax &&
     p.isInStock()

[NoCoverage] ConditionalExpression
src/services/catalogService.js:398:5
   const similarPrice = productCatalog.filter(p =>
     p.id !== productId &&
     p.price >= priceMin &&
-    p.price <= priceMax &&
+    true &&
     p.isInStock()
   );

[NoCoverage] EqualityOperator
src/services/catalogService.js:398:5
   const similarPrice = productCatalog.filter(p =>
     p.id !== productId &&
     p.price >= priceMin &&
-    p.price <= priceMax &&
+    p.price > priceMax &&
     p.isInStock()
   );

[NoCoverage] ArrowFunction
src/services/catalogService.js:404:50
 
   // Combine and deduplicate
   const combined = [...sameCategory, ...similarPrice];
-  const unique = Array.from(new Map(combined.map(p => [p.id, p])).values());
+  const unique = Array.from(new Map(combined.map(() => undefined)).values());
 
   // Take up to limit

[NoCoverage] MethodExpression
src/services/catalogService.js:407:10
   const unique = Array.from(new Map(combined.map(p => [p.id, p])).values());
 
   // Take up to limit
-  return unique.slice(0, limit);
+  return unique;
 }
 

[NoCoverage] LogicalOperator
src/services/catalogService.js:417:7
  */
 export function addProduct(productData) {
   // Validation
-  if (!productData || typeof productData !== 'object') {
+  if (!productData && typeof productData !== 'object') {
     return null;
   }

[NoCoverage] ConditionalExpression
src/services/catalogService.js:417:7
  */
 export function addProduct(productData) {
   // Validation
-  if (!productData || typeof productData !== 'object') {
+  if (true) {
     return null;
   }

[NoCoverage] BlockStatement
src/services/catalogService.js:423:33
 
   // Validate required fields
   const required = ['id', 'title', 'author', 'price', 'category', 'isbn', 'stock'];
-  for (const field of required) {
-    if (productData[field] === undefined || productData[field] === null) {
-      return { success: false, error: `Missing required field: ${field}` };
-    }
-  }
+  for (const field of required) {}
 
   // Validate price

[NoCoverage] EqualityOperator
src/services/catalogService.js:424:45
   // Validate required fields
   const required = ['id', 'title', 'author', 'price', 'category', 'isbn', 'stock'];
   for (const field of required) {
-    if (productData[field] === undefined || productData[field] === null) {
+    if (productData[field] === undefined || productData[field] !== null) {
       return { success: false, error: `Missing required field: ${field}` };
     }

[NoCoverage] EqualityOperator
src/services/catalogService.js:424:9
   // Validate required fields
   const required = ['id', 'title', 'author', 'price', 'category', 'isbn', 'stock'];
   for (const field of required) {
-    if (productData[field] === undefined || productData[field] === null) {
+    if (productData[field] !== undefined || productData[field] === null) {
       return { success: false, error: `Missing required field: ${field}` };
     }

[NoCoverage] BooleanLiteral
src/services/catalogService.js:425:25
   const required = ['id', 'title', 'author', 'price', 'category', 'isbn', 'stock'];
   for (const field of required) {
     if (productData[field] === undefined || productData[field] === null) {
-      return { success: false, error: `Missing required field: ${field}` };
+      return { success: true, error: `Missing required field: ${field}` };
     }
   }

[NoCoverage] BooleanLiteral
src/services/catalogService.js:431:7
 
   // Validate price
   const priceValidation = validatePrice(productData.price);
-  if (!priceValidation.valid) {
+  if (priceValidation.valid) {
     return { success: false, error: priceValidation.error };
   }

[NoCoverage] ConditionalExpression
src/services/catalogService.js:431:7
 
   // Validate price
   const priceValidation = validatePrice(productData.price);
-  if (!priceValidation.valid) {
+  if (false) {
     return { success: false, error: priceValidation.error };
   }

[NoCoverage] BooleanLiteral
src/services/catalogService.js:432:23
   // Validate price
   const priceValidation = validatePrice(productData.price);
   if (!priceValidation.valid) {
-    return { success: false, error: priceValidation.error };
+    return { success: true, error: priceValidation.error };
   }
 

[NoCoverage] BlockStatement
src/services/catalogService.js:436:39
   }
 
   // Check if ID already exists
-  if (getProductById(productData.id)) {
-    return { success: false, error: 'Product ID already exists' };
-  }
+  if (getProductById(productData.id)) {}
 
   const product = new Product(

[NoCoverage] ConditionalExpression
src/services/catalogService.js:436:7
   }
 
   // Check if ID already exists
-  if (getProductById(productData.id)) {
+  if (true) {
     return { success: false, error: 'Product ID already exists' };
   }

[NoCoverage] BooleanLiteral
src/services/catalogService.js:437:23
 
   // Check if ID already exists
   if (getProductById(productData.id)) {
-    return { success: false, error: 'Product ID already exists' };
+    return { success: true, error: 'Product ID already exists' };
   }
 

[NoCoverage] ObjectLiteral
src/services/catalogService.js:437:12
 
   // Check if ID already exists
   if (getProductById(productData.id)) {
-    return { success: false, error: 'Product ID already exists' };
+    return {};
   }
 

[NoCoverage] BooleanLiteral
src/services/catalogService.js:452:21
   );
 
   productCatalog.push(product);
-  return { success: true, product };
+  return { success: false, product };
 }
 

[NoCoverage] ObjectLiteral
src/services/catalogService.js:452:10
   );
 
   productCatalog.push(product);
-  return { success: true, product };
+  return {};
 }
 

[Killed] BlockStatement
src/services/catalogService.js:464:17
 export function updateProduct(productId, updates) {
   const product = getProductById(productId);
   
-  if (!product) {
-    return { success: false };
-  }
+  if (!product) {}
 
   // Apply allowed updates with validation
killedBy: CatalogService - Unit Tests updateProduct should return failure for non-existent product
statusReason: Cannot set properties of null (setting 'price')

[Killed] BooleanLiteral
src/services/catalogService.js:465:23
   const product = getProductById(productId);
   
   if (!product) {
-    return { success: false };
+    return { success: true };
   }
 
killedBy: CatalogService - Unit Tests updateProduct should return failure for non-existent product
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ObjectLiteral
src/services/catalogService.js:465:12
   const product = getProductById(productId);
   
   if (!product) {
-    return { success: false };
+    return {};
   }
 
killedBy: CatalogService - Unit Tests updateProduct should return failure for non-existent product
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] ConditionalExpression
src/services/catalogService.js:469:7
   }
 
   // Apply allowed updates with validation
-  if (updates.price !== undefined) {
+  if (false) {
     const validation = validatePrice(updates.price);
     if (validation.valid) {
killedBy: CatalogService - Unit Tests updateProduct should ignore title when not a string
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'New Title'
- 'Test Book One'

[Killed] ConditionalExpression
src/services/catalogService.js:469:7
   }
 
   // Apply allowed updates with validation
-  if (updates.price !== undefined) {
+  if (true) {
     const validation = validatePrice(updates.price);
     if (validation.valid) {
killedBy: CatalogService - Unit Tests updateProduct should ignore title when not a string
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'New Title'
- 'Test Book One'

[Survived] BlockStatement
src/services/catalogService.js:471:27
   // Apply allowed updates with validation
   if (updates.price !== undefined) {
     const validation = validatePrice(updates.price);
-    if (validation.valid) {
-      product.price = updates.price;
-    }
+    if (validation.valid) {}
   }
 

[Survived] ConditionalExpression
src/services/catalogService.js:471:9
   // Apply allowed updates with validation
   if (updates.price !== undefined) {
     const validation = validatePrice(updates.price);
-    if (validation.valid) {
+    if (false) {
       product.price = updates.price;
     }

[Killed] ConditionalExpression
src/services/catalogService.js:476:7
     }
   }
 
-  if (updates.stock !== undefined && typeof updates.stock === 'number') {
+  if (true) {
     if (updates.stock >= 0) {
       product.stock = updates.stock;
killedBy: InventoryService - Unit Tests adjustStockLevel should calculate positive difference
statusReason: Expected values to be strictly equal:

-5 !== 10

[Killed] ConditionalExpression
src/services/catalogService.js:476:7
     }
   }
 
-  if (updates.stock !== undefined && typeof updates.stock === 'number') {
+  if (false) {
     if (updates.stock >= 0) {
       product.stock = updates.stock;
killedBy: CatalogService - Unit Tests updateProduct should ignore description when not a string
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'New description'
- 'A test book'

[Killed] ConditionalExpression
src/services/catalogService.js:477:9
   }
 
   if (updates.stock !== undefined && typeof updates.stock === 'number') {
-    if (updates.stock >= 0) {
+    if (true) {
       product.stock = updates.stock;
     }
killedBy: CatalogService - Unit Tests updateProduct should reject negative stock values
statusReason: Expected "actual" to be strictly unequal to: -5

[Killed] EqualityOperator
src/services/catalogService.js:477:9
   }
 
   if (updates.stock !== undefined && typeof updates.stock === 'number') {
-    if (updates.stock >= 0) {
+    if (updates.stock < 0) {
       product.stock = updates.stock;
     }
killedBy: CatalogService - Unit Tests updateProduct should reject negative stock values
statusReason: Expected "actual" to be strictly unequal to: -5

[Killed] ConditionalExpression
src/services/catalogService.js:482:24
     }
   }
 
-  if (updates.title && typeof updates.title === 'string') {
+  if (updates.title && true) {
     product.title = updates.title;
   }
killedBy: CatalogService - Unit Tests updateProduct should ignore title when not a string
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 123
- 'Test Book One'

[Killed] EqualityOperator
src/services/catalogService.js:482:24
     }
   }
 
-  if (updates.title && typeof updates.title === 'string') {
+  if (updates.title && typeof updates.title !== 'string') {
     product.title = updates.title;
   }
killedBy: CatalogService - Unit Tests updateProduct should update title when string provided
statusReason: Expected values to be strictly equal:

123 !== 'New Title'

[Killed] ConditionalExpression
src/services/catalogService.js:486:7
     product.title = updates.title;
   }
 
-  if (updates.description && typeof updates.description === 'string') {
+  if (true) {
     product.description = updates.description;
   }
killedBy: CatalogService - Unit Tests updateProduct should ignore description when not a string
statusReason: Expected values to be strictly equal:
+ actual - expected

+ null
- 'A test book'

[Survived] ConditionalExpression
src/services/catalogService.js:486:30
     product.title = updates.title;
   }
 
-  if (updates.description && typeof updates.description === 'string') {
+  if (updates.description && true) {
     product.description = updates.description;
   }

[Killed] BooleanLiteral
src/services/catalogService.js:490:21
     product.description = updates.description;
   }
 
-  return { success: true };
+  return { success: false };
 }
 
killedBy: CatalogService - Unit Tests updateProduct should update price with valid value
statusReason: Expected values to be strictly equal:

false !== true

[NoCoverage] BlockStatement
src/services/catalogService.js:498:42
  * @param {string} productId - Product to delete
  * @returns {boolean} true if deleted
  */
-export function deleteProduct(productId) {
-  const index = productCatalog.findIndex(p => p.id === productId);
-  
-  if (index === -1) {
-    return { success: false };
-  }
-
-  productCatalog.splice(index, 1);
-  return { success: true };
-}
+export function deleteProduct(productId) {}
 
