[NoCoverage] ConditionalExpression
src/services/catalogService.js:499:47
  * @returns {boolean} true if deleted
  */
 export function deleteProduct(productId) {
-  const index = productCatalog.findIndex(p => p.id === productId);
+  const index = productCatalog.findIndex(p => false);
   
   if (index === -1) {

[NoCoverage] ConditionalExpression
src/services/catalogService.js:499:47
  * @returns {boolean} true if deleted
  */
 export function deleteProduct(productId) {
-  const index = productCatalog.findIndex(p => p.id === productId);
+  const index = productCatalog.findIndex(p => true);
   
   if (index === -1) {

[NoCoverage] EqualityOperator
src/services/catalogService.js:501:7
 export function deleteProduct(productId) {
   const index = productCatalog.findIndex(p => p.id === productId);
   
-  if (index === -1) {
+  if (index !== -1) {
     return { success: false };
   }

[NoCoverage] BooleanLiteral
src/services/catalogService.js:502:23
   const index = productCatalog.findIndex(p => p.id === productId);
   
   if (index === -1) {
-    return { success: false };
+    return { success: true };
   }
 

[NoCoverage] BooleanLiteral
src/services/catalogService.js:506:21
   }
 
   productCatalog.splice(index, 1);
-  return { success: true };
+  return { success: false };
 }
 

[NoCoverage] ObjectLiteral
src/services/catalogService.js:506:10
   }
 
   productCatalog.splice(index, 1);
-  return { success: true };
+  return {};
 }
 
