[Killed] BlockStatement
src/services/inventoryService.js:18:49
  * @param {number} quantity - Required quantity
  * @returns {object} Stock check result
  */
-export function checkStock(productId, quantity) {
-  const product = getProductById(productId);
-
-  if (!product) {
-    return {
-      available: false,
-      message: 'Product not found',
-      currentStock: 0
-    };
-  }
-
-  const hasStock = product.hasSufficientStock(quantity);
-
-  return {
-    available: hasStock,
-    message: hasStock ? 'Stock available' : 'Insufficient stock',
-    currentStock: product.stock,
-    requested: quantity
-  };
-}
+export function checkStock(productId, quantity) {}
 
 /**
killedBy: InventoryService - Unit Tests checkStock should return available true when stock is sufficient
statusReason: Cannot read properties of undefined (reading 'available')

[Killed] BlockStatement
src/services/inventoryService.js:21:17
 export function checkStock(productId, quantity) {
   const product = getProductById(productId);
 
-  if (!product) {
-    return {
-      available: false,
-      message: 'Product not found',
-      currentStock: 0
-    };
-  }
+  if (!product) {}
 
   const hasStock = product.hasSufficientStock(quantity);
killedBy: InventoryService - Unit Tests checkStock should return available false when product not found
statusReason: Cannot read properties of null (reading 'hasSufficientStock')

[Killed] ObjectLiteral
src/services/inventoryService.js:22:12
   const product = getProductById(productId);
 
   if (!product) {
-    return {
-      available: false,
-      message: 'Product not found',
-      currentStock: 0
-    };
+    return {};
   }
 
killedBy: InventoryService - Unit Tests checkStock should return available false when product not found
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] BooleanLiteral
src/services/inventoryService.js:23:18
 
   if (!product) {
     return {
-      available: false,
+      available: true,
       message: 'Product not found',
       currentStock: 0
killedBy: InventoryService - Unit Tests checkStock should return available false when product not found
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/services/inventoryService.js:47:7
  */
 export function reserveStock(productId, quantity) {
   // Validation with nested conditions
-  if (!productId) {
+  if (true) {
     return { success: false, message: 'Product ID required' };
   }
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/services/inventoryService.js:47:7
  */
 export function reserveStock(productId, quantity) {
   // Validation with nested conditions
-  if (!productId) {
+  if (productId) {
     return { success: false, message: 'Product ID required' };
   }
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/services/inventoryService.js:48:23
 export function reserveStock(productId, quantity) {
   // Validation with nested conditions
   if (!productId) {
-    return { success: false, message: 'Product ID required' };
+    return { success: true, message: 'Product ID required' };
   }
 
killedBy: InventoryService - Unit Tests reserveStock should fail when product ID is missing
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/services/inventoryService.js:52:7
   }
 
   const quantityValidation = validateQuantity(quantity);
-  if (!quantityValidation.valid) {
+  if (false) {
     return { success: false, message: quantityValidation.error };
   }
killedBy: InventoryService - Unit Tests reserveStock should fail when quantity is invalid
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.message.includes('Quantity'))

[Killed] BlockStatement
src/services/inventoryService.js:52:34
   }
 
   const quantityValidation = validateQuantity(quantity);
-  if (!quantityValidation.valid) {
-    return { success: false, message: quantityValidation.error };
-  }
+  if (!quantityValidation.valid) {}
 
   const product = getProductById(productId);
killedBy: InventoryService - Unit Tests reserveStock should fail when quantity is invalid
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.message.includes('Quantity'))

[Killed] BooleanLiteral
src/services/inventoryService.js:53:23
 
   const quantityValidation = validateQuantity(quantity);
   if (!quantityValidation.valid) {
-    return { success: false, message: quantityValidation.error };
+    return { success: true, message: quantityValidation.error };
   }
 
killedBy: InventoryService - Unit Tests reserveStock should fail when quantity is invalid
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/services/inventoryService.js:59:23
   const product = getProductById(productId);
 
   if (!product) {
-    return { success: false, message: 'Product not found' };
+    return { success: true, message: 'Product not found' };
   }
 
killedBy: InventoryService - Unit Tests reserveStock should fail when product not found
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/services/inventoryService.js:63:7
   }
 
   // Check stock availability
-  if (!product.hasSufficientStock(quantity)) {
+  if (false) {
     return {
       success: false,
killedBy: InventoryService - Unit Tests reserveStock should fail when insufficient stock
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.message.includes('Insufficient stock'))

[Killed] BlockStatement
src/services/inventoryService.js:63:46
   }
 
   // Check stock availability
-  if (!product.hasSufficientStock(quantity)) {
-    return {
-      success: false,
-      message: `Insufficient stock. Available: ${product.stock}`,
-      available: product.stock
-    };
-  }
+  if (!product.hasSufficientStock(quantity)) {}
 
   // Reduce stock
killedBy: InventoryService - Unit Tests reserveStock should fail when insufficient stock
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.message.includes('Insufficient stock'))

[Killed] ConditionalExpression
src/services/inventoryService.js:74:7
   // Reduce stock
   const reduced = product.reduceStock(quantity);
 
-  if (reduced) {
+  if (false) {
     // Log transaction
     logInventoryTransaction(productId, -quantity, 'reserve', {
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/services/inventoryService.js:74:16
   // Reduce stock
   const reduced = product.reduceStock(quantity);
 
-  if (reduced) {
-    // Log transaction
-    logInventoryTransaction(productId, -quantity, 'reserve', {
-      previousStock: product.stock + quantity,
-      newStock: product.stock
-    });
-
-    return {
-      success: true,
-      message: 'Stock reserved',
-      newStock: product.stock
-    };
-  } else {
+  if (reduced) {} else {
     return {
       success: false,
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] UnaryOperator
src/services/inventoryService.js:76:40
 
   if (reduced) {
     // Log transaction
-    logInventoryTransaction(productId, -quantity, 'reserve', {
+    logInventoryTransaction(productId, +quantity, 'reserve', {
       previousStock: product.stock + quantity,
       newStock: product.stock
killedBy: InventoryService - Unit Tests reserveStock should log transaction on successful reserve
statusReason: Expected values to be strictly equal:

5 !== -5

[Killed] ArithmeticOperator
src/services/inventoryService.js:77:22
   if (reduced) {
     // Log transaction
     logInventoryTransaction(productId, -quantity, 'reserve', {
-      previousStock: product.stock + quantity,
+      previousStock: product.stock - quantity,
       newStock: product.stock
     });
killedBy: InventoryService - Unit Tests reserveStock should handle boundary case of reserving exact available stock
statusReason: Expected values to be strictly equal:

false !== true

[NoCoverage] BlockStatement
src/services/inventoryService.js:86:10
       message: 'Stock reserved',
       newStock: product.stock
     };
-  } else {
-    return {
-      success: false,
-      message: 'Failed to reserve stock'
-    };
-  }
+  } else {}
 }
 

[Killed] BlockStatement
src/services/inventoryService.js:101:19
  * @returns {object} Release result
  */
 export function releaseStock(productId, quantity) {
-  if (!productId) {
-    return { success: false, message: 'Product ID required' };
-  }
+  if (!productId) {}
 
   const quantityValidation = validateQuantity(quantity);
killedBy: InventoryService - Unit Tests releaseStock should fail when product ID is missing
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'Product not found'
- 'Product ID required'
           ^

[Killed] ConditionalExpression
src/services/inventoryService.js:101:7
  * @returns {object} Release result
  */
 export function releaseStock(productId, quantity) {
-  if (!productId) {
+  if (false) {
     return { success: false, message: 'Product ID required' };
   }
killedBy: InventoryService - Unit Tests releaseStock should successfully release stock
statusReason: Expected values to be strictly equal:

14 !== 15

[Killed] ConditionalExpression
src/services/inventoryService.js:106:7
   }
 
   const quantityValidation = validateQuantity(quantity);
-  if (!quantityValidation.valid) {
+  if (true) {
     return { success: false, message: quantityValidation.error };
   }
killedBy: InventoryService - Unit Tests releaseStock should successfully release stock
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/services/inventoryService.js:106:7
   }
 
   const quantityValidation = validateQuantity(quantity);
-  if (!quantityValidation.valid) {
+  if (quantityValidation.valid) {
     return { success: false, message: quantityValidation.error };
   }
killedBy: InventoryService - Unit Tests releaseStock should successfully release stock
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ObjectLiteral
src/services/inventoryService.js:107:12
 
   const quantityValidation = validateQuantity(quantity);
   if (!quantityValidation.valid) {
-    return { success: false, message: quantityValidation.error };
+    return {};
   }
 
killedBy: InventoryService - Unit Tests releaseStock should fail when quantity is invalid
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] ConditionalExpression
src/services/inventoryService.js:119:7
   // Add stock back
   const increased = product.increaseStock(quantity);
 
-  if (increased) {
+  if (false) {
     logInventoryTransaction(productId, quantity, 'release', {
       previousStock: product.stock - quantity,
killedBy: InventoryService - Unit Tests releaseStock should successfully release stock
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/services/inventoryService.js:119:18
   // Add stock back
   const increased = product.increaseStock(quantity);
 
-  if (increased) {
-    logInventoryTransaction(productId, quantity, 'release', {
-      previousStock: product.stock - quantity,
-      newStock: product.stock
-    });
-
-    return {
-      success: true,
-      message: 'Stock released',
-      newStock: product.stock
-    };
-  } else {
+  if (increased) {} else {
     return {
       success: false,
killedBy: InventoryService - Unit Tests releaseStock should successfully release stock
statusReason: Cannot read properties of undefined (reading 'success')

[Survived] ArithmeticOperator
src/services/inventoryService.js:121:22
 
   if (increased) {
     logInventoryTransaction(productId, quantity, 'release', {
-      previousStock: product.stock - quantity,
+      previousStock: product.stock + quantity,
       newStock: product.stock
     });

[Killed] ObjectLiteral
src/services/inventoryService.js:125:12
       newStock: product.stock
     });
 
-    return {
-      success: true,
-      message: 'Stock released',
-      newStock: product.stock
-    };
+    return {};
   } else {
     return {
killedBy: InventoryService - Unit Tests releaseStock should successfully release stock
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[NoCoverage] BlockStatement
src/services/inventoryService.js:130:10
       message: 'Stock released',
       newStock: product.stock
     };
-  } else {
-    return {
-      success: false,
-      message: 'Failed to release stock'
-    };
-  }
+  } else {}
 }
 

[Killed] ConditionalExpression
src/services/inventoryService.js:147:7
  */
 export function restockProduct(productId, quantity, options = {}) {
   // Nested validation
-  if (!productId) {
+  if (true) {
     return { success: false, message: 'Product ID required' };
   }
killedBy: InventoryService - Unit Tests restockProduct should successfully restock product
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/services/inventoryService.js:147:7
  */
 export function restockProduct(productId, quantity, options = {}) {
   // Nested validation
-  if (!productId) {
+  if (productId) {
     return { success: false, message: 'Product ID required' };
   }
killedBy: InventoryService - Unit Tests restockProduct should successfully restock product
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ObjectLiteral
src/services/inventoryService.js:148:12
 export function restockProduct(productId, quantity, options = {}) {
   // Nested validation
   if (!productId) {
-    return { success: false, message: 'Product ID required' };
+    return {};
   }
 
killedBy: InventoryService - Unit Tests restockProduct should fail when product ID is missing
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] BlockStatement
src/services/inventoryService.js:158:17
 
   const product = getProductById(productId);
 
-  if (!product) {
-    return { success: false, message: 'Product not found' };
-  }
+  if (!product) {}
 
   const { maxStock = 1000, autoAdjust = false } = options;
killedBy: InventoryService - Unit Tests restockProduct should fail when product not found
statusReason: Cannot read properties of null (reading 'stock')

[Killed] BooleanLiteral
src/services/inventoryService.js:162:41
     return { success: false, message: 'Product not found' };
   }
 
-  const { maxStock = 1000, autoAdjust = false } = options;
+  const { maxStock = 1000, autoAdjust = true } = options;
 
   let finalQuantity = quantity;
killedBy: InventoryService - Unit Tests restockProduct should fail when exceeding max stock without auto-adjust
statusReason: Expected values to be strictly equal:

true !== false

[Killed] EqualityOperator
src/services/inventoryService.js:167:7
   let finalQuantity = quantity;
 
   // Check maximum stock level
-  if (product.stock + quantity > maxStock) {
+  if (product.stock + quantity <= maxStock) {
     if (autoAdjust) {
       // Adjust to max stock level
killedBy: InventoryService - Unit Tests restockProduct should successfully restock product
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/services/inventoryService.js:167:7
   let finalQuantity = quantity;
 
   // Check maximum stock level
-  if (product.stock + quantity > maxStock) {
+  if (product.stock + quantity >= maxStock) {
     if (autoAdjust) {
       // Adjust to max stock level
killedBy: InventoryService - Unit Tests restockProduct should fail when product already at max stock with autoAdjust
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/services/inventoryService.js:168:9
 
   // Check maximum stock level
   if (product.stock + quantity > maxStock) {
-    if (autoAdjust) {
+    if (true) {
       // Adjust to max stock level
       finalQuantity = maxStock - product.stock;
killedBy: InventoryService - Unit Tests restockProduct should fail when exceeding max stock without auto-adjust
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/services/inventoryService.js:168:9
 
   // Check maximum stock level
   if (product.stock + quantity > maxStock) {
-    if (autoAdjust) {
+    if (false) {
       // Adjust to max stock level
       finalQuantity = maxStock - product.stock;
killedBy: InventoryService - Unit Tests restockProduct should auto-adjust when exceeding max stock with autoAdjust
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ArithmeticOperator
src/services/inventoryService.js:170:23
   if (product.stock + quantity > maxStock) {
     if (autoAdjust) {
       // Adjust to max stock level
-      finalQuantity = maxStock - product.stock;
+      finalQuantity = maxStock + product.stock;
       
       if (finalQuantity <= 0) {
killedBy: InventoryService - Unit Tests restockProduct should auto-adjust when exceeding max stock with autoAdjust
statusReason: Expected values to be strictly equal:

60 !== 40

[Killed] ConditionalExpression
src/services/inventoryService.js:172:11
       // Adjust to max stock level
       finalQuantity = maxStock - product.stock;
       
-      if (finalQuantity <= 0) {
+      if (true) {
         return {
           success: false,
killedBy: InventoryService - Unit Tests restockProduct should auto-adjust when exceeding max stock with autoAdjust
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/services/inventoryService.js:172:11
       // Adjust to max stock level
       finalQuantity = maxStock - product.stock;
       
-      if (finalQuantity <= 0) {
+      if (finalQuantity > 0) {
         return {
           success: false,
killedBy: InventoryService - Unit Tests restockProduct should auto-adjust when exceeding max stock with autoAdjust
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/services/inventoryService.js:178:12
           message: 'Product already at maximum stock level'
         };
       }
-    } else {
-      return {
-        success: false,
-        message: `Restocking would exceed maximum stock level (${maxStock})`
-      };
-    }
+    } else {}
   }
 
killedBy: InventoryService - Unit Tests restockProduct should fail when exceeding max stock without auto-adjust
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BlockStatement
src/services/inventoryService.js:188:18
 
   const increased = product.increaseStock(finalQuantity);
 
-  if (increased) {
-    logInventoryTransaction(productId, finalQuantity, 'restock', {
-      previousStock: product.stock - finalQuantity,
-      newStock: product.stock,
-      adjusted: autoAdjust && finalQuantity !== quantity
-    });
-
-    return {
-      success: true,
-      message: 'Product restocked',
-      addedQuantity: finalQuantity,
-      newStock: product.stock,
-      adjusted: autoAdjust && finalQuantity !== quantity
-    };
-  } else {
+  if (increased) {} else {
     return {
       success: false,
killedBy: InventoryService - Unit Tests restockProduct should successfully restock product
statusReason: Cannot read properties of undefined (reading 'success')

[Survived] ArithmeticOperator
src/services/inventoryService.js:190:22
 
   if (increased) {
     logInventoryTransaction(productId, finalQuantity, 'restock', {
-      previousStock: product.stock - finalQuantity,
+      previousStock: product.stock + finalQuantity,
       newStock: product.stock,
       adjusted: autoAdjust && finalQuantity !== quantity

[Killed] LogicalOperator
src/services/inventoryService.js:192:17
     logInventoryTransaction(productId, finalQuantity, 'restock', {
       previousStock: product.stock - finalQuantity,
       newStock: product.stock,
-      adjusted: autoAdjust && finalQuantity !== quantity
+      adjusted: autoAdjust || finalQuantity !== quantity
     });
 
killedBy: InventoryService - Unit Tests restockProduct should fail when product already at max stock with autoAdjust
statusReason: Expected values to be strictly equal:

true !== false

[Survived] ConditionalExpression
src/services/inventoryService.js:192:17
     logInventoryTransaction(productId, finalQuantity, 'restock', {
       previousStock: product.stock - finalQuantity,
       newStock: product.stock,
-      adjusted: autoAdjust && finalQuantity !== quantity
+      adjusted: false
     });
 

[Killed] EqualityOperator
src/services/inventoryService.js:200:31
       message: 'Product restocked',
       addedQuantity: finalQuantity,
       newStock: product.stock,
-      adjusted: autoAdjust && finalQuantity !== quantity
+      adjusted: autoAdjust && finalQuantity === quantity
     };
   } else {
killedBy: InventoryService - Unit Tests restockProduct should auto-adjust when exceeding max stock with autoAdjust
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/services/inventoryService.js:200:17
       message: 'Product restocked',
       addedQuantity: finalQuantity,
       newStock: product.stock,
-      adjusted: autoAdjust && finalQuantity !== quantity
+      adjusted: true
     };
   } else {
killedBy: InventoryService - Unit Tests restockProduct should handle boundary case of restocking to exactly max
statusReason: Expected values to be strictly equal:

false !== true

[NoCoverage] BlockStatement
src/services/inventoryService.js:202:10
       newStock: product.stock,
       adjusted: autoAdjust && finalQuantity !== quantity
     };
-  } else {
-    return {
-      success: false,
-      message: 'Failed to restock product'
-    };
-  }
+  } else {}
 }
 

[NoCoverage] ObjectLiteral
src/services/inventoryService.js:203:12
       adjusted: autoAdjust && finalQuantity !== quantity
     };
   } else {
-    return {
-      success: false,
-      message: 'Failed to restock product'
-    };
+    return {};
   }
 }

[Survived] LogicalOperator
src/services/inventoryService.js:218:7
  */
 export function getLowStockProducts(threshold = 5, options = {}) {
   // Validate threshold
-  if (typeof threshold !== 'number' || threshold < 0) {
+  if (typeof threshold !== 'number' && threshold < 0) {
     threshold = 5;
   }

[Survived] EqualityOperator
src/services/inventoryService.js:218:7
  */
 export function getLowStockProducts(threshold = 5, options = {}) {
   // Validate threshold
-  if (typeof threshold !== 'number' || threshold < 0) {
+  if (typeof threshold === 'number' || threshold < 0) {
     threshold = 5;
   }

[Survived] BooleanLiteral
src/services/inventoryService.js:222:66
     threshold = 5;
   }
 
-  const { category = null, sortBy = 'stock', excludeOutOfStock = false } = options;
+  const { category = null, sortBy = 'stock', excludeOutOfStock = true } = options;
 
   // Get all products from catalog (assuming we have access)

[Survived] MethodExpression
src/services/inventoryService.js:229:20
   const products = [];
   
   // Filter with nested conditions
-  const lowStock = products.filter(product => {
-    // Check stock level
-    if (excludeOutOfStock && product.stock === 0) {
-      return false;
-    }
-
-    if (!product.isLowStock(threshold)) {
-      return false;
-    }
-
-    // Check category filter if provided
-    if (category && product.category.toLowerCase() !== category.toLowerCase()) {
-      return false;
-    }
-
-    return true;
-  });
+  const lowStock = products;
 
   // Sort results

[NoCoverage] BlockStatement
src/services/inventoryService.js:229:47
   const products = [];
   
   // Filter with nested conditions
-  const lowStock = products.filter(product => {
-    // Check stock level
-    if (excludeOutOfStock && product.stock === 0) {
-      return false;
-    }
-
-    if (!product.isLowStock(threshold)) {
-      return false;
-    }
-
-    // Check category filter if provided
-    if (category && product.category.toLowerCase() !== category.toLowerCase()) {
-      return false;
-    }
-
-    return true;
-  });
+  const lowStock = products.filter(product => {});
 
   // Sort results

[NoCoverage] ConditionalExpression
src/services/inventoryService.js:231:30
   // Filter with nested conditions
   const lowStock = products.filter(product => {
     // Check stock level
-    if (excludeOutOfStock && product.stock === 0) {
+    if (excludeOutOfStock && true) {
       return false;
     }

[NoCoverage] ConditionalExpression
src/services/inventoryService.js:231:9
   // Filter with nested conditions
   const lowStock = products.filter(product => {
     // Check stock level
-    if (excludeOutOfStock && product.stock === 0) {
+    if (false) {
       return false;
     }

[NoCoverage] BooleanLiteral
src/services/inventoryService.js:232:14
   const lowStock = products.filter(product => {
     // Check stock level
     if (excludeOutOfStock && product.stock === 0) {
-      return false;
+      return true;
     }
 

[NoCoverage] BlockStatement
src/services/inventoryService.js:235:41
       return false;
     }
 
-    if (!product.isLowStock(threshold)) {
-      return false;
-    }
+    if (!product.isLowStock(threshold)) {}
 
     // Check category filter if provided

[NoCoverage] ConditionalExpression
src/services/inventoryService.js:235:9
       return false;
     }
 
-    if (!product.isLowStock(threshold)) {
+    if (false) {
       return false;
     }

[NoCoverage] BooleanLiteral
src/services/inventoryService.js:236:14
     }
 
     if (!product.isLowStock(threshold)) {
-      return false;
+      return true;
     }
 

[NoCoverage] MethodExpression
src/services/inventoryService.js:240:56
     }
 
     // Check category filter if provided
-    if (category && product.category.toLowerCase() !== category.toLowerCase()) {
+    if (category && product.category.toLowerCase() !== category.toUpperCase()) {
       return false;
     }

[NoCoverage] BlockStatement
src/services/inventoryService.js:240:80
     }
 
     // Check category filter if provided
-    if (category && product.category.toLowerCase() !== category.toLowerCase()) {
-      return false;
-    }
+    if (category && product.category.toLowerCase() !== category.toLowerCase()) {}
 
     return true;

[NoCoverage] BooleanLiteral
src/services/inventoryService.js:241:14
 
     // Check category filter if provided
     if (category && product.category.toLowerCase() !== category.toLowerCase()) {
-      return false;
+      return true;
     }
 

[Survived] ConditionalExpression
src/services/inventoryService.js:248:7
   });
 
   // Sort results
-  if (sortBy === 'stock') {
+  if (false) {
     lowStock.sort((a, b) => a.stock - b.stock);
   } else if (sortBy === 'title') {

[Survived] ConditionalExpression
src/services/inventoryService.js:248:7
   });
 
   // Sort results
-  if (sortBy === 'stock') {
+  if (true) {
     lowStock.sort((a, b) => a.stock - b.stock);
   } else if (sortBy === 'title') {

[Survived] ArrowFunction
src/services/inventoryService.js:249:19
 
   // Sort results
   if (sortBy === 'stock') {
-    lowStock.sort((a, b) => a.stock - b.stock);
+    lowStock.sort(() => undefined);
   } else if (sortBy === 'title') {
     lowStock.sort((a, b) => a.title.localeCompare(b.title));

[Survived] MethodExpression
src/services/inventoryService.js:249:5
 
   // Sort results
   if (sortBy === 'stock') {
-    lowStock.sort((a, b) => a.stock - b.stock);
+    lowStock;
   } else if (sortBy === 'title') {
     lowStock.sort((a, b) => a.title.localeCompare(b.title));

[Survived] EqualityOperator
src/services/inventoryService.js:250:14
   // Sort results
   if (sortBy === 'stock') {
     lowStock.sort((a, b) => a.stock - b.stock);
-  } else if (sortBy === 'title') {
+  } else if (sortBy !== 'title') {
     lowStock.sort((a, b) => a.title.localeCompare(b.title));
   }

[Survived] BlockStatement
src/services/inventoryService.js:250:34
   // Sort results
   if (sortBy === 'stock') {
     lowStock.sort((a, b) => a.stock - b.stock);
-  } else if (sortBy === 'title') {
-    lowStock.sort((a, b) => a.title.localeCompare(b.title));
-  }
+  } else if (sortBy === 'title') {}
 
   return lowStock;

[Survived] ArrowFunction
src/services/inventoryService.js:251:19
   if (sortBy === 'stock') {
     lowStock.sort((a, b) => a.stock - b.stock);
   } else if (sortBy === 'title') {
-    lowStock.sort((a, b) => a.title.localeCompare(b.title));
+    lowStock.sort(() => undefined);
   }
 

[Survived] MethodExpression
src/services/inventoryService.js:251:5
   if (sortBy === 'stock') {
     lowStock.sort((a, b) => a.stock - b.stock);
   } else if (sortBy === 'title') {
-    lowStock.sort((a, b) => a.title.localeCompare(b.title));
+    lowStock;
   }
 
