[Killed] ConditionalExpression
src/utils/pricing.js:16:7
  */
 export function calculateDiscount(subtotal, discountType, discountValue) {
   // Validation with nested conditions
-  if (typeof subtotal !== 'number' || subtotal < 0) {
+  if (true) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateDiscount percentage discount should calculate valid percentage discount
statusReason: Expected values to be strictly equal:

0 !== 10

[Killed] LogicalOperator
src/utils/pricing.js:16:7
  */
 export function calculateDiscount(subtotal, discountType, discountValue) {
   // Validation with nested conditions
-  if (typeof subtotal !== 'number' || subtotal < 0) {
+  if (typeof subtotal !== 'number' && subtotal < 0) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateDiscount invalid inputs should return 0 for negative subtotal
statusReason: Expected values to be strictly equal:

-10 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:20:24
     return 0;
   }
 
-  if (!discountType || typeof discountType !== 'string') {
+  if (!discountType || typeof discountType === 'string') {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateDiscount percentage discount should calculate valid percentage discount
statusReason: Expected values to be strictly equal:

0 !== 10

[Killed] BooleanLiteral
src/utils/pricing.js:20:7
     return 0;
   }
 
-  if (!discountType || typeof discountType !== 'string') {
+  if (discountType || typeof discountType !== 'string') {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateDiscount percentage discount should calculate valid percentage discount
statusReason: Expected values to be strictly equal:

0 !== 10

[Killed] EqualityOperator
src/utils/pricing.js:24:44
     return 0;
   }
 
-  if (typeof discountValue !== 'number' || discountValue < 0) {
+  if (typeof discountValue !== 'number' || discountValue >= 0) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateDiscount percentage discount should calculate valid percentage discount
statusReason: Expected values to be strictly equal:

0 !== 10

[Killed] LogicalOperator
src/utils/pricing.js:24:7
     return 0;
   }
 
-  if (typeof discountValue !== 'number' || discountValue < 0) {
+  if (typeof discountValue !== 'number' && discountValue < 0) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateDiscount percentage discount should handle negative percentage as 0
statusReason: Expected values to be strictly equal:

-10 !== 0

[Killed] BlockStatement
src/utils/pricing.js:30:38
 
   let discountAmount = 0;
 
-  if (discountType === 'percentage') {
-    // Percentage discount with capping
-    if (discountValue > 100) {
-      discountValue = 100; // Cap at 100%
-    }
-    
-    discountAmount = (subtotal * discountValue) / 100;
-  } else if (discountType === 'fixed') {
+  if (discountType === 'percentage') {} else if (discountType === 'fixed') {
     // Fixed amount discount
     discountAmount = discountValue;
killedBy: Pricing Utils - Unit Tests calculateDiscount percentage discount should calculate valid percentage discount
statusReason: Expected values to be strictly equal:

0 !== 10

[Killed] ConditionalExpression
src/utils/pricing.js:30:7
 
   let discountAmount = 0;
 
-  if (discountType === 'percentage') {
+  if (true) {
     // Percentage discount with capping
     if (discountValue > 100) {
killedBy: Pricing Utils - Unit Tests calculateDiscount fixed discount should cap discount when exceeds subtotal by 1
statusReason: Expected values to be strictly equal:

25.5 !== 50

[Killed] EqualityOperator
src/utils/pricing.js:32:9
 
   if (discountType === 'percentage') {
     // Percentage discount with capping
-    if (discountValue > 100) {
+    if (discountValue <= 100) {
       discountValue = 100; // Cap at 100%
     }
killedBy: Pricing Utils - Unit Tests calculateDiscount percentage discount should calculate valid percentage discount
statusReason: Expected values to be strictly equal:

100 !== 10

[Killed] BlockStatement
src/utils/pricing.js:32:30
 
   if (discountType === 'percentage') {
     // Percentage discount with capping
-    if (discountValue > 100) {
-      discountValue = 100; // Cap at 100%
-    }
+    if (discountValue > 100) {}
     
     discountAmount = (subtotal * discountValue) / 100;
killedBy: Pricing Utils - Unit Tests calculateDiscount percentage discount should cap percentage at 100%
statusReason: Expected values to be strictly equal:

150 !== 100

[Killed] ArithmeticOperator
src/utils/pricing.js:36:23
       discountValue = 100; // Cap at 100%
     }
     
-    discountAmount = (subtotal * discountValue) / 100;
+    discountAmount = (subtotal / discountValue) / 100;
   } else if (discountType === 'fixed') {
     // Fixed amount discount
killedBy: Pricing Utils - Unit Tests calculateDiscount percentage discount should calculate valid percentage discount
statusReason: Expected values to be strictly equal:

0.1 !== 10

[Killed] ArithmeticOperator
src/utils/pricing.js:36:22
       discountValue = 100; // Cap at 100%
     }
     
-    discountAmount = (subtotal * discountValue) / 100;
+    discountAmount = subtotal * discountValue * 100;
   } else if (discountType === 'fixed') {
     // Fixed amount discount
killedBy: Pricing Utils - Unit Tests calculateDiscount percentage discount should calculate valid percentage discount
statusReason: Expected values to be strictly equal:

100000 !== 10

[Killed] ConditionalExpression
src/utils/pricing.js:37:14
     }
     
     discountAmount = (subtotal * discountValue) / 100;
-  } else if (discountType === 'fixed') {
+  } else if (false) {
     // Fixed amount discount
     discountAmount = discountValue;
killedBy: Pricing Utils - Unit Tests calculateDiscount fixed discount should apply fixed discount
statusReason: Expected values to be strictly equal:

0 !== 20

[Killed] ConditionalExpression
src/utils/pricing.js:37:14
     }
     
     discountAmount = (subtotal * discountValue) / 100;
-  } else if (discountType === 'fixed') {
+  } else if (true) {
     // Fixed amount discount
     discountAmount = discountValue;
killedBy: Pricing Utils - Unit Tests calculateDiscount invalid inputs should return 0 for invalid discount type
statusReason: Expected values to be strictly equal:

10 !== 0

[Killed] ConditionalExpression
src/utils/pricing.js:42:9
     discountAmount = discountValue;
     
     // Cannot exceed subtotal
-    if (discountAmount > subtotal) {
+    if (false) {
       discountAmount = subtotal;
     }
killedBy: Pricing Utils - Unit Tests calculateDiscount fixed discount should cap fixed discount at subtotal
statusReason: Expected values to be strictly equal:

100 !== 50

[Killed] ConditionalExpression
src/utils/pricing.js:42:9
     discountAmount = discountValue;
     
     // Cannot exceed subtotal
-    if (discountAmount > subtotal) {
+    if (true) {
       discountAmount = subtotal;
     }
killedBy: Pricing Utils - Unit Tests calculateDiscount fixed discount should apply fixed discount
statusReason: Expected values to be strictly equal:

100 !== 20

[Survived] BlockStatement
src/utils/pricing.js:45:10
     if (discountAmount > subtotal) {
       discountAmount = subtotal;
     }
-  } else {
-    return 0; // Invalid discount type
-  }
+  } else {}
 
   // Round to 2 decimal places

[Killed] ArithmeticOperator
src/utils/pricing.js:50:21
   }
 
   // Round to 2 decimal places
-  return Math.round(discountAmount * 100) / 100;
+  return Math.round(discountAmount / 100) / 100;
 }
 
killedBy: Pricing Utils - Unit Tests calculateDiscount percentage discount should calculate valid percentage discount
statusReason: Expected values to be strictly equal:

0 !== 10

[Killed] ArithmeticOperator
src/utils/pricing.js:50:10
   }
 
   // Round to 2 decimal places
-  return Math.round(discountAmount * 100) / 100;
+  return Math.round(discountAmount * 100) * 100;
 }
 
killedBy: Pricing Utils - Unit Tests calculateDiscount percentage discount should calculate valid percentage discount
statusReason: Expected values to be strictly equal:

100000 !== 10

[Killed] BlockStatement
src/utils/pricing.js:59:43
  * @param {number} subtotal - Subtotal amount
  * @returns {object} Discount tier info {percentage, minPurchase, name}
  */
-export function getDiscountTier(subtotal) {
-  // Multiple threshold checks with nested conditions
-  if (typeof subtotal !== 'number' || subtotal < 0) {
-    return 0;
-  }
-
-  // Nested if-else chain for different tiers
-  if (subtotal >= 1000) {
-    return 0.25;
-  } else if (subtotal >= 500) {
-    return 0.20;
-  } else if (subtotal >= 200) {
-    return 0.15;
-  } else if (subtotal >= 100) {
-    return 0.10;
-  } else if (subtotal >= 50) {
-    return 0.05;
-  } else {
-    return 0;
-  }
-}
+export function getDiscountTier(subtotal) {}
 
 /**
killedBy: Pricing Utils - Unit Tests getDiscountTier should return 0 for $0
statusReason: Expected values to be strictly equal:

undefined !== 0

[Killed] BlockStatement
src/utils/pricing.js:61:53
  */
 export function getDiscountTier(subtotal) {
   // Multiple threshold checks with nested conditions
-  if (typeof subtotal !== 'number' || subtotal < 0) {
-    return 0;
-  }
+  if (typeof subtotal !== 'number' || subtotal < 0) {}
 
   // Nested if-else chain for different tiers
killedBy: Pricing Utils - Unit Tests getDiscountTier should return 0 for non-number input
statusReason: Expected values to be strictly equal:

0.2 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:61:39
  */
 export function getDiscountTier(subtotal) {
   // Multiple threshold checks with nested conditions
-  if (typeof subtotal !== 'number' || subtotal < 0) {
+  if (typeof subtotal !== 'number' || subtotal >= 0) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests getDiscountTier should return 0.05 for exactly $50
statusReason: Expected values to be strictly equal:

0 !== 0.05

[Killed] EqualityOperator
src/utils/pricing.js:66:7
   }
 
   // Nested if-else chain for different tiers
-  if (subtotal >= 1000) {
+  if (subtotal < 1000) {
     return 0.25;
   } else if (subtotal >= 500) {
killedBy: Pricing Utils - Unit Tests getDiscountTier should return 0 for $0
statusReason: Expected values to be strictly equal:

0.25 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:66:7
   }
 
   // Nested if-else chain for different tiers
-  if (subtotal >= 1000) {
+  if (subtotal > 1000) {
     return 0.25;
   } else if (subtotal >= 500) {
killedBy: Pricing Utils - Unit Tests getDiscountTier should return 0.25 for exactly $1000
statusReason: Expected values to be strictly equal:

0.2 !== 0.25

[Killed] ConditionalExpression
src/utils/pricing.js:68:14
   // Nested if-else chain for different tiers
   if (subtotal >= 1000) {
     return 0.25;
-  } else if (subtotal >= 500) {
+  } else if (true) {
     return 0.20;
   } else if (subtotal >= 200) {
killedBy: Pricing Utils - Unit Tests getDiscountTier should return 0 for $0
statusReason: Expected values to be strictly equal:

0.2 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:68:14
   // Nested if-else chain for different tiers
   if (subtotal >= 1000) {
     return 0.25;
-  } else if (subtotal >= 500) {
+  } else if (subtotal < 500) {
     return 0.20;
   } else if (subtotal >= 200) {
killedBy: Pricing Utils - Unit Tests getDiscountTier should return 0 for $0
statusReason: Expected values to be strictly equal:

0.2 !== 0

[Killed] ConditionalExpression
src/utils/pricing.js:70:14
     return 0.25;
   } else if (subtotal >= 500) {
     return 0.20;
-  } else if (subtotal >= 200) {
+  } else if (true) {
     return 0.15;
   } else if (subtotal >= 100) {
killedBy: Pricing Utils - Unit Tests getDiscountTier should return 0 for $0
statusReason: Expected values to be strictly equal:

0.15 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:70:14
     return 0.25;
   } else if (subtotal >= 500) {
     return 0.20;
-  } else if (subtotal >= 200) {
+  } else if (subtotal > 200) {
     return 0.15;
   } else if (subtotal >= 100) {
killedBy: Pricing Utils - Unit Tests getDiscountTier should return 0.15 for exactly $200
statusReason: Expected values to be strictly equal:

0.1 !== 0.15

[Killed] EqualityOperator
src/utils/pricing.js:72:14
     return 0.20;
   } else if (subtotal >= 200) {
     return 0.15;
-  } else if (subtotal >= 100) {
+  } else if (subtotal > 100) {
     return 0.10;
   } else if (subtotal >= 50) {
killedBy: Pricing Utils - Unit Tests getDiscountTier should return 0.10 for exactly $100
statusReason: Expected values to be strictly equal:

0.05 !== 0.1

[Killed] EqualityOperator
src/utils/pricing.js:72:14
     return 0.20;
   } else if (subtotal >= 200) {
     return 0.15;
-  } else if (subtotal >= 100) {
+  } else if (subtotal < 100) {
     return 0.10;
   } else if (subtotal >= 50) {
killedBy: Pricing Utils - Unit Tests getDiscountTier should return 0 for $0
statusReason: Expected values to be strictly equal:

0.1 !== 0

[Killed] BlockStatement
src/utils/pricing.js:74:30
     return 0.15;
   } else if (subtotal >= 100) {
     return 0.10;
-  } else if (subtotal >= 50) {
-    return 0.05;
-  } else {
+  } else if (subtotal >= 50) {} else {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests getDiscountTier should return 0.05 for exactly $50
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- 0.05

[Killed] ConditionalExpression
src/utils/pricing.js:74:14
     return 0.15;
   } else if (subtotal >= 100) {
     return 0.10;
-  } else if (subtotal >= 50) {
+  } else if (true) {
     return 0.05;
   } else {
killedBy: Pricing Utils - Unit Tests getDiscountTier should return 0 for $0
statusReason: Expected values to be strictly equal:

0.05 !== 0

[Killed] BlockStatement
src/utils/pricing.js:76:10
     return 0.10;
   } else if (subtotal >= 50) {
     return 0.05;
-  } else {
-    return 0;
-  }
+  } else {}
 }
 
killedBy: Pricing Utils - Unit Tests getDiscountTier should return 0 for $0
statusReason: Expected values to be strictly equal:

undefined !== 0

[Killed] BlockStatement
src/utils/pricing.js:86:47
  * @param {number} subtotal - Subtotal amount
  * @returns {object} Discount tier info
  */
-export function getDiscountTierInfo(subtotal) {
-  if (typeof subtotal !== 'number' || subtotal < 0) {
-    return { percentage: 0, minPurchase: 0, name: 'none' };
-  }
-
-  if (subtotal >= 200) {
-    return { percentage: 20, minPurchase: 200, name: 'platinum' };
-  } else if (subtotal >= 150) {
-    return { percentage: 15, minPurchase: 150, name: 'gold' };
-  } else if (subtotal >= 100) {
-    return { percentage: 10, minPurchase: 100, name: 'silver' };
-  } else if (subtotal >= 50) {
-    return { percentage: 5, minPurchase: 50, name: 'bronze' };
-  } else {
-    return { percentage: 0, minPurchase: 0, name: 'none' };
-  }
-}
+export function getDiscountTierInfo(subtotal) {}
 
 /**
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return no discount info for $0
statusReason: Cannot read properties of undefined (reading 'percentage')

[Killed] ConditionalExpression
src/utils/pricing.js:87:7
  * @returns {object} Discount tier info
  */
 export function getDiscountTierInfo(subtotal) {
-  if (typeof subtotal !== 'number' || subtotal < 0) {
+  if (true) {
     return { percentage: 0, minPurchase: 0, name: 'none' };
   }
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return bronze tier info for $50
statusReason: Expected values to be strictly equal:

0 !== 5

[Killed] EqualityOperator
src/utils/pricing.js:87:39
  * @returns {object} Discount tier info
  */
 export function getDiscountTierInfo(subtotal) {
-  if (typeof subtotal !== 'number' || subtotal < 0) {
+  if (typeof subtotal !== 'number' || subtotal >= 0) {
     return { percentage: 0, minPurchase: 0, name: 'none' };
   }
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return bronze tier info for $50
statusReason: Expected values to be strictly equal:

0 !== 5

[Killed] ConditionalExpression
src/utils/pricing.js:91:7
     return { percentage: 0, minPurchase: 0, name: 'none' };
   }
 
-  if (subtotal >= 200) {
+  if (false) {
     return { percentage: 20, minPurchase: 200, name: 'platinum' };
   } else if (subtotal >= 150) {
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return platinum tier info for $200
statusReason: Expected values to be strictly equal:

15 !== 20

[Killed] BlockStatement
src/utils/pricing.js:91:24
     return { percentage: 0, minPurchase: 0, name: 'none' };
   }
 
-  if (subtotal >= 200) {
-    return { percentage: 20, minPurchase: 200, name: 'platinum' };
-  } else if (subtotal >= 150) {
+  if (subtotal >= 200) {} else if (subtotal >= 150) {
     return { percentage: 15, minPurchase: 150, name: 'gold' };
   } else if (subtotal >= 100) {
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return platinum tier info for $200
statusReason: Cannot read properties of undefined (reading 'percentage')

[Killed] ObjectLiteral
src/utils/pricing.js:92:12
   }
 
   if (subtotal >= 200) {
-    return { percentage: 20, minPurchase: 200, name: 'platinum' };
+    return {};
   } else if (subtotal >= 150) {
     return { percentage: 15, minPurchase: 150, name: 'gold' };
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return platinum tier info for $200
statusReason: Expected values to be strictly equal:

undefined !== 20

[Killed] EqualityOperator
src/utils/pricing.js:93:14
 
   if (subtotal >= 200) {
     return { percentage: 20, minPurchase: 200, name: 'platinum' };
-  } else if (subtotal >= 150) {
+  } else if (subtotal > 150) {
     return { percentage: 15, minPurchase: 150, name: 'gold' };
   } else if (subtotal >= 100) {
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return gold tier info for $150
statusReason: Expected values to be strictly equal:

10 !== 15

[Killed] EqualityOperator
src/utils/pricing.js:93:14
 
   if (subtotal >= 200) {
     return { percentage: 20, minPurchase: 200, name: 'platinum' };
-  } else if (subtotal >= 150) {
+  } else if (subtotal < 150) {
     return { percentage: 15, minPurchase: 150, name: 'gold' };
   } else if (subtotal >= 100) {
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return no discount info for $0
statusReason: Expected values to be strictly equal:

15 !== 0

[Killed] ObjectLiteral
src/utils/pricing.js:94:12
   if (subtotal >= 200) {
     return { percentage: 20, minPurchase: 200, name: 'platinum' };
   } else if (subtotal >= 150) {
-    return { percentage: 15, minPurchase: 150, name: 'gold' };
+    return {};
   } else if (subtotal >= 100) {
     return { percentage: 10, minPurchase: 100, name: 'silver' };
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return gold tier info for $150
statusReason: Expected values to be strictly equal:

undefined !== 15

[Killed] ConditionalExpression
src/utils/pricing.js:95:14
     return { percentage: 20, minPurchase: 200, name: 'platinum' };
   } else if (subtotal >= 150) {
     return { percentage: 15, minPurchase: 150, name: 'gold' };
-  } else if (subtotal >= 100) {
+  } else if (false) {
     return { percentage: 10, minPurchase: 100, name: 'silver' };
   } else if (subtotal >= 50) {
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return silver tier info for $100
statusReason: Expected values to be strictly equal:

5 !== 10

[Killed] BlockStatement
src/utils/pricing.js:95:31
     return { percentage: 20, minPurchase: 200, name: 'platinum' };
   } else if (subtotal >= 150) {
     return { percentage: 15, minPurchase: 150, name: 'gold' };
-  } else if (subtotal >= 100) {
-    return { percentage: 10, minPurchase: 100, name: 'silver' };
-  } else if (subtotal >= 50) {
+  } else if (subtotal >= 100) {} else if (subtotal >= 50) {
     return { percentage: 5, minPurchase: 50, name: 'bronze' };
   } else {
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return silver tier info for $100
statusReason: Cannot read properties of undefined (reading 'percentage')

[Killed] ObjectLiteral
src/utils/pricing.js:96:12
   } else if (subtotal >= 150) {
     return { percentage: 15, minPurchase: 150, name: 'gold' };
   } else if (subtotal >= 100) {
-    return { percentage: 10, minPurchase: 100, name: 'silver' };
+    return {};
   } else if (subtotal >= 50) {
     return { percentage: 5, minPurchase: 50, name: 'bronze' };
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return silver tier info for $100
statusReason: Expected values to be strictly equal:

undefined !== 10

[Killed] ConditionalExpression
src/utils/pricing.js:97:14
     return { percentage: 15, minPurchase: 150, name: 'gold' };
   } else if (subtotal >= 100) {
     return { percentage: 10, minPurchase: 100, name: 'silver' };
-  } else if (subtotal >= 50) {
+  } else if (true) {
     return { percentage: 5, minPurchase: 50, name: 'bronze' };
   } else {
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return no discount info for $0
statusReason: Expected values to be strictly equal:

5 !== 0

[Killed] ConditionalExpression
src/utils/pricing.js:97:14
     return { percentage: 15, minPurchase: 150, name: 'gold' };
   } else if (subtotal >= 100) {
     return { percentage: 10, minPurchase: 100, name: 'silver' };
-  } else if (subtotal >= 50) {
+  } else if (false) {
     return { percentage: 5, minPurchase: 50, name: 'bronze' };
   } else {
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return bronze tier info for $50
statusReason: Expected values to be strictly equal:

0 !== 5

[Killed] BlockStatement
src/utils/pricing.js:99:10
     return { percentage: 10, minPurchase: 100, name: 'silver' };
   } else if (subtotal >= 50) {
     return { percentage: 5, minPurchase: 50, name: 'bronze' };
-  } else {
-    return { percentage: 0, minPurchase: 0, name: 'none' };
-  }
+  } else {}
 }
 
killedBy: Pricing Utils - Unit Tests getDiscountTierInfo should return no discount info for $0
statusReason: Cannot read properties of undefined (reading 'percentage')

[Killed] BlockStatement
src/utils/pricing.js:116:42
   const freeShippingThreshold = 75;
 
   // Check if qualifies for free shipping
-  if (subtotal >= freeShippingThreshold) {
-    return 0;
-  }
+  if (subtotal >= freeShippingThreshold) {}
 
   // Validate inputs
killedBy: Pricing Utils - Unit Tests calculateShipping free shipping threshold should be free for subtotal at $75
statusReason: Expected values to be strictly equal:

5.99 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:116:7
   const freeShippingThreshold = 75;
 
   // Check if qualifies for free shipping
-  if (subtotal >= freeShippingThreshold) {
+  if (subtotal > freeShippingThreshold) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateShipping free shipping threshold should be free for subtotal at $75
statusReason: Expected values to be strictly equal:

5.99 !== 0

[Killed] ConditionalExpression
src/utils/pricing.js:121:37
   }
 
   // Validate inputs
-  if (typeof weight !== 'number' || weight <= 0) {
+  if (typeof weight !== 'number' || false) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateShipping invalid inputs should return 0 for negative weight
statusReason: Expected values to be strictly equal:

5.99 !== 0

[Killed] ConditionalExpression
src/utils/pricing.js:121:7
   }
 
   // Validate inputs
-  if (typeof weight !== 'number' || weight <= 0) {
+  if (true) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateShipping free shipping threshold should charge shipping for subtotal under $75
statusReason: Expected values to be strictly equal:

0 !== 5.99

[Killed] ConditionalExpression
src/utils/pricing.js:125:7
     return 0;
   }
 
-  if (!shippingZone || typeof shippingZone !== 'string') {
+  if (true) {
     return 5.99; // Default shipping
   }
killedBy: Pricing Utils - Unit Tests calculateShipping shipping zones should calculate regional zone shipping
statusReason: Expected values to be strictly equal:

5.99 !== 8.99

[Killed] EqualityOperator
src/utils/pricing.js:125:24
     return 0;
   }
 
-  if (!shippingZone || typeof shippingZone !== 'string') {
+  if (!shippingZone || typeof shippingZone === 'string') {
     return 5.99; // Default shipping
   }
killedBy: Pricing Utils - Unit Tests calculateShipping shipping zones should calculate regional zone shipping
statusReason: Expected values to be strictly equal:

5.99 !== 8.99

[Killed] MethodExpression
src/utils/pricing.js:129:16
     return 5.99; // Default shipping
   }
 
-  const zone = shippingZone.toLowerCase();
+  const zone = shippingZone.toUpperCase();
   let baseRate = 0;
 
killedBy: Pricing Utils - Unit Tests calculateShipping free shipping threshold should charge shipping for subtotal under $75
statusReason: Expected values to be strictly equal:

8.99 !== 5.99

[Killed] BlockStatement
src/utils/pricing.js:133:25
   let baseRate = 0;
 
   // Zone-based rates
-  if (zone === 'local') {
-    baseRate = 5.99;
-  } else if (zone === 'regional') {
+  if (zone === 'local') {} else if (zone === 'regional') {
     baseRate = 8.99;
   } else if (zone === 'national') {
killedBy: Pricing Utils - Unit Tests calculateShipping free shipping threshold should charge shipping for subtotal under $75
statusReason: Expected values to be strictly equal:

0 !== 5.99

[Killed] ConditionalExpression
src/utils/pricing.js:133:7
   let baseRate = 0;
 
   // Zone-based rates
-  if (zone === 'local') {
+  if (true) {
     baseRate = 5.99;
   } else if (zone === 'regional') {
killedBy: Pricing Utils - Unit Tests calculateShipping shipping zones should calculate regional zone shipping
statusReason: Expected values to be strictly equal:

5.99 !== 8.99

[Killed] EqualityOperator
src/utils/pricing.js:135:14
   // Zone-based rates
   if (zone === 'local') {
     baseRate = 5.99;
-  } else if (zone === 'regional') {
+  } else if (zone !== 'regional') {
     baseRate = 8.99;
   } else if (zone === 'national') {
killedBy: Pricing Utils - Unit Tests calculateShipping shipping zones should calculate national zone shipping
statusReason: Expected values to be strictly equal:

8.99 !== 12.99

[Killed] BlockStatement
src/utils/pricing.js:135:35
   // Zone-based rates
   if (zone === 'local') {
     baseRate = 5.99;
-  } else if (zone === 'regional') {
-    baseRate = 8.99;
-  } else if (zone === 'national') {
+  } else if (zone === 'regional') {} else if (zone === 'national') {
     baseRate = 12.99;
   } else if (zone === 'international') {
killedBy: Pricing Utils - Unit Tests calculateShipping shipping zones should calculate regional zone shipping
statusReason: Expected values to be strictly equal:

0 !== 8.99

[Killed] ConditionalExpression
src/utils/pricing.js:137:14
     baseRate = 5.99;
   } else if (zone === 'regional') {
     baseRate = 8.99;
-  } else if (zone === 'national') {
+  } else if (true) {
     baseRate = 12.99;
   } else if (zone === 'international') {
killedBy: Pricing Utils - Unit Tests calculateShipping shipping zones should calculate international zone shipping
statusReason: Expected values to be strictly equal:

12.99 !== 25.99

[Killed] BlockStatement
src/utils/pricing.js:137:35
     baseRate = 5.99;
   } else if (zone === 'regional') {
     baseRate = 8.99;
-  } else if (zone === 'national') {
-    baseRate = 12.99;
-  } else if (zone === 'international') {
+  } else if (zone === 'national') {} else if (zone === 'international') {
     baseRate = 25.99;
   } else {
killedBy: Pricing Utils - Unit Tests calculateShipping shipping zones should calculate national zone shipping
statusReason: Expected values to be strictly equal:

0 !== 12.99

[Killed] BlockStatement
src/utils/pricing.js:139:40
     baseRate = 8.99;
   } else if (zone === 'national') {
     baseRate = 12.99;
-  } else if (zone === 'international') {
-    baseRate = 25.99;
-  } else {
+  } else if (zone === 'international') {} else {
     baseRate = 8.99; // Default
   }
killedBy: Pricing Utils - Unit Tests calculateShipping shipping zones should calculate international zone shipping
statusReason: Expected values to be strictly equal:

0 !== 25.99

[Killed] ConditionalExpression
src/utils/pricing.js:139:14
     baseRate = 8.99;
   } else if (zone === 'national') {
     baseRate = 12.99;
-  } else if (zone === 'international') {
+  } else if (true) {
     baseRate = 25.99;
   } else {
killedBy: Pricing Utils - Unit Tests calculateShipping shipping zones should default to 8.99 for invalid zone
statusReason: Expected values to be strictly equal:

25.99 !== 8.99

[Killed] BlockStatement
src/utils/pricing.js:141:10
     baseRate = 12.99;
   } else if (zone === 'international') {
     baseRate = 25.99;
-  } else {
-    baseRate = 8.99; // Default
-  }
+  } else {}
 
   // Weight-based surcharge
killedBy: Pricing Utils - Unit Tests calculateShipping shipping zones should default to 8.99 for invalid zone
statusReason: Expected values to be strictly equal:

0 !== 8.99

[Killed] ConditionalExpression
src/utils/pricing.js:147:7
 
   // Weight-based surcharge
   let weightSurcharge = 0;
-  if (weight > 5) {
+  if (true) {
     weightSurcharge = (weight - 5) * 2.50;
   }
killedBy: Pricing Utils - Unit Tests calculateShipping free shipping threshold should charge shipping for subtotal under $75
statusReason: Expected values to be strictly equal:

-4.01 !== 5.99

[Killed] BlockStatement
src/utils/pricing.js:147:19
 
   // Weight-based surcharge
   let weightSurcharge = 0;
-  if (weight > 5) {
-    weightSurcharge = (weight - 5) * 2.50;
-  }
+  if (weight > 5) {}
 
   // Speed premium
killedBy: Pricing Utils - Unit Tests calculateShipping weight surcharge should charge extra for weight above 5kg boundary
statusReason: Expected values to be strictly equal:

5.99 !== 6.24
