[Killed] ArithmeticOperator
src/utils/pricing.js:148:24
   // Weight-based surcharge
   let weightSurcharge = 0;
   if (weight > 5) {
-    weightSurcharge = (weight - 5) * 2.50;
+    weightSurcharge = (weight + 5) * 2.50;
   }
 
killedBy: Pricing Utils - Unit Tests calculateShipping weight surcharge should charge extra for weight above 5kg boundary
statusReason: Expected values to be strictly equal:

31.24 !== 6.24

[Killed] ArithmeticOperator
src/utils/pricing.js:148:23
   // Weight-based surcharge
   let weightSurcharge = 0;
   if (weight > 5) {
-    weightSurcharge = (weight - 5) * 2.50;
+    weightSurcharge = (weight - 5) / 2.50;
   }
 
killedBy: Pricing Utils - Unit Tests calculateShipping weight surcharge should charge extra for weight above 5kg boundary
statusReason: Expected values to be strictly equal:

6.03 !== 6.24

[Killed] ConditionalExpression
src/utils/pricing.js:153:7
 
   // Speed premium
   let speedMultiplier = 1;
-  if (shippingSpeed === 'express') {
+  if (false) {
     speedMultiplier = 1.5;
   }
killedBy: Pricing Utils - Unit Tests calculateShipping shipping speed should apply 1.5x multiplier for express shipping
statusReason: Expected values to be strictly equal:

5.99 !== 8.99

[Killed] EqualityOperator
src/utils/pricing.js:153:7
 
   // Speed premium
   let speedMultiplier = 1;
-  if (shippingSpeed === 'express') {
+  if (shippingSpeed !== 'express') {
     speedMultiplier = 1.5;
   }
killedBy: Pricing Utils - Unit Tests calculateShipping free shipping threshold should charge shipping for subtotal under $75
statusReason: Expected values to be strictly equal:

8.99 !== 5.99

[Killed] ArithmeticOperator
src/utils/pricing.js:157:17
     speedMultiplier = 1.5;
   }
 
-  const total = (baseRate + weightSurcharge) * speedMultiplier;
+  const total = (baseRate + weightSurcharge) / speedMultiplier;
   return Math.round(total * 100) / 100;
 }
killedBy: Pricing Utils - Unit Tests calculateShipping shipping speed should apply 1.5x multiplier for express shipping
statusReason: Expected values to be strictly equal:

3.99 !== 8.99

[Killed] ArithmeticOperator
src/utils/pricing.js:157:18
     speedMultiplier = 1.5;
   }
 
-  const total = (baseRate + weightSurcharge) * speedMultiplier;
+  const total = (baseRate - weightSurcharge) * speedMultiplier;
   return Math.round(total * 100) / 100;
 }
killedBy: Pricing Utils - Unit Tests calculateShipping weight surcharge should charge extra for weight above 5kg boundary
statusReason: Expected values to be strictly equal:

5.74 !== 6.24

[Killed] ArithmeticOperator
src/utils/pricing.js:158:10
   }
 
   const total = (baseRate + weightSurcharge) * speedMultiplier;
-  return Math.round(total * 100) / 100;
+  return Math.round(total * 100) * 100;
 }
 
killedBy: Pricing Utils - Unit Tests calculateShipping free shipping threshold should charge shipping for subtotal under $75
statusReason: Expected values to be strictly equal:

59900 !== 5.99

[Killed] ArithmeticOperator
src/utils/pricing.js:158:21
   }
 
   const total = (baseRate + weightSurcharge) * speedMultiplier;
-  return Math.round(total * 100) / 100;
+  return Math.round(total / 100) / 100;
 }
 
killedBy: Pricing Utils - Unit Tests calculateShipping free shipping threshold should charge shipping for subtotal under $75
statusReason: Expected values to be strictly equal:

0 !== 5.99

[Killed] EqualityOperator
src/utils/pricing.js:170:7
  */
 export function calculateTax(amount, state, category = '') {
   // Validation
-  if (typeof amount !== 'number' || amount <= 0) {
+  if (typeof amount === 'number' || amount <= 0) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate CA tax at 7.25%
statusReason: Expected values to be strictly equal:

0 !== 7.25

[Killed] ConditionalExpression
src/utils/pricing.js:170:7
  */
 export function calculateTax(amount, state, category = '') {
   // Validation
-  if (typeof amount !== 'number' || amount <= 0) {
+  if (false) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateTax edge cases should return 0 for negative amount
statusReason: Expected values to be strictly equal:

-7.25 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:174:17
     return 0;
   }
 
-  if (!state || typeof state !== 'string') {
+  if (!state || typeof state === 'string') {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate CA tax at 7.25%
statusReason: Expected values to be strictly equal:

0 !== 7.25

[Killed] BooleanLiteral
src/utils/pricing.js:174:7
     return 0;
   }
 
-  if (!state || typeof state !== 'string') {
+  if (state || typeof state !== 'string') {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate CA tax at 7.25%
statusReason: Expected values to be strictly equal:

0 !== 7.25

[Killed] MethodExpression
src/utils/pricing.js:178:22
     return 0;
   }
 
-  const stateUpper = state.toUpperCase();
+  const stateUpper = state.toLowerCase();
 
   // Check for tax-exempt categories
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate CA tax at 7.25%
statusReason: Expected values to be strictly equal:

7 !== 7.25

[Killed] MethodExpression
src/utils/pricing.js:182:45
 
   // Check for tax-exempt categories
   const exemptCategories = ['education', 'children'];
-  if (category && exemptCategories.includes(category.toLowerCase())) {
+  if (category && exemptCategories.includes(category.toUpperCase())) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateTax tax-exempt categories should be tax-exempt for education category
statusReason: Expected values to be strictly equal:

7.25 !== 0

[Killed] ConditionalExpression
src/utils/pricing.js:182:7
 
   // Check for tax-exempt categories
   const exemptCategories = ['education', 'children'];
-  if (category && exemptCategories.includes(category.toLowerCase())) {
+  if (true) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate CA tax at 7.25%
statusReason: Expected values to be strictly equal:

0 !== 7.25

[Killed] BlockStatement
src/utils/pricing.js:189:28
   // Tax rates by state - complex branching
   let taxRate = 0;
 
-  if (stateUpper === 'CA') {
-    taxRate = 0.0725; // California
-  } else if (stateUpper === 'NY') {
+  if (stateUpper === 'CA') {} else if (stateUpper === 'NY') {
     taxRate = 0.08; // New York
   } else if (stateUpper === 'TX') {
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate CA tax at 7.25%
statusReason: Expected values to be strictly equal:

0 !== 7.25

[Killed] ConditionalExpression
src/utils/pricing.js:189:7
   // Tax rates by state - complex branching
   let taxRate = 0;
 
-  if (stateUpper === 'CA') {
+  if (true) {
     taxRate = 0.0725; // California
   } else if (stateUpper === 'NY') {
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate NY tax at 8%
statusReason: Expected values to be strictly equal:

7.25 !== 8

[Killed] ConditionalExpression
src/utils/pricing.js:191:14
 
   if (stateUpper === 'CA') {
     taxRate = 0.0725; // California
-  } else if (stateUpper === 'NY') {
+  } else if (true) {
     taxRate = 0.08; // New York
   } else if (stateUpper === 'TX') {
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate TX tax at 6.25%
statusReason: Expected values to be strictly equal:

8 !== 6.25

[Killed] EqualityOperator
src/utils/pricing.js:191:14
 
   if (stateUpper === 'CA') {
     taxRate = 0.0725; // California
-  } else if (stateUpper === 'NY') {
+  } else if (stateUpper !== 'NY') {
     taxRate = 0.08; // New York
   } else if (stateUpper === 'TX') {
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate NY tax at 8%
statusReason: Expected values to be strictly equal:

7 !== 8

[Killed] BlockStatement
src/utils/pricing.js:193:35
     taxRate = 0.0725; // California
   } else if (stateUpper === 'NY') {
     taxRate = 0.08; // New York
-  } else if (stateUpper === 'TX') {
-    taxRate = 0.0625; // Texas
-  } else if (stateUpper === 'FL') {
+  } else if (stateUpper === 'TX') {} else if (stateUpper === 'FL') {
     taxRate = 0.06; // Florida
   } else if (stateUpper === 'IL') {
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate TX tax at 6.25%
statusReason: Expected values to be strictly equal:

0 !== 6.25

[Killed] EqualityOperator
src/utils/pricing.js:193:14
     taxRate = 0.0725; // California
   } else if (stateUpper === 'NY') {
     taxRate = 0.08; // New York
-  } else if (stateUpper === 'TX') {
+  } else if (stateUpper !== 'TX') {
     taxRate = 0.0625; // Texas
   } else if (stateUpper === 'FL') {
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate TX tax at 6.25%
statusReason: Expected values to be strictly equal:

7 !== 6.25

[Killed] ConditionalExpression
src/utils/pricing.js:195:14
     taxRate = 0.08; // New York
   } else if (stateUpper === 'TX') {
     taxRate = 0.0625; // Texas
-  } else if (stateUpper === 'FL') {
+  } else if (false) {
     taxRate = 0.06; // Florida
   } else if (stateUpper === 'IL') {
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate FL tax at 6%
statusReason: Expected values to be strictly equal:

7 !== 6

[Killed] ConditionalExpression
src/utils/pricing.js:195:14
     taxRate = 0.08; // New York
   } else if (stateUpper === 'TX') {
     taxRate = 0.0625; // Texas
-  } else if (stateUpper === 'FL') {
+  } else if (true) {
     taxRate = 0.06; // Florida
   } else if (stateUpper === 'IL') {
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate IL tax at 6.25%
statusReason: Expected values to be strictly equal:

6 !== 6.25

[Killed] ConditionalExpression
src/utils/pricing.js:197:14
     taxRate = 0.0625; // Texas
   } else if (stateUpper === 'FL') {
     taxRate = 0.06; // Florida
-  } else if (stateUpper === 'IL') {
+  } else if (true) {
     taxRate = 0.0625; // Illinois
   } else if (stateUpper === 'PA') {
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate PA tax at 6%
statusReason: Expected values to be strictly equal:

6.25 !== 6

[Killed] ConditionalExpression
src/utils/pricing.js:197:14
     taxRate = 0.0625; // Texas
   } else if (stateUpper === 'FL') {
     taxRate = 0.06; // Florida
-  } else if (stateUpper === 'IL') {
+  } else if (false) {
     taxRate = 0.0625; // Illinois
   } else if (stateUpper === 'PA') {
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate IL tax at 6.25%
statusReason: Expected values to be strictly equal:

7 !== 6.25

[Killed] ConditionalExpression
src/utils/pricing.js:199:14
     taxRate = 0.06; // Florida
   } else if (stateUpper === 'IL') {
     taxRate = 0.0625; // Illinois
-  } else if (stateUpper === 'PA') {
+  } else if (false) {
     taxRate = 0.06; // Pennsylvania
   } else if (stateUpper === 'OH') {
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate PA tax at 6%
statusReason: Expected values to be strictly equal:

7 !== 6

[Killed] ConditionalExpression
src/utils/pricing.js:199:14
     taxRate = 0.06; // Florida
   } else if (stateUpper === 'IL') {
     taxRate = 0.0625; // Illinois
-  } else if (stateUpper === 'PA') {
+  } else if (true) {
     taxRate = 0.06; // Pennsylvania
   } else if (stateUpper === 'OH') {
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate OH tax at 5.75%
statusReason: Expected values to be strictly equal:

6 !== 5.75

[Killed] BlockStatement
src/utils/pricing.js:201:35
     taxRate = 0.0625; // Illinois
   } else if (stateUpper === 'PA') {
     taxRate = 0.06; // Pennsylvania
-  } else if (stateUpper === 'OH') {
-    taxRate = 0.0575; // Ohio
-  } else {
+  } else if (stateUpper === 'OH') {} else {
     taxRate = 0.07; // Default rate
   }
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate OH tax at 5.75%
statusReason: Expected values to be strictly equal:

0 !== 5.75

[Killed] ConditionalExpression
src/utils/pricing.js:201:14
     taxRate = 0.0625; // Illinois
   } else if (stateUpper === 'PA') {
     taxRate = 0.06; // Pennsylvania
-  } else if (stateUpper === 'OH') {
+  } else if (true) {
     taxRate = 0.0575; // Ohio
   } else {
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should default to 7% for unknown state
statusReason: Expected values to be strictly equal:

5.75 !== 7

[Killed] BlockStatement
src/utils/pricing.js:203:10
     taxRate = 0.06; // Pennsylvania
   } else if (stateUpper === 'OH') {
     taxRate = 0.0575; // Ohio
-  } else {
-    taxRate = 0.07; // Default rate
-  }
+  } else {}
 
   const taxAmount = amount * taxRate;
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should default to 7% for unknown state
statusReason: Expected values to be strictly equal:

0 !== 7

[Killed] ArithmeticOperator
src/utils/pricing.js:207:21
     taxRate = 0.07; // Default rate
   }
 
-  const taxAmount = amount * taxRate;
+  const taxAmount = amount / taxRate;
   return Math.round(taxAmount * 100) / 100;
 }
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate CA tax at 7.25%
statusReason: Expected values to be strictly equal:

1379.31 !== 7.25

[Killed] ArithmeticOperator
src/utils/pricing.js:208:21
   }
 
   const taxAmount = amount * taxRate;
-  return Math.round(taxAmount * 100) / 100;
+  return Math.round(taxAmount / 100) / 100;
 }
 
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate CA tax at 7.25%
statusReason: Expected values to be strictly equal:

0 !== 7.25

[Killed] ArithmeticOperator
src/utils/pricing.js:208:10
   }
 
   const taxAmount = amount * taxRate;
-  return Math.round(taxAmount * 100) / 100;
+  return Math.round(taxAmount * 100) * 100;
 }
 
killedBy: Pricing Utils - Unit Tests calculateTax state tax rates should calculate CA tax at 7.25%
statusReason: Expected values to be strictly equal:

72500 !== 7.25

[Killed] LogicalOperator
src/utils/pricing.js:219:7
  */
 export function applyBulkDiscount(quantity, unitPrice) {
   // Validation with nested checks
-  if (typeof quantity !== 'number' || quantity <= 0 || !Number.isInteger(quantity)) {
+  if (typeof quantity !== 'number' && quantity <= 0 || !Number.isInteger(quantity)) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests applyBulkDiscount invalid inputs should return 0 for negative quantity
statusReason: Expected values to be strictly equal:
+ actual - expected

+ -0
- 0

[Killed] LogicalOperator
src/utils/pricing.js:219:7
  */
 export function applyBulkDiscount(quantity, unitPrice) {
   // Validation with nested checks
-  if (typeof quantity !== 'number' || quantity <= 0 || !Number.isInteger(quantity)) {
+  if ((typeof quantity !== 'number' || quantity <= 0) && !Number.isInteger(quantity)) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests applyBulkDiscount invalid inputs should return 0 for negative quantity
statusReason: Expected values to be strictly equal:
+ actual - expected

+ -0
- 0

[Killed] ConditionalExpression
src/utils/pricing.js:223:7
     return 0;
   }
 
-  if (typeof unitPrice !== 'number' || unitPrice <= 0) {
+  if (false) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests applyBulkDiscount invalid inputs should return 0 for negative price
statusReason: Expected values to be strictly equal:

-10 !== 0

[Killed] ConditionalExpression
src/utils/pricing.js:223:7
     return 0;
   }
 
-  if (typeof unitPrice !== 'number' || unitPrice <= 0) {
+  if (false || unitPrice <= 0) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests applyBulkDiscount invalid inputs should return 0 for non-number price
statusReason: Expected values to be strictly equal:

10 !== 0

[Killed] ArithmeticOperator
src/utils/pricing.js:227:22
     return 0;
   }
 
-  const totalPrice = quantity * unitPrice;
+  const totalPrice = quantity / unitPrice;
   let discountPercentage = 0;
 
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 5% discount at quantity 5
statusReason: Expected values to be strictly equal:

0.03 !== 2.5

[Killed] ConditionalExpression
src/utils/pricing.js:231:7
   let discountPercentage = 0;
 
   // Tiered bulk discounts with complex conditions
-  if (quantity >= 100) {
+  if (true) {
     discountPercentage = 25; // 25% off for 100+
   } else if (quantity >= 50) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 0 discount for quantity 1
statusReason: Expected values to be strictly equal:

2.5 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:231:7
   let discountPercentage = 0;
 
   // Tiered bulk discounts with complex conditions
-  if (quantity >= 100) {
+  if (quantity < 100) {
     discountPercentage = 25; // 25% off for 100+
   } else if (quantity >= 50) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 0 discount for quantity 1
statusReason: Expected values to be strictly equal:

2.5 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:233:14
   // Tiered bulk discounts with complex conditions
   if (quantity >= 100) {
     discountPercentage = 25; // 25% off for 100+
-  } else if (quantity >= 50) {
+  } else if (quantity < 50) {
     discountPercentage = 20; // 20% off for 50-99
   } else if (quantity >= 25) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 0 discount for quantity 1
statusReason: Expected values to be strictly equal:

2 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:233:14
   // Tiered bulk discounts with complex conditions
   if (quantity >= 100) {
     discountPercentage = 25; // 25% off for 100+
-  } else if (quantity >= 50) {
+  } else if (quantity > 50) {
     discountPercentage = 20; // 20% off for 50-99
   } else if (quantity >= 25) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 20% discount at quantity 50
statusReason: Expected values to be strictly equal:

75 !== 100

[Killed] EqualityOperator
src/utils/pricing.js:235:14
     discountPercentage = 25; // 25% off for 100+
   } else if (quantity >= 50) {
     discountPercentage = 20; // 20% off for 50-99
-  } else if (quantity >= 25) {
+  } else if (quantity < 25) {
     discountPercentage = 15; // 15% off for 25-49
   } else if (quantity >= 10) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 0 discount for quantity 1
statusReason: Expected values to be strictly equal:

1.5 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:235:14
     discountPercentage = 25; // 25% off for 100+
   } else if (quantity >= 50) {
     discountPercentage = 20; // 20% off for 50-99
-  } else if (quantity >= 25) {
+  } else if (quantity > 25) {
     discountPercentage = 15; // 15% off for 25-49
   } else if (quantity >= 10) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 15% discount at quantity 25
statusReason: Expected values to be strictly equal:

25 !== 37.5

[Killed] EqualityOperator
src/utils/pricing.js:237:14
     discountPercentage = 20; // 20% off for 50-99
   } else if (quantity >= 25) {
     discountPercentage = 15; // 15% off for 25-49
-  } else if (quantity >= 10) {
+  } else if (quantity > 10) {
     discountPercentage = 10; // 10% off for 10-24
   } else if (quantity >= 5) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 10% discount at quantity 10
statusReason: Expected values to be strictly equal:

5 !== 10

[Killed] EqualityOperator
src/utils/pricing.js:237:14
     discountPercentage = 20; // 20% off for 50-99
   } else if (quantity >= 25) {
     discountPercentage = 15; // 15% off for 25-49
-  } else if (quantity >= 10) {
+  } else if (quantity < 10) {
     discountPercentage = 10; // 10% off for 10-24
   } else if (quantity >= 5) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 0 discount for quantity 1
statusReason: Expected values to be strictly equal:

1 !== 0

[Killed] ConditionalExpression
src/utils/pricing.js:239:14
     discountPercentage = 15; // 15% off for 25-49
   } else if (quantity >= 10) {
     discountPercentage = 10; // 10% off for 10-24
-  } else if (quantity >= 5) {
+  } else if (false) {
     discountPercentage = 5; // 5% off for 5-9
   }
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 5% discount at quantity 5
statusReason: Expected values to be strictly equal:

0 !== 2.5

[Killed] EqualityOperator
src/utils/pricing.js:239:14
     discountPercentage = 15; // 15% off for 25-49
   } else if (quantity >= 10) {
     discountPercentage = 10; // 10% off for 10-24
-  } else if (quantity >= 5) {
+  } else if (quantity > 5) {
     discountPercentage = 5; // 5% off for 5-9
   }
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 5% discount at quantity 5
statusReason: Expected values to be strictly equal:

0 !== 2.5

[Killed] ArithmeticOperator
src/utils/pricing.js:243:21
     discountPercentage = 5; // 5% off for 5-9
   }
 
-  const discount = (totalPrice * discountPercentage) / 100;
+  const discount = (totalPrice / discountPercentage) / 100;
   return Math.round(discount * 100) / 100;
 }
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 0 discount for quantity 1
statusReason: Expected values to be strictly equal:

Infinity !== 0

[Killed] ArithmeticOperator
src/utils/pricing.js:243:20
     discountPercentage = 5; // 5% off for 5-9
   }
 
-  const discount = (totalPrice * discountPercentage) / 100;
+  const discount = totalPrice * discountPercentage * 100;
   return Math.round(discount * 100) / 100;
 }
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 5% discount at quantity 5
statusReason: Expected values to be strictly equal:

25000 !== 2.5

[Killed] ArithmeticOperator
src/utils/pricing.js:244:10
   }
 
   const discount = (totalPrice * discountPercentage) / 100;
-  return Math.round(discount * 100) / 100;
+  return Math.round(discount * 100) * 100;
 }
 
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 5% discount at quantity 5
statusReason: Expected values to be strictly equal:

25000 !== 2.5

[Killed] ArithmeticOperator
src/utils/pricing.js:244:21
   }
 
   const discount = (totalPrice * discountPercentage) / 100;
-  return Math.round(discount * 100) / 100;
+  return Math.round(discount / 100) / 100;
 }
 
killedBy: Pricing Utils - Unit Tests applyBulkDiscount should return 5% discount at quantity 5
statusReason: Expected values to be strictly equal:

0 !== 2.5

[Killed] BooleanLiteral
src/utils/pricing.js:254:56
  * @returns {object} Pricing info
  */
 export function applyBulkDiscountDetailed(quantity, unitPrice) {
-  if (typeof quantity !== 'number' || quantity <= 0 || !Number.isInteger(quantity)) {
+  if (typeof quantity !== 'number' || quantity <= 0 || Number.isInteger(quantity)) {
     return { totalPrice: 0, discount: 0, finalPrice: 0 };
   }
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

0 !== 50

[Killed] EqualityOperator
src/utils/pricing.js:254:7
  * @returns {object} Pricing info
  */
 export function applyBulkDiscountDetailed(quantity, unitPrice) {
-  if (typeof quantity !== 'number' || quantity <= 0 || !Number.isInteger(quantity)) {
+  if (typeof quantity === 'number' || quantity <= 0 || !Number.isInteger(quantity)) {
     return { totalPrice: 0, discount: 0, finalPrice: 0 };
   }
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

0 !== 50

[Killed] LogicalOperator
src/utils/pricing.js:258:7
     return { totalPrice: 0, discount: 0, finalPrice: 0 };
   }
 
-  if (typeof unitPrice !== 'number' || unitPrice <= 0) {
+  if (typeof unitPrice !== 'number' && unitPrice <= 0) {
     return { totalPrice: 0, discount: 0, finalPrice: 0 };
   }
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return zeros for invalid price
statusReason: Expected values to be strictly equal:

-100 !== 0

[Killed] BlockStatement
src/utils/pricing.js:258:56
     return { totalPrice: 0, discount: 0, finalPrice: 0 };
   }
 
-  if (typeof unitPrice !== 'number' || unitPrice <= 0) {
-    return { totalPrice: 0, discount: 0, finalPrice: 0 };
-  }
+  if (typeof unitPrice !== 'number' || unitPrice <= 0) {}
 
   const totalPrice = quantity * unitPrice;
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return zeros for invalid price
statusReason: Expected values to be strictly equal:

-100 !== 0

[Killed] ObjectLiteral
src/utils/pricing.js:259:12
   }
 
   if (typeof unitPrice !== 'number' || unitPrice <= 0) {
-    return { totalPrice: 0, discount: 0, finalPrice: 0 };
+    return {};
   }
 
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return zeros for invalid price
statusReason: Expected values to be strictly equal:

undefined !== 0

[Killed] EqualityOperator
src/utils/pricing.js:265:7
   const totalPrice = quantity * unitPrice;
   let discountPercentage = 0;
 
-  if (quantity >= 200) {
+  if (quantity > 200) {
     discountPercentage = 30;
   } else if (quantity >= 100) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 200
statusReason: Expected values to be strictly equal:

25 !== 30

[Killed] ConditionalExpression
src/utils/pricing.js:265:7
   const totalPrice = quantity * unitPrice;
   let discountPercentage = 0;
 
-  if (quantity >= 200) {
+  if (true) {
     discountPercentage = 30;
   } else if (quantity >= 100) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

15 !== 2.5

[Killed] ConditionalExpression
src/utils/pricing.js:267:14
 
   if (quantity >= 200) {
     discountPercentage = 30;
-  } else if (quantity >= 100) {
+  } else if (true) {
     discountPercentage = 25;
   } else if (quantity >= 50) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

12.5 !== 2.5

[Killed] EqualityOperator
src/utils/pricing.js:267:14
 
   if (quantity >= 200) {
     discountPercentage = 30;
-  } else if (quantity >= 100) {
+  } else if (quantity > 100) {
     discountPercentage = 25;
   } else if (quantity >= 50) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 100
statusReason: Expected values to be strictly equal:

200 !== 250

[Killed] EqualityOperator
src/utils/pricing.js:269:14
     discountPercentage = 30;
   } else if (quantity >= 100) {
     discountPercentage = 25;
-  } else if (quantity >= 50) {
+  } else if (quantity > 50) {
     discountPercentage = 20;
   } else if (quantity >= 20) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 50
statusReason: Expected values to be strictly equal:

15 !== 20

[Killed] EqualityOperator
src/utils/pricing.js:269:14
     discountPercentage = 30;
   } else if (quantity >= 100) {
     discountPercentage = 25;
-  } else if (quantity >= 50) {
+  } else if (quantity < 50) {
     discountPercentage = 20;
   } else if (quantity >= 20) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

10 !== 2.5

[Killed] BlockStatement
src/utils/pricing.js:271:30
     discountPercentage = 25;
   } else if (quantity >= 50) {
     discountPercentage = 20;
-  } else if (quantity >= 20) {
-    discountPercentage = 15;
-  } else if (quantity >= 10) {
+  } else if (quantity >= 20) {} else if (quantity >= 10) {
     discountPercentage = 10;
   } else if (quantity >= 5) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 20
statusReason: Expected values to be strictly equal:

0 !== 15

[Killed] ConditionalExpression
src/utils/pricing.js:271:14
     discountPercentage = 25;
   } else if (quantity >= 50) {
     discountPercentage = 20;
-  } else if (quantity >= 20) {
+  } else if (true) {
     discountPercentage = 15;
   } else if (quantity >= 10) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

7.5 !== 2.5

[Killed] ConditionalExpression
src/utils/pricing.js:273:14
     discountPercentage = 20;
   } else if (quantity >= 20) {
     discountPercentage = 15;
-  } else if (quantity >= 10) {
+  } else if (false) {
     discountPercentage = 10;
   } else if (quantity >= 5) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 10
statusReason: Expected values to be strictly equal:

5 !== 10

[Killed] ConditionalExpression
src/utils/pricing.js:273:14
     discountPercentage = 20;
   } else if (quantity >= 20) {
     discountPercentage = 15;
-  } else if (quantity >= 10) {
+  } else if (true) {
     discountPercentage = 10;
   } else if (quantity >= 5) {
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

5 !== 2.5

[Killed] EqualityOperator
src/utils/pricing.js:275:14
     discountPercentage = 15;
   } else if (quantity >= 10) {
     discountPercentage = 10;
-  } else if (quantity >= 5) {
+  } else if (quantity < 5) {
     discountPercentage = 5;
   }
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

0 !== 2.5
