[Killed] EqualityOperator
src/utils/pricing.js:275:14
     discountPercentage = 15;
   } else if (quantity >= 10) {
     discountPercentage = 10;
-  } else if (quantity >= 5) {
+  } else if (quantity > 5) {
     discountPercentage = 5;
   }
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

0 !== 2.5

[Killed] ArithmeticOperator
src/utils/pricing.js:280:22
   }
 
   const discount = (totalPrice * discountPercentage) / 100;
-  const finalPrice = totalPrice - discount;
+  const finalPrice = totalPrice + discount;
 
   return {
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

52.5 !== 47.5

[Killed] ArithmeticOperator
src/utils/pricing.js:283:28
   const finalPrice = totalPrice - discount;
 
   return {
-    totalPrice: Math.round(totalPrice * 100) / 100,
+    totalPrice: Math.round(totalPrice / 100) / 100,
     discount: Math.round(discount * 100) / 100,
     discountPercentage,
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

0.01 !== 50

[Killed] ArithmeticOperator
src/utils/pricing.js:283:17
   const finalPrice = totalPrice - discount;
 
   return {
-    totalPrice: Math.round(totalPrice * 100) / 100,
+    totalPrice: Math.round(totalPrice * 100) * 100,
     discount: Math.round(discount * 100) / 100,
     discountPercentage,
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

500000 !== 50

[Killed] ArithmeticOperator
src/utils/pricing.js:284:15
 
   return {
     totalPrice: Math.round(totalPrice * 100) / 100,
-    discount: Math.round(discount * 100) / 100,
+    discount: Math.round(discount * 100) * 100,
     discountPercentage,
     finalPrice: Math.round(finalPrice * 100) / 100
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

25000 !== 2.5

[Killed] ArithmeticOperator
src/utils/pricing.js:284:26
 
   return {
     totalPrice: Math.round(totalPrice * 100) / 100,
-    discount: Math.round(discount * 100) / 100,
+    discount: Math.round(discount / 100) / 100,
     discountPercentage,
     finalPrice: Math.round(finalPrice * 100) / 100
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

0 !== 2.5

[Killed] ArithmeticOperator
src/utils/pricing.js:286:17
     totalPrice: Math.round(totalPrice * 100) / 100,
     discount: Math.round(discount * 100) / 100,
     discountPercentage,
-    finalPrice: Math.round(finalPrice * 100) / 100
+    finalPrice: Math.round(finalPrice * 100) * 100
   };
 }
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

475000 !== 47.5

[Killed] ArithmeticOperator
src/utils/pricing.js:286:28
     totalPrice: Math.round(totalPrice * 100) / 100,
     discount: Math.round(discount * 100) / 100,
     discountPercentage,
-    finalPrice: Math.round(finalPrice * 100) / 100
+    finalPrice: Math.round(finalPrice / 100) / 100
   };
 }
killedBy: Pricing Utils - Unit Tests applyBulkDiscountDetailed should return detailed info for quantity 5
statusReason: Expected values to be strictly equal:

0 !== 47.5

[NoCoverage] BooleanLiteral
src/utils/pricing.js:297:85
  * @param {boolean} isBirthday - Whether it's customer's birthday month
  * @returns {number} Points earned
  */
-export function calculateLoyaltyPoints(amount, customerTier = 'basic', isBirthday = false) {
+export function calculateLoyaltyPoints(amount, customerTier = 'basic', isBirthday = true) {
   // Validation
   if (typeof amount !== 'number' || amount <= 0) {

[Killed] BlockStatement
src/utils/pricing.js:299:50
  */
 export function calculateLoyaltyPoints(amount, customerTier = 'basic', isBirthday = false) {
   // Validation
-  if (typeof amount !== 'number' || amount <= 0) {
-    return 0;
-  }
+  if (typeof amount !== 'number' || amount <= 0) {}
 
   let pointsMultiplier = 1;
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints invalid inputs should return 0 for negative amount
statusReason: Expected values to be strictly equal:

-100 !== 0

[Killed] ConditionalExpression
src/utils/pricing.js:299:7
  */
 export function calculateLoyaltyPoints(amount, customerTier = 'basic', isBirthday = false) {
   // Validation
-  if (typeof amount !== 'number' || amount <= 0) {
+  if (true) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should calculate 1x points + bonus for basic tier
statusReason: Expected values to be strictly equal:

0 !== 150

[Killed] ConditionalExpression
src/utils/pricing.js:306:7
   let pointsMultiplier = 1;
 
   // Tier-based multipliers with nested logic
-  if (customerTier === 'platinum') {
+  if (false) {
     pointsMultiplier = 5;
   } else if (customerTier === 'gold') {
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints platinum tier should calculate 5x points for platinum tier
statusReason: Expected values to be strictly equal:

150 !== 550

[Killed] EqualityOperator
src/utils/pricing.js:306:7
   let pointsMultiplier = 1;
 
   // Tier-based multipliers with nested logic
-  if (customerTier === 'platinum') {
+  if (customerTier !== 'platinum') {
     pointsMultiplier = 5;
   } else if (customerTier === 'gold') {
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should calculate 1x points + bonus for basic tier
statusReason: Expected values to be strictly equal:

550 !== 150

[Killed] BlockStatement
src/utils/pricing.js:308:39
   // Tier-based multipliers with nested logic
   if (customerTier === 'platinum') {
     pointsMultiplier = 5;
-  } else if (customerTier === 'gold') {
-    pointsMultiplier = 3;
-  } else if (customerTier === 'silver') {
+  } else if (customerTier === 'gold') {} else if (customerTier === 'silver') {
     pointsMultiplier = 2;
   } else {
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints gold tier should calculate 3x points for gold tier
statusReason: Expected values to be strictly equal:

150 !== 350

[Killed] ConditionalExpression
src/utils/pricing.js:308:14
   // Tier-based multipliers with nested logic
   if (customerTier === 'platinum') {
     pointsMultiplier = 5;
-  } else if (customerTier === 'gold') {
+  } else if (false) {
     pointsMultiplier = 3;
   } else if (customerTier === 'silver') {
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints gold tier should calculate 3x points for gold tier
statusReason: Expected values to be strictly equal:

150 !== 350

[Killed] ConditionalExpression
src/utils/pricing.js:310:14
     pointsMultiplier = 5;
   } else if (customerTier === 'gold') {
     pointsMultiplier = 3;
-  } else if (customerTier === 'silver') {
+  } else if (false) {
     pointsMultiplier = 2;
   } else {
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints silver tier should calculate 2x points for silver tier
statusReason: Expected values to be strictly equal:

150 !== 250

[Killed] EqualityOperator
src/utils/pricing.js:310:14
     pointsMultiplier = 5;
   } else if (customerTier === 'gold') {
     pointsMultiplier = 3;
-  } else if (customerTier === 'silver') {
+  } else if (customerTier !== 'silver') {
     pointsMultiplier = 2;
   } else {
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should calculate 1x points + bonus for basic tier
statusReason: Expected values to be strictly equal:

250 !== 150

[Survived] BlockStatement
src/utils/pricing.js:312:10
     pointsMultiplier = 3;
   } else if (customerTier === 'silver') {
     pointsMultiplier = 2;
-  } else {
-    pointsMultiplier = 1; // basic
-  }
+  } else {}
 
   // Birthday bonus

[Killed] ConditionalExpression
src/utils/pricing.js:317:7
   }
 
   // Birthday bonus
-  if (isBirthday === true) {
+  if (true) {
     pointsMultiplier *= 2; // Double points on birthday month
   }
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should calculate 1x points + bonus for basic tier
statusReason: Expected values to be strictly equal:

250 !== 150

[Killed] ConditionalExpression
src/utils/pricing.js:317:7
   }
 
   // Birthday bonus
-  if (isBirthday === true) {
+  if (false) {
     pointsMultiplier *= 2; // Double points on birthday month
   }
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should double points on birthday + bonus
statusReason: Expected values to be strictly equal:

150 !== 250

[Killed] AssignmentOperator
src/utils/pricing.js:318:5
 
   // Birthday bonus
   if (isBirthday === true) {
-    pointsMultiplier *= 2; // Double points on birthday month
+    pointsMultiplier /= 2; // Double points on birthday month
   }
 
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should double points on birthday + bonus
statusReason: Expected values to be strictly equal:

100 !== 250

[Killed] ArithmeticOperator
src/utils/pricing.js:322:27
   }
 
   // Base calculation: $1 = 1 point
-  let points = Math.floor(amount * pointsMultiplier);
+  let points = Math.floor(amount / pointsMultiplier);
 
   // Bonus points for high value purchases
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should double points on birthday + bonus
statusReason: Expected values to be strictly equal:

100 !== 250

[Killed] EqualityOperator
src/utils/pricing.js:325:7
   let points = Math.floor(amount * pointsMultiplier);
 
   // Bonus points for high value purchases
-  if (amount >= 200) {
+  if (amount < 200) {
     points += 100; // Bonus 100 points
   } else if (amount >= 100) {
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should calculate 1x points + bonus for basic tier
statusReason: Expected values to be strictly equal:

200 !== 150

[Killed] BlockStatement
src/utils/pricing.js:325:22
   let points = Math.floor(amount * pointsMultiplier);
 
   // Bonus points for high value purchases
-  if (amount >= 200) {
-    points += 100; // Bonus 100 points
-  } else if (amount >= 100) {
+  if (amount >= 200) {} else if (amount >= 100) {
     points += 50; // Bonus 50 points
   } else if (amount >= 50) {
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should add bonus 100 at $200
statusReason: Expected values to be strictly equal:

200 !== 300

[Killed] AssignmentOperator
src/utils/pricing.js:326:5
 
   // Bonus points for high value purchases
   if (amount >= 200) {
-    points += 100; // Bonus 100 points
+    points -= 100; // Bonus 100 points
   } else if (amount >= 100) {
     points += 50; // Bonus 50 points
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should add bonus 100 at $200
statusReason: Expected values to be strictly equal:

100 !== 300

[Killed] ConditionalExpression
src/utils/pricing.js:327:14
   // Bonus points for high value purchases
   if (amount >= 200) {
     points += 100; // Bonus 100 points
-  } else if (amount >= 100) {
+  } else if (true) {
     points += 50; // Bonus 50 points
   } else if (amount >= 50) {
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should add bonus 25 at $50
statusReason: Expected values to be strictly equal:

100 !== 75

[Killed] EqualityOperator
src/utils/pricing.js:327:14
   // Bonus points for high value purchases
   if (amount >= 200) {
     points += 100; // Bonus 100 points
-  } else if (amount >= 100) {
+  } else if (amount < 100) {
     points += 50; // Bonus 50 points
   } else if (amount >= 50) {
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should calculate 1x points + bonus for basic tier
statusReason: Expected values to be strictly equal:

125 !== 150

[Killed] AssignmentOperator
src/utils/pricing.js:328:5
   if (amount >= 200) {
     points += 100; // Bonus 100 points
   } else if (amount >= 100) {
-    points += 50; // Bonus 50 points
+    points -= 50; // Bonus 50 points
   } else if (amount >= 50) {
     points += 25; // Bonus 25 points
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should calculate 1x points + bonus for basic tier
statusReason: Expected values to be strictly equal:

50 !== 150

[Killed] EqualityOperator
src/utils/pricing.js:329:14
     points += 100; // Bonus 100 points
   } else if (amount >= 100) {
     points += 50; // Bonus 50 points
-  } else if (amount >= 50) {
+  } else if (amount < 50) {
     points += 25; // Bonus 25 points
   }
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should add bonus 25 at $50
statusReason: Expected values to be strictly equal:

50 !== 75

[Killed] BlockStatement
src/utils/pricing.js:329:28
     points += 100; // Bonus 100 points
   } else if (amount >= 100) {
     points += 50; // Bonus 50 points
-  } else if (amount >= 50) {
-    points += 25; // Bonus 25 points
-  }
+  } else if (amount >= 50) {}
 
   // Cap at 10000 points
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should add bonus 25 at $50
statusReason: Expected values to be strictly equal:

50 !== 75

[Killed] AssignmentOperator
src/utils/pricing.js:330:5
   } else if (amount >= 100) {
     points += 50; // Bonus 50 points
   } else if (amount >= 50) {
-    points += 25; // Bonus 25 points
+    points -= 25; // Bonus 25 points
   }
 
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should add bonus 25 at $50
statusReason: Expected values to be strictly equal:

25 !== 75

[Killed] ConditionalExpression
src/utils/pricing.js:334:7
   }
 
   // Cap at 10000 points
-  if (points > 10000) {
+  if (false) {
     points = 10000;
   }
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints points cap should cap at 10000 points
statusReason: Expected values to be strictly equal:

50100 !== 10000

[Killed] EqualityOperator
src/utils/pricing.js:334:7
   }
 
   // Cap at 10000 points
-  if (points > 10000) {
+  if (points <= 10000) {
     points = 10000;
   }
killedBy: Pricing Utils - Unit Tests calculateLoyaltyPoints basic tier should calculate 1x points + bonus for basic tier
statusReason: Expected values to be strictly equal:

10000 !== 150

[Killed] EqualityOperator
src/utils/pricing.js:350:7
  */
 export function applyPromotion(price, promoCode, productInfo = {}) {
   // Validation
-  if (typeof price !== 'number' || price <= 0) {
+  if (typeof price === 'number' || price <= 0) {
     return {
       originalPrice: 0,
killedBy: Pricing Utils - Unit Tests applyPromotion WELCOME10 code should apply 10% discount
statusReason: Expected values to be strictly equal:
+ actual - expected

+ {
+   discount: 0,
+   finalPrice: 0,
+   originalPrice: 0,
+   promoApplied: false

[Killed] LogicalOperator
src/utils/pricing.js:350:7
  */
 export function applyPromotion(price, promoCode, productInfo = {}) {
   // Validation
-  if (typeof price !== 'number' || price <= 0) {
+  if (typeof price !== 'number' && price <= 0) {
     return {
       originalPrice: 0,
killedBy: Pricing Utils - Unit Tests applyPromotion invalid inputs should return object with promoApplied false for negative price
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] BooleanLiteral
src/utils/pricing.js:355:21
       originalPrice: 0,
       finalPrice: 0,
       discount: 0,
-      promoApplied: false
+      promoApplied: true
     };
   }
killedBy: Pricing Utils - Unit Tests applyPromotion invalid inputs should return object with promoApplied false for negative price
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/utils/pricing.js:360:22
   }
 
   let discount = 0;
-  let promoApplied = false;
+  let promoApplied = true;
 
   // Complex promo code logic with nested conditions
killedBy: Pricing Utils - Unit Tests applyPromotion SAVE20 code should not apply below $50
statusReason: Expected values to be strictly equal:

true !== false

[Killed] EqualityOperator
src/utils/pricing.js:363:20
   let promoApplied = false;
 
   // Complex promo code logic with nested conditions
-  if (promoCode && typeof promoCode === 'string') {
+  if (promoCode && typeof promoCode !== 'string') {
     const code = promoCode.toUpperCase().trim();
 
killedBy: Pricing Utils - Unit Tests applyPromotion WELCOME10 code should apply 10% discount
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/pricing.js:363:7
   let promoApplied = false;
 
   // Complex promo code logic with nested conditions
-  if (promoCode && typeof promoCode === 'string') {
+  if (false) {
     const code = promoCode.toUpperCase().trim();
 
killedBy: Pricing Utils - Unit Tests applyPromotion WELCOME10 code should apply 10% discount
statusReason: Expected values to be strictly equal:

false !== true

[Killed] MethodExpression
src/utils/pricing.js:364:18
 
   // Complex promo code logic with nested conditions
   if (promoCode && typeof promoCode === 'string') {
-    const code = promoCode.toUpperCase().trim();
+    const code = promoCode.toUpperCase();
 
     if (code === 'WELCOME10') {
killedBy: Pricing Utils - Unit Tests applyPromotion WELCOME10 code should handle code with spaces
statusReason: Expected values to be strictly equal:

false !== true

[Killed] MethodExpression
src/utils/pricing.js:364:18
 
   // Complex promo code logic with nested conditions
   if (promoCode && typeof promoCode === 'string') {
-    const code = promoCode.toUpperCase().trim();
+    const code = promoCode.toLowerCase().trim();
 
     if (code === 'WELCOME10') {
killedBy: Pricing Utils - Unit Tests applyPromotion WELCOME10 code should apply 10% discount
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/pricing.js:366:9
   if (promoCode && typeof promoCode === 'string') {
     const code = promoCode.toUpperCase().trim();
 
-    if (code === 'WELCOME10') {
+    if (false) {
       discount = price * 0.10;
       promoApplied = true;
killedBy: Pricing Utils - Unit Tests applyPromotion WELCOME10 code should apply 10% discount
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/pricing.js:366:9
   if (promoCode && typeof promoCode === 'string') {
     const code = promoCode.toUpperCase().trim();
 
-    if (code === 'WELCOME10') {
+    if (code !== 'WELCOME10') {
       discount = price * 0.10;
       promoApplied = true;
killedBy: Pricing Utils - Unit Tests applyPromotion WELCOME10 code should apply 10% discount
statusReason: Expected values to be strictly equal:

false !== true

[Survived] ArithmeticOperator
src/utils/pricing.js:367:18
     const code = promoCode.toUpperCase().trim();
 
     if (code === 'WELCOME10') {
-      discount = price * 0.10;
+      discount = price / 0.10;
       promoApplied = true;
     } else if (code === 'SAVE20') {

[Killed] BooleanLiteral
src/utils/pricing.js:368:22
 
     if (code === 'WELCOME10') {
       discount = price * 0.10;
-      promoApplied = true;
+      promoApplied = false;
     } else if (code === 'SAVE20') {
       if (price >= 50) { // Minimum purchase requirement
killedBy: Pricing Utils - Unit Tests applyPromotion WELCOME10 code should apply 10% discount
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/pricing.js:369:16
     if (code === 'WELCOME10') {
       discount = price * 0.10;
       promoApplied = true;
-    } else if (code === 'SAVE20') {
+    } else if (false) {
       if (price >= 50) { // Minimum purchase requirement
         discount = price * 0.20;
killedBy: Pricing Utils - Unit Tests applyPromotion SAVE20 code should apply 20% with $50+ purchase
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/utils/pricing.js:369:35
     if (code === 'WELCOME10') {
       discount = price * 0.10;
       promoApplied = true;
-    } else if (code === 'SAVE20') {
-      if (price >= 50) { // Minimum purchase requirement
-        discount = price * 0.20;
-        promoApplied = true;
-      }
-    } else if (code === 'CLEARANCE30') {
+    } else if (code === 'SAVE20') {} else if (code === 'CLEARANCE30') {
       if (productInfo.isClearance === true) {
         discount = price * 0.30;
killedBy: Pricing Utils - Unit Tests applyPromotion SAVE20 code should apply 20% with $50+ purchase
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/utils/pricing.js:370:24
       discount = price * 0.10;
       promoApplied = true;
     } else if (code === 'SAVE20') {
-      if (price >= 50) { // Minimum purchase requirement
-        discount = price * 0.20;
-        promoApplied = true;
-      }
+      if (price >= 50) {}
     } else if (code === 'CLEARANCE30') {
       if (productInfo.isClearance === true) {
killedBy: Pricing Utils - Unit Tests applyPromotion SAVE20 code should apply 20% with $50+ purchase
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/pricing.js:370:11
       discount = price * 0.10;
       promoApplied = true;
     } else if (code === 'SAVE20') {
-      if (price >= 50) { // Minimum purchase requirement
+      if (price < 50) { // Minimum purchase requirement
         discount = price * 0.20;
         promoApplied = true;
killedBy: Pricing Utils - Unit Tests applyPromotion SAVE20 code should apply 20% with $50+ purchase
statusReason: Expected values to be strictly equal:

false !== true

[Survived] ArithmeticOperator
src/utils/pricing.js:371:20
       promoApplied = true;
     } else if (code === 'SAVE20') {
       if (price >= 50) { // Minimum purchase requirement
-        discount = price * 0.20;
+        discount = price / 0.20;
         promoApplied = true;
       }

[Killed] BooleanLiteral
src/utils/pricing.js:372:24
     } else if (code === 'SAVE20') {
       if (price >= 50) { // Minimum purchase requirement
         discount = price * 0.20;
-        promoApplied = true;
+        promoApplied = false;
       }
     } else if (code === 'CLEARANCE30') {
killedBy: Pricing Utils - Unit Tests applyPromotion SAVE20 code should apply 20% with $50+ purchase
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/pricing.js:374:16
         discount = price * 0.20;
         promoApplied = true;
       }
-    } else if (code === 'CLEARANCE30') {
+    } else if (true) {
       if (productInfo.isClearance === true) {
         discount = price * 0.30;
killedBy: Pricing Utils - Unit Tests applyPromotion NEWRELEASE15 code should apply 15% for new releases
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/utils/pricing.js:374:40
         discount = price * 0.20;
         promoApplied = true;
       }
-    } else if (code === 'CLEARANCE30') {
-      if (productInfo.isClearance === true) {
-        discount = price * 0.30;
-        promoApplied = true;
-      }
-    } else if (code === 'NEWRELEASE15') {
+    } else if (code === 'CLEARANCE30') {} else if (code === 'NEWRELEASE15') {
       if (productInfo.isNew === true) {
         discount = price * 0.15;
killedBy: Pricing Utils - Unit Tests applyPromotion CLEARANCE30 code should apply 30% for clearance items
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/pricing.js:375:39
         promoApplied = true;
       }
     } else if (code === 'CLEARANCE30') {
-      if (productInfo.isClearance === true) {
+      if (productInfo.isClearance === false) {
         discount = price * 0.30;
         promoApplied = true;
killedBy: Pricing Utils - Unit Tests applyPromotion CLEARANCE30 code should apply 30% for clearance items
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/pricing.js:375:11
         promoApplied = true;
       }
     } else if (code === 'CLEARANCE30') {
-      if (productInfo.isClearance === true) {
+      if (true) {
         discount = price * 0.30;
         promoApplied = true;
killedBy: Pricing Utils - Unit Tests applyPromotion CLEARANCE30 code should not apply for non-clearance
statusReason: Expected values to be strictly equal:

true !== false

[Survived] ArithmeticOperator
src/utils/pricing.js:376:20
       }
     } else if (code === 'CLEARANCE30') {
       if (productInfo.isClearance === true) {
-        discount = price * 0.30;
+        discount = price / 0.30;
         promoApplied = true;
       }

[Killed] BooleanLiteral
src/utils/pricing.js:377:24
     } else if (code === 'CLEARANCE30') {
       if (productInfo.isClearance === true) {
         discount = price * 0.30;
-        promoApplied = true;
+        promoApplied = false;
       }
     } else if (code === 'NEWRELEASE15') {
killedBy: Pricing Utils - Unit Tests applyPromotion CLEARANCE30 code should apply 30% for clearance items
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/pricing.js:379:16
         discount = price * 0.30;
         promoApplied = true;
       }
-    } else if (code === 'NEWRELEASE15') {
+    } else if (false) {
       if (productInfo.isNew === true) {
         discount = price * 0.15;
killedBy: Pricing Utils - Unit Tests applyPromotion NEWRELEASE15 code should apply 15% for new releases
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/pricing.js:379:16
         discount = price * 0.30;
         promoApplied = true;
       }
-    } else if (code === 'NEWRELEASE15') {
+    } else if (true) {
       if (productInfo.isNew === true) {
         discount = price * 0.15;
killedBy: Pricing Utils - Unit Tests applyPromotion FICTION25 code should apply 25% for fiction category
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/pricing.js:380:11
         promoApplied = true;
       }
     } else if (code === 'NEWRELEASE15') {
-      if (productInfo.isNew === true) {
+      if (true) {
         discount = price * 0.15;
         promoApplied = true;
killedBy: Pricing Utils - Unit Tests applyPromotion NEWRELEASE15 code should not apply for old items
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/utils/pricing.js:380:33
         promoApplied = true;
       }
     } else if (code === 'NEWRELEASE15') {
-      if (productInfo.isNew === true) {
+      if (productInfo.isNew === false) {
         discount = price * 0.15;
         promoApplied = true;
killedBy: Pricing Utils - Unit Tests applyPromotion NEWRELEASE15 code should apply 15% for new releases
statusReason: Expected values to be strictly equal:

false !== true

[Survived] ArithmeticOperator
src/utils/pricing.js:381:20
       }
     } else if (code === 'NEWRELEASE15') {
       if (productInfo.isNew === true) {
-        discount = price * 0.15;
+        discount = price / 0.15;
         promoApplied = true;
       }

[Killed] BooleanLiteral
src/utils/pricing.js:382:24
     } else if (code === 'NEWRELEASE15') {
       if (productInfo.isNew === true) {
         discount = price * 0.15;
-        promoApplied = true;
+        promoApplied = false;
       }
     } else if (code === 'FICTION25') {
killedBy: Pricing Utils - Unit Tests applyPromotion NEWRELEASE15 code should apply 15% for new releases
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/utils/pricing.js:384:38
         discount = price * 0.15;
         promoApplied = true;
       }
-    } else if (code === 'FICTION25') {
-      if (productInfo.category === 'fiction') {
-        discount = price * 0.25;
-        promoApplied = true;
-      }
-    }
+    } else if (code === 'FICTION25') {}
   }
 
killedBy: Pricing Utils - Unit Tests applyPromotion FICTION25 code should apply 25% for fiction category
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/pricing.js:384:16
         discount = price * 0.15;
         promoApplied = true;
       }
-    } else if (code === 'FICTION25') {
+    } else if (code !== 'FICTION25') {
       if (productInfo.category === 'fiction') {
         discount = price * 0.25;
killedBy: Pricing Utils - Unit Tests applyPromotion FICTION25 code should apply 25% for fiction category
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/pricing.js:385:11
         promoApplied = true;
       }
     } else if (code === 'FICTION25') {
-      if (productInfo.category === 'fiction') {
+      if (false) {
         discount = price * 0.25;
         promoApplied = true;
killedBy: Pricing Utils - Unit Tests applyPromotion FICTION25 code should apply 25% for fiction category
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/pricing.js:385:11
         promoApplied = true;
       }
     } else if (code === 'FICTION25') {
-      if (productInfo.category === 'fiction') {
+      if (productInfo.category !== 'fiction') {
         discount = price * 0.25;
         promoApplied = true;
killedBy: Pricing Utils - Unit Tests applyPromotion FICTION25 code should apply 25% for fiction category
statusReason: Expected values to be strictly equal:

false !== true
