[Survived] ArithmeticOperator
src/utils/pricing.js:386:20
       }
     } else if (code === 'FICTION25') {
       if (productInfo.category === 'fiction') {
-        discount = price * 0.25;
+        discount = price / 0.25;
         promoApplied = true;
       }

[Killed] BooleanLiteral
src/utils/pricing.js:387:24
     } else if (code === 'FICTION25') {
       if (productInfo.category === 'fiction') {
         discount = price * 0.25;
-        promoApplied = true;
+        promoApplied = false;
       }
     }
killedBy: Pricing Utils - Unit Tests applyPromotion FICTION25 code should apply 25% for fiction category
statusReason: Expected values to be strictly equal:

false !== true

[Survived] ArithmeticOperator
src/utils/pricing.js:392:22
     }
   }
 
-  const finalPrice = price - discount;
+  const finalPrice = price + discount;
 
   return promoApplied;

[Killed] EqualityOperator
src/utils/pricing.js:405:36
  * @returns {object} Pricing result
  */
 export function applyPromotionDetailed(price, promoCode, productInfo = {}) {
-  if (typeof price !== 'number' || price <= 0) {
+  if (typeof price !== 'number' || price > 0) {
     return {
       originalPrice: 0,
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should return detailed pricing for WELCOME10
statusReason: Expected values to be strictly equal:

0 !== 100

[Killed] LogicalOperator
src/utils/pricing.js:405:7
  * @returns {object} Pricing result
  */
 export function applyPromotionDetailed(price, promoCode, productInfo = {}) {
-  if (typeof price !== 'number' || price <= 0) {
+  if (typeof price !== 'number' && price <= 0) {
     return {
       originalPrice: 0,
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should return zeros for invalid price
statusReason: Expected values to be strictly equal:

-100 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:417:20
   let discount = 0;
   let promoApplied = false;
 
-  if (promoCode && typeof promoCode === 'string') {
+  if (promoCode && typeof promoCode !== 'string') {
     const code = promoCode.toUpperCase().trim();
 
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should return detailed pricing for WELCOME10
statusReason: Expected values to be strictly equal:

100 !== 90

[Killed] ConditionalExpression
src/utils/pricing.js:417:7
   let discount = 0;
   let promoApplied = false;
 
-  if (promoCode && typeof promoCode === 'string') {
+  if (false) {
     const code = promoCode.toUpperCase().trim();
 
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should return detailed pricing for WELCOME10
statusReason: Expected values to be strictly equal:

100 !== 90

[Killed] ConditionalExpression
src/utils/pricing.js:420:9
   if (promoCode && typeof promoCode === 'string') {
     const code = promoCode.toUpperCase().trim();
 
-    if (code === 'WELCOME10') {
+    if (true) {
       discount = price * 0.10;
       promoApplied = true;
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should apply SAVE20 correctly
statusReason: Expected values to be strictly equal:

10 !== 20

[Killed] BlockStatement
src/utils/pricing.js:423:35
     if (code === 'WELCOME10') {
       discount = price * 0.10;
       promoApplied = true;
-    } else if (code === 'SAVE20') {
-      if (price >= 50) {
-        discount = price * 0.20;
-        promoApplied = true;
-      }
-    } else if (code === 'CLEARANCE30') {
+    } else if (code === 'SAVE20') {} else if (code === 'CLEARANCE30') {
       if (productInfo.isClearance === true) {
         discount = price * 0.30;
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should apply SAVE20 correctly
statusReason: Expected values to be strictly equal:

0 !== 20

[Killed] BlockStatement
src/utils/pricing.js:424:24
       discount = price * 0.10;
       promoApplied = true;
     } else if (code === 'SAVE20') {
-      if (price >= 50) {
-        discount = price * 0.20;
-        promoApplied = true;
-      }
+      if (price >= 50) {}
     } else if (code === 'CLEARANCE30') {
       if (productInfo.isClearance === true) {
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should apply SAVE20 correctly
statusReason: Expected values to be strictly equal:

0 !== 20

[Killed] ConditionalExpression
src/utils/pricing.js:424:11
       discount = price * 0.10;
       promoApplied = true;
     } else if (code === 'SAVE20') {
-      if (price >= 50) {
+      if (false) {
         discount = price * 0.20;
         promoApplied = true;
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should apply SAVE20 correctly
statusReason: Expected values to be strictly equal:

0 !== 20

[Killed] ArithmeticOperator
src/utils/pricing.js:425:20
       promoApplied = true;
     } else if (code === 'SAVE20') {
       if (price >= 50) {
-        discount = price * 0.20;
+        discount = price / 0.20;
         promoApplied = true;
       }
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should apply SAVE20 correctly
statusReason: Expected values to be strictly equal:

500 !== 20

[Killed] EqualityOperator
src/utils/pricing.js:429:11
         promoApplied = true;
       }
     } else if (code === 'CLEARANCE30') {
-      if (productInfo.isClearance === true) {
+      if (productInfo.isClearance !== true) {
         discount = price * 0.30;
         promoApplied = true;
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should apply CLEARANCE30 correctly
statusReason: Expected values to be strictly equal:

0 !== 30

[Killed] EqualityOperator
src/utils/pricing.js:433:16
         discount = price * 0.30;
         promoApplied = true;
       }
-    } else if (code === 'NEWRELEASE15') {
+    } else if (code !== 'NEWRELEASE15') {
       if (productInfo.isNew === true) {
         discount = price * 0.15;
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should apply NEWRELEASE15 correctly
statusReason: Expected values to be strictly equal:

0 !== 15

[Killed] ConditionalExpression
src/utils/pricing.js:434:11
         promoApplied = true;
       }
     } else if (code === 'NEWRELEASE15') {
-      if (productInfo.isNew === true) {
+      if (false) {
         discount = price * 0.15;
         promoApplied = true;
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should apply NEWRELEASE15 correctly
statusReason: Expected values to be strictly equal:

0 !== 15

[Killed] BlockStatement
src/utils/pricing.js:434:39
         promoApplied = true;
       }
     } else if (code === 'NEWRELEASE15') {
-      if (productInfo.isNew === true) {
-        discount = price * 0.15;
-        promoApplied = true;
-      }
+      if (productInfo.isNew === true) {}
     } else if (code === 'FICTION25') {
       if (productInfo.category === 'fiction') {
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should apply NEWRELEASE15 correctly
statusReason: Expected values to be strictly equal:

0 !== 15

[Killed] ConditionalExpression
src/utils/pricing.js:438:16
         discount = price * 0.15;
         promoApplied = true;
       }
-    } else if (code === 'FICTION25') {
+    } else if (false) {
       if (productInfo.category === 'fiction') {
         discount = price * 0.25;
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should apply FICTION25 correctly
statusReason: Expected values to be strictly equal:

0 !== 25

[Killed] BlockStatement
src/utils/pricing.js:439:47
         promoApplied = true;
       }
     } else if (code === 'FICTION25') {
-      if (productInfo.category === 'fiction') {
-        discount = price * 0.25;
-        promoApplied = true;
-      }
+      if (productInfo.category === 'fiction') {}
     }
   }
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should apply FICTION25 correctly
statusReason: Expected values to be strictly equal:

0 !== 25

[Killed] ArithmeticOperator
src/utils/pricing.js:449:20
   const finalPrice = price - discount;
 
   return {
-    originalPrice: Math.round(price * 100) / 100,
+    originalPrice: Math.round(price * 100) * 100,
     finalPrice: Math.round(finalPrice * 100) / 100,
     discount: Math.round(discount * 100) / 100,
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should return detailed pricing for WELCOME10
statusReason: Expected values to be strictly equal:

1000000 !== 100

[Killed] ArithmeticOperator
src/utils/pricing.js:449:31
   const finalPrice = price - discount;
 
   return {
-    originalPrice: Math.round(price * 100) / 100,
+    originalPrice: Math.round(price / 100) / 100,
     finalPrice: Math.round(finalPrice * 100) / 100,
     discount: Math.round(discount * 100) / 100,
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should return detailed pricing for WELCOME10
statusReason: Expected values to be strictly equal:

0.01 !== 100

[Killed] ArithmeticOperator
src/utils/pricing.js:450:17
 
   return {
     originalPrice: Math.round(price * 100) / 100,
-    finalPrice: Math.round(finalPrice * 100) / 100,
+    finalPrice: Math.round(finalPrice * 100) * 100,
     discount: Math.round(discount * 100) / 100,
     promoApplied
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should return detailed pricing for WELCOME10
statusReason: Expected values to be strictly equal:

900000 !== 90

[Killed] ArithmeticOperator
src/utils/pricing.js:450:28
 
   return {
     originalPrice: Math.round(price * 100) / 100,
-    finalPrice: Math.round(finalPrice * 100) / 100,
+    finalPrice: Math.round(finalPrice / 100) / 100,
     discount: Math.round(discount * 100) / 100,
     promoApplied
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should return detailed pricing for WELCOME10
statusReason: Expected values to be strictly equal:

0.01 !== 90

[Killed] ArithmeticOperator
src/utils/pricing.js:451:15
   return {
     originalPrice: Math.round(price * 100) / 100,
     finalPrice: Math.round(finalPrice * 100) / 100,
-    discount: Math.round(discount * 100) / 100,
+    discount: Math.round(discount * 100) * 100,
     promoApplied
   };
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should return detailed pricing for WELCOME10
statusReason: Expected values to be strictly equal:

100000 !== 10

[Killed] ArithmeticOperator
src/utils/pricing.js:451:26
   return {
     originalPrice: Math.round(price * 100) / 100,
     finalPrice: Math.round(finalPrice * 100) / 100,
-    discount: Math.round(discount * 100) / 100,
+    discount: Math.round(discount / 100) / 100,
     promoApplied
   };
killedBy: Pricing Utils - Unit Tests applyPromotionDetailed should return detailed pricing for WELCOME10
statusReason: Expected values to be strictly equal:

0 !== 10

[Killed] ConditionalExpression
src/utils/pricing.js:465:7
  */
 export function calculateFinalTotal(subtotal, adjustments = {}, giftWrapCost = 0) {
   // Validation
-  if (typeof subtotal !== 'number' || subtotal < 0) {
+  if (false) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateFinalTotal invalid inputs should return 0 for non-number subtotal
statusReason: Expected values to be strictly equal:

100 !== 0

[Killed] ConditionalExpression
src/utils/pricing.js:465:7
  */
 export function calculateFinalTotal(subtotal, adjustments = {}, giftWrapCost = 0) {
   // Validation
-  if (typeof subtotal !== 'number' || subtotal < 0) {
+  if (false || subtotal < 0) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateFinalTotal invalid inputs should return 0 for non-number subtotal
statusReason: Expected values to be strictly equal:

100 !== 0

[Killed] ConditionalExpression
src/utils/pricing.js:469:20
     return 0;
   }
 
-  const discount = adjustments.discount || 0;
+  const discount = true;
   const shipping = adjustments.shipping || 0;
   const tax = adjustments.tax || 0;
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should calculate total with all adjustments
statusReason: Expected values to be strictly equal:

0 !== 103

[Killed] LogicalOperator
src/utils/pricing.js:469:20
     return 0;
   }
 
-  const discount = adjustments.discount || 0;
+  const discount = adjustments.discount && 0;
   const shipping = adjustments.shipping || 0;
   const tax = adjustments.tax || 0;
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should calculate total with all adjustments
statusReason: Expected values to be strictly equal:

113 !== 103

[Killed] LogicalOperator
src/utils/pricing.js:470:20
   }
 
   const discount = adjustments.discount || 0;
-  const shipping = adjustments.shipping || 0;
+  const shipping = adjustments.shipping && 0;
   const tax = adjustments.tax || 0;
 
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should calculate total with all adjustments
statusReason: Expected values to be strictly equal:

98 !== 103

[Killed] ConditionalExpression
src/utils/pricing.js:470:20
   }
 
   const discount = adjustments.discount || 0;
-  const shipping = adjustments.shipping || 0;
+  const shipping = true;
   const tax = adjustments.tax || 0;
 
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should calculate total with all adjustments
statusReason: Expected values to be strictly equal:

0 !== 103

[Killed] LogicalOperator
src/utils/pricing.js:471:15
 
   const discount = adjustments.discount || 0;
   const shipping = adjustments.shipping || 0;
-  const tax = adjustments.tax || 0;
+  const tax = adjustments.tax && 0;
 
   // Validate adjustments are numbers
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should calculate total with all adjustments
statusReason: Expected values to be strictly equal:

95 !== 103

[Killed] ConditionalExpression
src/utils/pricing.js:471:15
 
   const discount = adjustments.discount || 0;
   const shipping = adjustments.shipping || 0;
-  const tax = adjustments.tax || 0;
+  const tax = false;
 
   // Validate adjustments are numbers
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should calculate total with all adjustments
statusReason: Expected values to be strictly equal:

0 !== 103

[Killed] BlockStatement
src/utils/pricing.js:474:53
   const tax = adjustments.tax || 0;
 
   // Validate adjustments are numbers
-  if (typeof discount !== 'number' || discount < 0) {
-    return 0;
-  }
+  if (typeof discount !== 'number' || discount < 0) {}
 
   if (typeof shipping !== 'number' || shipping < 0) {
killedBy: Pricing Utils - Unit Tests calculateFinalTotal invalid inputs should return 0 for negative discount
statusReason: Expected values to be strictly equal:

110 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:474:39
   const tax = adjustments.tax || 0;
 
   // Validate adjustments are numbers
-  if (typeof discount !== 'number' || discount < 0) {
+  if (typeof discount !== 'number' || discount >= 0) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should calculate total with all adjustments
statusReason: Expected values to be strictly equal:

0 !== 103

[Killed] BlockStatement
src/utils/pricing.js:478:53
     return 0;
   }
 
-  if (typeof shipping !== 'number' || shipping < 0) {
-    return 0;
-  }
+  if (typeof shipping !== 'number' || shipping < 0) {}
 
   if (typeof tax !== 'number' || tax < 0) {
killedBy: Pricing Utils - Unit Tests calculateFinalTotal invalid inputs should return 0 for negative shipping
statusReason: Expected values to be strictly equal:

95 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:478:7
     return 0;
   }
 
-  if (typeof shipping !== 'number' || shipping < 0) {
+  if (typeof shipping === 'number' || shipping < 0) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should calculate total with all adjustments
statusReason: Expected values to be strictly equal:

0 !== 103

[Killed] BlockStatement
src/utils/pricing.js:482:43
     return 0;
   }
 
-  if (typeof tax !== 'number' || tax < 0) {
-    return 0;
-  }
+  if (typeof tax !== 'number' || tax < 0) {}
 
   if (typeof giftWrapCost !== 'number' || giftWrapCost < 0) {
killedBy: Pricing Utils - Unit Tests calculateFinalTotal invalid inputs should return 0 for negative tax
statusReason: Expected values to be strictly equal:

92 !== 0

[Killed] EqualityOperator
src/utils/pricing.js:482:7
     return 0;
   }
 
-  if (typeof tax !== 'number' || tax < 0) {
+  if (typeof tax === 'number' || tax < 0) {
     return 0;
   }
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should calculate total with all adjustments
statusReason: Expected values to be strictly equal:

0 !== 103

[Killed] EqualityOperator
src/utils/pricing.js:486:43
     return 0;
   }
 
-  if (typeof giftWrapCost !== 'number' || giftWrapCost < 0) {
+  if (typeof giftWrapCost !== 'number' || giftWrapCost >= 0) {
     giftWrapCost = 0;
   }
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should handle gift wrap cost
statusReason: Expected values to be strictly equal:

103 !== 108

[Killed] LogicalOperator
src/utils/pricing.js:486:7
     return 0;
   }
 
-  if (typeof giftWrapCost !== 'number' || giftWrapCost < 0) {
+  if (typeof giftWrapCost !== 'number' && giftWrapCost < 0) {
     giftWrapCost = 0;
   }
killedBy: Pricing Utils - Unit Tests calculateFinalTotal invalid inputs should set negative giftWrap to 0
statusReason: Expected values to be strictly equal:

95 !== 100

[Killed] ArithmeticOperator
src/utils/pricing.js:491:15
   }
 
   // Calculate total with nested operations
-  let total = subtotal - discount;
+  let total = subtotal + discount;
   
   if (total < 0) {
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should calculate total with all adjustments
statusReason: Expected values to be strictly equal:

123 !== 103

[Killed] BlockStatement
src/utils/pricing.js:493:18
   // Calculate total with nested operations
   let total = subtotal - discount;
   
-  if (total < 0) {
-    total = 0; // Cannot have negative total
-  }
+  if (total < 0) {}
 
   total = total + shipping + tax + giftWrapCost;
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should prevent negative total
statusReason: Expected values to be strictly equal:

-37 !== 13

[Killed] EqualityOperator
src/utils/pricing.js:493:7
   // Calculate total with nested operations
   let total = subtotal - discount;
   
-  if (total < 0) {
+  if (total >= 0) {
     total = 0; // Cannot have negative total
   }
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should calculate total with all adjustments
statusReason: Expected values to be strictly equal:

13 !== 103

[Killed] ArithmeticOperator
src/utils/pricing.js:497:11
     total = 0; // Cannot have negative total
   }
 
-  total = total + shipping + tax + giftWrapCost;
+  total = total + shipping + tax - giftWrapCost;
 
   return Math.round(total * 100) / 100;
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should handle gift wrap cost
statusReason: Expected values to be strictly equal:

98 !== 108

[Killed] ArithmeticOperator
src/utils/pricing.js:497:11
     total = 0; // Cannot have negative total
   }
 
-  total = total + shipping + tax + giftWrapCost;
+  total = total + shipping - tax + giftWrapCost;
 
   return Math.round(total * 100) / 100;
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should calculate total with all adjustments
statusReason: Expected values to be strictly equal:

87 !== 103

[Killed] ArithmeticOperator
src/utils/pricing.js:499:21
 
   total = total + shipping + tax + giftWrapCost;
 
-  return Math.round(total * 100) / 100;
+  return Math.round(total / 100) / 100;
 }
 
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should calculate total with all adjustments
statusReason: Expected values to be strictly equal:

0.01 !== 103

[Killed] ArithmeticOperator
src/utils/pricing.js:499:10
 
   total = total + shipping + tax + giftWrapCost;
 
-  return Math.round(total * 100) / 100;
+  return Math.round(total * 100) * 100;
 }
 
killedBy: Pricing Utils - Unit Tests calculateFinalTotal should calculate total with all adjustments
statusReason: Expected values to be strictly equal:

1030000 !== 103
