[NoCoverage] LogicalOperator
src/utils/validators.js:13:7
  */
 export function validateEmail(email) {
   // Multiple nested validations for edge cases
-  if (!email || typeof email !== 'string') {
+  if (!email && typeof email !== 'string') {
     return false;
   }

[NoCoverage] ConditionalExpression
src/utils/validators.js:13:7
  */
 export function validateEmail(email) {
   // Multiple nested validations for edge cases
-  if (!email || typeof email !== 'string') {
+  if (false) {
     return false;
   }

[NoCoverage] BooleanLiteral
src/utils/validators.js:14:12
 export function validateEmail(email) {
   // Multiple nested validations for edge cases
   if (!email || typeof email !== 'string') {
-    return false;
+    return true;
   }
 

[NoCoverage] MethodExpression
src/utils/validators.js:18:11
   }
 
   // Trim whitespace
-  email = email.trim();
+  email = email;
 
   // Check minimum length

[NoCoverage] ConditionalExpression
src/utils/validators.js:21:7
   email = email.trim();
 
   // Check minimum length
-  if (email.length < 5) {
+  if (false) {
     return false;
   }

[NoCoverage] EqualityOperator
src/utils/validators.js:21:7
   email = email.trim();
 
   // Check minimum length
-  if (email.length < 5) {
+  if (email.length >= 5) {
     return false;
   }

[NoCoverage] BooleanLiteral
src/utils/validators.js:22:12
 
   // Check minimum length
   if (email.length < 5) {
-    return false;
+    return true;
   }
 

[NoCoverage] BlockStatement
src/utils/validators.js:26:29
   }
 
   // Must contain @ symbol
-  if (!email.includes('@')) {
-    return false;
-  }
+  if (!email.includes('@')) {}
 
   // Split by @ and validate parts

[NoCoverage] ConditionalExpression
src/utils/validators.js:26:7
   }
 
   // Must contain @ symbol
-  if (!email.includes('@')) {
+  if (true) {
     return false;
   }

[NoCoverage] BooleanLiteral
src/utils/validators.js:27:12
 
   // Must contain @ symbol
   if (!email.includes('@')) {
-    return false;
+    return true;
   }
 

[NoCoverage] BlockStatement
src/utils/validators.js:33:27
   // Split by @ and validate parts
   const parts = email.split('@');
   
-  if (parts.length !== 2) {
-    return false; // Multiple @ symbols or none
-  }
+  if (parts.length !== 2) {}
 
   const [localPart, domainPart] = parts;

[NoCoverage] EqualityOperator
src/utils/validators.js:33:7
   // Split by @ and validate parts
   const parts = email.split('@');
   
-  if (parts.length !== 2) {
+  if (parts.length === 2) {
     return false; // Multiple @ symbols or none
   }

[NoCoverage] BooleanLiteral
src/utils/validators.js:34:12
   const parts = email.split('@');
   
   if (parts.length !== 2) {
-    return false; // Multiple @ symbols or none
+    return true; // Multiple @ symbols or none
   }
 

[NoCoverage] BlockStatement
src/utils/validators.js:40:56
   const [localPart, domainPart] = parts;
 
   // Validate local part
-  if (localPart.length === 0 || localPart.length > 64) {
-    return false;
-  }
+  if (localPart.length === 0 || localPart.length > 64) {}
 
   // Validate domain part

[NoCoverage] LogicalOperator
src/utils/validators.js:40:7
   const [localPart, domainPart] = parts;
 
   // Validate local part
-  if (localPart.length === 0 || localPart.length > 64) {
+  if (localPart.length === 0 && localPart.length > 64) {
     return false;
   }

[NoCoverage] BooleanLiteral
src/utils/validators.js:41:12
 
   // Validate local part
   if (localPart.length === 0 || localPart.length > 64) {
-    return false;
+    return true;
   }
 

[NoCoverage] BlockStatement
src/utils/validators.js:45:59
   }
 
   // Validate domain part
-  if (domainPart.length === 0 || domainPart.length > 255) {
-    return false;
-  }
+  if (domainPart.length === 0 || domainPart.length > 255) {}
 
   // Domain must have at least one dot

[NoCoverage] LogicalOperator
src/utils/validators.js:45:7
   }
 
   // Validate domain part
-  if (domainPart.length === 0 || domainPart.length > 255) {
+  if (domainPart.length === 0 && domainPart.length > 255) {
     return false;
   }

[NoCoverage] BooleanLiteral
src/utils/validators.js:46:12
 
   // Validate domain part
   if (domainPart.length === 0 || domainPart.length > 255) {
-    return false;
+    return true;
   }
 

[NoCoverage] ConditionalExpression
src/utils/validators.js:50:7
   }
 
   // Domain must have at least one dot
-  if (!domainPart.includes('.')) {
+  if (false) {
     return false;
   }

[NoCoverage] ConditionalExpression
src/utils/validators.js:50:7
   }
 
   // Domain must have at least one dot
-  if (!domainPart.includes('.')) {
+  if (true) {
     return false;
   }

[NoCoverage] BooleanLiteral
src/utils/validators.js:51:12
 
   // Domain must have at least one dot
   if (!domainPart.includes('.')) {
-    return false;
+    return true;
   }
 

[NoCoverage] ArithmeticOperator
src/utils/validators.js:56:33
 
   // Check domain extension
   const domainParts = domainPart.split('.');
-  const extension = domainParts[domainParts.length - 1];
+  const extension = domainParts[domainParts.length + 1];
   
   if (extension.length < 2) {

[NoCoverage] EqualityOperator
src/utils/validators.js:58:7
   const domainParts = domainPart.split('.');
   const extension = domainParts[domainParts.length - 1];
   
-  if (extension.length < 2) {
+  if (extension.length <= 2) {
     return false;
   }

[NoCoverage] ConditionalExpression
src/utils/validators.js:58:7
   const domainParts = domainPart.split('.');
   const extension = domainParts[domainParts.length - 1];
   
-  if (extension.length < 2) {
+  if (false) {
     return false;
   }

[NoCoverage] BooleanLiteral
src/utils/validators.js:59:12
   const extension = domainParts[domainParts.length - 1];
   
   if (extension.length < 2) {
-    return false;
+    return true;
   }
 

[Killed] BlockStatement
src/utils/validators.js:71:36
  * @param {string} isbn - ISBN to validate
  * @returns {boolean} true if valid ISBN
  */
-export function validateISBN(isbn) {
-  if (!isbn || typeof isbn !== 'string') {
-    return false;
-  }
-
-  // Remove hyphens and spaces
-  isbn = isbn.replace(/[-\s]/g, '');
-
-  // Check if contains only digits
-  if (!/^\d+$/.test(isbn)) {
-    return false;
-  }
-
-  // Validate based on length
-  if (isbn.length === 10) {
-    return validateISBN10(isbn);
-  } else if (isbn.length === 13) {
-    return validateISBN13(isbn);
-  } else {
-    return false;
-  }
-}
+export function validateISBN(isbn) {}
 
 /**
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-10
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] BooleanLiteral
src/utils/validators.js:72:7
  * @returns {boolean} true if valid ISBN
  */
 export function validateISBN(isbn) {
-  if (!isbn || typeof isbn !== 'string') {
+  if (isbn || typeof isbn !== 'string') {
     return false;
   }
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-10
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/validators.js:72:16
  * @returns {boolean} true if valid ISBN
  */
 export function validateISBN(isbn) {
-  if (!isbn || typeof isbn !== 'string') {
+  if (!isbn || typeof isbn === 'string') {
     return false;
   }
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-10
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:73:12
  */
 export function validateISBN(isbn) {
   if (!isbn || typeof isbn !== 'string') {
-    return false;
+    return true;
   }
 
killedBy: Validators Module - Unit Tests validateISBN should reject null or empty ISBN
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/utils/validators.js:80:7
   isbn = isbn.replace(/[-\s]/g, '');
 
   // Check if contains only digits
-  if (!/^\d+$/.test(isbn)) {
+  if (true) {
     return false;
   }
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-10
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:80:7
   isbn = isbn.replace(/[-\s]/g, '');
 
   // Check if contains only digits
-  if (!/^\d+$/.test(isbn)) {
+  if (/^\d+$/.test(isbn)) {
     return false;
   }
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-10
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:81:12
 
   // Check if contains only digits
   if (!/^\d+$/.test(isbn)) {
-    return false;
+    return true;
   }
 
killedBy: Validators Module - Unit Tests validateISBN should reject ISBN with non-digit characters
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/utils/validators.js:85:7
   }
 
   // Validate based on length
-  if (isbn.length === 10) {
+  if (false) {
     return validateISBN10(isbn);
   } else if (isbn.length === 13) {
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-10
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/validators.js:85:7
   }
 
   // Validate based on length
-  if (isbn.length === 10) {
+  if (isbn.length !== 10) {
     return validateISBN10(isbn);
   } else if (isbn.length === 13) {
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-10
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/validators.js:87:14
   // Validate based on length
   if (isbn.length === 10) {
     return validateISBN10(isbn);
-  } else if (isbn.length === 13) {
+  } else if (isbn.length !== 13) {
     return validateISBN13(isbn);
   } else {
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-13
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/validators.js:87:14
   // Validate based on length
   if (isbn.length === 10) {
     return validateISBN10(isbn);
-  } else if (isbn.length === 13) {
+  } else if (false) {
     return validateISBN13(isbn);
   } else {
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-13
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/utils/validators.js:89:10
     return validateISBN10(isbn);
   } else if (isbn.length === 13) {
     return validateISBN13(isbn);
-  } else {
-    return false;
-  }
+  } else {}
 }
 
killedBy: Validators Module - Unit Tests validateISBN should reject ISBN with invalid length
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] BlockStatement
src/utils/validators.js:99:31
  * @param {string} isbn - 10-digit ISBN
  * @returns {boolean} true if valid
  */
-function validateISBN10(isbn) {
-  let sum = 0;
-  
-  for (let i = 0; i < 10; i++) {
-    const digit = parseInt(isbn[i]);
-    sum += digit * (10 - i);
-  }
-
-  return sum % 11 === 0;
-}
+function validateISBN10(isbn) {}
 
 /**
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-10
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] EqualityOperator
src/utils/validators.js:102:19
 function validateISBN10(isbn) {
   let sum = 0;
   
-  for (let i = 0; i < 10; i++) {
+  for (let i = 0; i >= 10; i++) {
     const digit = parseInt(isbn[i]);
     sum += digit * (10 - i);
killedBy: Validators Module - Unit Tests validateISBN should reject ISBN with invalid checksum
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/utils/validators.js:102:19
 function validateISBN10(isbn) {
   let sum = 0;
   
-  for (let i = 0; i < 10; i++) {
+  for (let i = 0; false; i++) {
     const digit = parseInt(isbn[i]);
     sum += digit * (10 - i);
killedBy: Validators Module - Unit Tests validateISBN should reject ISBN with invalid checksum
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ArithmeticOperator
src/utils/validators.js:104:21
   
   for (let i = 0; i < 10; i++) {
     const digit = parseInt(isbn[i]);
-    sum += digit * (10 - i);
+    sum += digit * (10 + i);
   }
 
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-10
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ArithmeticOperator
src/utils/validators.js:104:12
   
   for (let i = 0; i < 10; i++) {
     const digit = parseInt(isbn[i]);
-    sum += digit * (10 - i);
+    sum += digit / (10 - i);
   }
 
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-10
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/validators.js:107:10
     sum += digit * (10 - i);
   }
 
-  return sum % 11 === 0;
+  return false;
 }
 
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-10
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/validators.js:107:10
     sum += digit * (10 - i);
   }
 
-  return sum % 11 === 0;
+  return sum % 11 !== 0;
 }
 
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-10
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/utils/validators.js:115:31
  * @param {string} isbn - 13-digit ISBN
  * @returns {boolean} true if valid
  */
-function validateISBN13(isbn) {
-  let sum = 0;
-  
-  for (let i = 0; i < 13; i++) {
-    const digit = parseInt(isbn[i]);
-    const multiplier = (i % 2 === 0) ? 1 : 3;
-    sum += digit * multiplier;
-  }
-
-  return sum % 10 === 0;
-}
+function validateISBN13(isbn) {}
 
 /**
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-13
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] EqualityOperator
src/utils/validators.js:118:19
 function validateISBN13(isbn) {
   let sum = 0;
   
-  for (let i = 0; i < 13; i++) {
+  for (let i = 0; i >= 13; i++) {
     const digit = parseInt(isbn[i]);
     const multiplier = (i % 2 === 0) ? 1 : 3;
killedBy: Validators Module - Unit Tests validateISBN should reject ISBN with invalid checksum
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/utils/validators.js:118:19
 function validateISBN13(isbn) {
   let sum = 0;
   
-  for (let i = 0; i < 13; i++) {
+  for (let i = 0; false; i++) {
     const digit = parseInt(isbn[i]);
     const multiplier = (i % 2 === 0) ? 1 : 3;
killedBy: Validators Module - Unit Tests validateISBN should reject ISBN with invalid checksum
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ArithmeticOperator
src/utils/validators.js:120:25
   
   for (let i = 0; i < 13; i++) {
     const digit = parseInt(isbn[i]);
-    const multiplier = (i % 2 === 0) ? 1 : 3;
+    const multiplier = (i * 2 === 0) ? 1 : 3;
     sum += digit * multiplier;
   }
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-13
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/validators.js:120:25
   
   for (let i = 0; i < 13; i++) {
     const digit = parseInt(isbn[i]);
-    const multiplier = (i % 2 === 0) ? 1 : 3;
+    const multiplier = (true) ? 1 : 3;
     sum += digit * multiplier;
   }
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-13
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ArithmeticOperator
src/utils/validators.js:121:12
   for (let i = 0; i < 13; i++) {
     const digit = parseInt(isbn[i]);
     const multiplier = (i % 2 === 0) ? 1 : 3;
-    sum += digit * multiplier;
+    sum += digit / multiplier;
   }
 
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-13
statusReason: Expected values to be strictly equal:

false !== true

[Survived] AssignmentOperator
src/utils/validators.js:121:5
   for (let i = 0; i < 13; i++) {
     const digit = parseInt(isbn[i]);
     const multiplier = (i % 2 === 0) ? 1 : 3;
-    sum += digit * multiplier;
+    sum -= digit * multiplier;
   }
 

[Killed] ConditionalExpression
src/utils/validators.js:124:10
     sum += digit * multiplier;
   }
 
-  return sum % 10 === 0;
+  return true;
 }
 
killedBy: Validators Module - Unit Tests validateISBN should reject ISBN with invalid checksum
statusReason: Expected values to be strictly equal:

true !== false

[Killed] EqualityOperator
src/utils/validators.js:124:10
     sum += digit * multiplier;
   }
 
-  return sum % 10 === 0;
+  return sum % 10 !== 0;
 }
 
killedBy: Validators Module - Unit Tests validateISBN should accept valid ISBN-13
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:134:45
  * @returns {object} Validation result {valid: boolean, error: string}
  */
 export function validatePrice(price, options = {}) {
-  const { min = 0, max = 10000, allowZero = false } = options;
+  const { min = 0, max = 10000, allowZero = true } = options;
 
   // Type checking with nested conditions
killedBy: Validators Module - Unit Tests validatePrice should reject zero price by default
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/utils/validators.js:137:7
   const { min = 0, max = 10000, allowZero = false } = options;
 
   // Type checking with nested conditions
-  if (typeof price !== 'number') {
+  if (false) {
     return { valid: false, error: 'Price must be a number' };
   }
killedBy: Validators Module - Unit Tests validatePrice should reject non-numeric prices
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/utils/validators.js:137:7
   const { min = 0, max = 10000, allowZero = false } = options;
 
   // Type checking with nested conditions
-  if (typeof price !== 'number') {
+  if (true) {
     return { valid: false, error: 'Price must be a number' };
   }
killedBy: Validators Module - Unit Tests validatePrice should accept valid positive prices
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:138:21
 
   // Type checking with nested conditions
   if (typeof price !== 'number') {
-    return { valid: false, error: 'Price must be a number' };
+    return { valid: true, error: 'Price must be a number' };
   }
 
killedBy: Validators Module - Unit Tests validatePrice should reject non-numeric prices
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/utils/validators.js:141:7
     return { valid: false, error: 'Price must be a number' };
   }
 
-  if (isNaN(price)) {
+  if (true) {
     return { valid: false, error: 'Price is not a valid number' };
   }
killedBy: Validators Module - Unit Tests validatePrice should accept valid positive prices
statusReason: Expected values to be strictly equal:

false !== true

[Survived] BlockStatement
src/utils/validators.js:141:21
     return { valid: false, error: 'Price must be a number' };
   }
 
-  if (isNaN(price)) {
-    return { valid: false, error: 'Price is not a valid number' };
-  }
+  if (isNaN(price)) {}
 
   if (!isFinite(price)) {

[Killed] BooleanLiteral
src/utils/validators.js:142:21
   }
 
   if (isNaN(price)) {
-    return { valid: false, error: 'Price is not a valid number' };
+    return { valid: true, error: 'Price is not a valid number' };
   }
 
killedBy: Validators Module - Unit Tests validatePrice should reject non-numeric prices
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ObjectLiteral
src/utils/validators.js:142:12
   }
 
   if (isNaN(price)) {
-    return { valid: false, error: 'Price is not a valid number' };
+    return {};
   }
 
killedBy: Validators Module - Unit Tests validatePrice should reject non-numeric prices
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] ConditionalExpression
src/utils/validators.js:145:7
     return { valid: false, error: 'Price is not a valid number' };
   }
 
-  if (!isFinite(price)) {
+  if (true) {
     return { valid: false, error: 'Price must be finite' };
   }
killedBy: Validators Module - Unit Tests validatePrice should accept valid positive prices
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:145:7
     return { valid: false, error: 'Price is not a valid number' };
   }
 
-  if (!isFinite(price)) {
+  if (isFinite(price)) {
     return { valid: false, error: 'Price must be finite' };
   }
killedBy: Validators Module - Unit Tests validatePrice should accept valid positive prices
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:146:21
   }
 
   if (!isFinite(price)) {
-    return { valid: false, error: 'Price must be finite' };
+    return { valid: true, error: 'Price must be finite' };
   }
 
killedBy: Validators Module - Unit Tests validatePrice should reject non-numeric prices
statusReason: Expected values to be strictly equal:

true !== false

[Killed] EqualityOperator
src/utils/validators.js:150:7
   }
 
   // Check if zero is allowed
-  if (price === 0) {
+  if (price !== 0) {
     if (allowZero) {
       return { valid: true, error: null };
killedBy: Validators Module - Unit Tests validatePrice should accept valid positive prices
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/validators.js:150:7
   }
 
   // Check if zero is allowed
-  if (price === 0) {
+  if (true) {
     if (allowZero) {
       return { valid: true, error: null };
killedBy: Validators Module - Unit Tests validatePrice should accept valid positive prices
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/validators.js:151:9
 
   // Check if zero is allowed
   if (price === 0) {
-    if (allowZero) {
+    if (false) {
       return { valid: true, error: null };
     } else {
killedBy: Validators Module - Unit Tests validatePrice should accept zero price when allowZero option is true
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/validators.js:151:9
 
   // Check if zero is allowed
   if (price === 0) {
-    if (allowZero) {
+    if (true) {
       return { valid: true, error: null };
     } else {
killedBy: Validators Module - Unit Tests validatePrice should reject zero price by default
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/utils/validators.js:152:23
   // Check if zero is allowed
   if (price === 0) {
     if (allowZero) {
-      return { valid: true, error: null };
+      return { valid: false, error: null };
     } else {
       return { valid: false, error: 'Price cannot be zero' };
killedBy: Validators Module - Unit Tests validatePrice should accept zero price when allowZero option is true
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ObjectLiteral
src/utils/validators.js:152:14
   // Check if zero is allowed
   if (price === 0) {
     if (allowZero) {
-      return { valid: true, error: null };
+      return {};
     } else {
       return { valid: false, error: 'Price cannot be zero' };
killedBy: Validators Module - Unit Tests validatePrice should accept zero price when allowZero option is true
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] BlockStatement
src/utils/validators.js:153:12
   if (price === 0) {
     if (allowZero) {
       return { valid: true, error: null };
-    } else {
-      return { valid: false, error: 'Price cannot be zero' };
-    }
+    } else {}
   }
 
killedBy: Validators Module - Unit Tests validatePrice should reject zero price by default
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/utils/validators.js:154:23
     if (allowZero) {
       return { valid: true, error: null };
     } else {
-      return { valid: false, error: 'Price cannot be zero' };
+      return { valid: true, error: 'Price cannot be zero' };
     }
   }
killedBy: Validators Module - Unit Tests validatePrice should reject zero price by default
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/utils/validators.js:159:7
   }
 
   // Check negative values
-  if (price < 0) {
+  if (true) {
     return { valid: false, error: 'Price cannot be negative' };
   }
killedBy: Validators Module - Unit Tests validatePrice should accept valid positive prices
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/validators.js:159:7
   }
 
   // Check negative values
-  if (price < 0) {
+  if (price >= 0) {
     return { valid: false, error: 'Price cannot be negative' };
   }
killedBy: Validators Module - Unit Tests validatePrice should accept valid positive prices
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:160:21
 
   // Check negative values
   if (price < 0) {
-    return { valid: false, error: 'Price cannot be negative' };
+    return { valid: true, error: 'Price cannot be negative' };
   }
 
killedBy: Validators Module - Unit Tests validatePrice should reject negative prices
statusReason: Expected values to be strictly equal:

true !== false

[Killed] EqualityOperator
src/utils/validators.js:164:7
   }
 
   // Check minimum
-  if (price < min) {
+  if (price >= min) {
     return { valid: false, error: `Price must be at least ${min}` };
   }
killedBy: Validators Module - Unit Tests validatePrice should accept valid positive prices
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/validators.js:164:7
   }
 
   // Check minimum
-  if (price < min) {
+  if (price <= min) {
     return { valid: false, error: `Price must be at least ${min}` };
   }
killedBy: Validators Module - Unit Tests validatePrice should enforce minimum price when specified
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:165:21
 
   // Check minimum
   if (price < min) {
-    return { valid: false, error: `Price must be at least ${min}` };
+    return { valid: true, error: `Price must be at least ${min}` };
   }
 
killedBy: Validators Module - Unit Tests validatePrice should enforce minimum price when specified
statusReason: Expected values to be strictly equal:

true !== false

[Killed] EqualityOperator
src/utils/validators.js:169:7
   }
 
   // Check maximum
-  if (price > max) {
+  if (price <= max) {
     return { valid: false, error: `Price cannot exceed ${max}` };
   }
killedBy: Validators Module - Unit Tests validatePrice should accept valid positive prices
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/validators.js:169:7
   }
 
   // Check maximum
-  if (price > max) {
+  if (price >= max) {
     return { valid: false, error: `Price cannot exceed ${max}` };
   }
killedBy: Validators Module - Unit Tests validatePrice should enforce maximum price when specified
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:170:21
 
   // Check maximum
   if (price > max) {
-    return { valid: false, error: `Price cannot exceed ${max}` };
+    return { valid: true, error: `Price cannot exceed ${max}` };
   }
 
killedBy: Validators Module - Unit Tests validatePrice should enforce maximum price when specified
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ObjectLiteral
src/utils/validators.js:170:12
 
   // Check maximum
   if (price > max) {
-    return { valid: false, error: `Price cannot exceed ${max}` };
+    return {};
   }
 
killedBy: Validators Module - Unit Tests validatePrice should enforce maximum price when specified
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] BooleanLiteral
src/utils/validators.js:183:48
  * @returns {object} Validation result
  */
 export function validateQuantity(quantity, options = {}) {
-  const { min = 1, max = 1000, mustBeInteger = true } = options;
+  const { min = 1, max = 1000, mustBeInteger = false } = options;
 
   if (typeof quantity !== 'number') {
killedBy: InventoryService - Unit Tests restockProduct should handle boundary case of restocking to exactly max
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/validators.js:185:7
 export function validateQuantity(quantity, options = {}) {
   const { min = 1, max = 1000, mustBeInteger = true } = options;
 
-  if (typeof quantity !== 'number') {
+  if (true) {
     return { valid: false, error: 'Quantity must be a number' };
   }
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Expected values to be strictly equal:

false !== true
