[Killed] ConditionalExpression
src/utils/validators.js:185:7
 export function validateQuantity(quantity, options = {}) {
   const { min = 1, max = 1000, mustBeInteger = true } = options;
 
-  if (typeof quantity !== 'number') {
+  if (false) {
     return { valid: false, error: 'Quantity must be a number' };
   }
killedBy: InventoryService - Unit Tests restockProduct should fail when product already at max stock with autoAdjust
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/utils/validators.js:186:21
   const { min = 1, max = 1000, mustBeInteger = true } = options;
 
   if (typeof quantity !== 'number') {
-    return { valid: false, error: 'Quantity must be a number' };
+    return { valid: true, error: 'Quantity must be a number' };
   }
 
killedBy: Validators Module - Unit Tests validateQuantity should reject null or undefined quantities
statusReason: Expected values to be strictly equal:

true !== false

[Killed] LogicalOperator
src/utils/validators.js:189:7
     return { valid: false, error: 'Quantity must be a number' };
   }
 
-  if (isNaN(quantity) || !isFinite(quantity)) {
+  if (isNaN(quantity) && !isFinite(quantity)) {
     return { valid: false, error: 'Quantity is invalid' };
   }
killedBy: InventoryService - Unit Tests restockProduct should fail when product already at max stock with autoAdjust
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/utils/validators.js:189:7
     return { valid: false, error: 'Quantity must be a number' };
   }
 
-  if (isNaN(quantity) || !isFinite(quantity)) {
+  if (true) {
     return { valid: false, error: 'Quantity is invalid' };
   }
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:190:21
   }
 
   if (isNaN(quantity) || !isFinite(quantity)) {
-    return { valid: false, error: 'Quantity is invalid' };
+    return { valid: true, error: 'Quantity is invalid' };
   }
 
killedBy: Validators Module - Unit Tests validateQuantity should reject non-numeric quantities
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ObjectLiteral
src/utils/validators.js:190:12
   }
 
   if (isNaN(quantity) || !isFinite(quantity)) {
-    return { valid: false, error: 'Quantity is invalid' };
+    return {};
   }
 
killedBy: Validators Module - Unit Tests validateQuantity should reject non-numeric quantities
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] LogicalOperator
src/utils/validators.js:194:7
   }
 
   // Check if must be integer
-  if (mustBeInteger && !Number.isInteger(quantity)) {
+  if (mustBeInteger || !Number.isInteger(quantity)) {
     return { valid: false, error: 'Quantity must be a whole number' };
   }
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:194:24
   }
 
   // Check if must be integer
-  if (mustBeInteger && !Number.isInteger(quantity)) {
+  if (mustBeInteger && Number.isInteger(quantity)) {
     return { valid: false, error: 'Quantity must be a whole number' };
   }
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:195:21
 
   // Check if must be integer
   if (mustBeInteger && !Number.isInteger(quantity)) {
-    return { valid: false, error: 'Quantity must be a whole number' };
+    return { valid: true, error: 'Quantity must be a whole number' };
   }
 
killedBy: Validators Module - Unit Tests validateQuantity should reject non-integer quantities
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ObjectLiteral
src/utils/validators.js:195:12
 
   // Check if must be integer
   if (mustBeInteger && !Number.isInteger(quantity)) {
-    return { valid: false, error: 'Quantity must be a whole number' };
+    return {};
   }
 
killedBy: Validators Module - Unit Tests validateQuantity should reject non-integer quantities
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] ConditionalExpression
src/utils/validators.js:199:7
   }
 
   // Range validation with nested conditions
-  if (quantity < min) {
+  if (false) {
     return { valid: false, error: `Quantity must be at least ${min}` };
   }
killedBy: InventoryService - Unit Tests reserveStock should fail when quantity is invalid
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.message.includes('Quantity'))

[Killed] EqualityOperator
src/utils/validators.js:199:7
   }
 
   // Range validation with nested conditions
-  if (quantity < min) {
+  if (quantity >= min) {
     return { valid: false, error: `Quantity must be at least ${min}` };
   }
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:200:21
 
   // Range validation with nested conditions
   if (quantity < min) {
-    return { valid: false, error: `Quantity must be at least ${min}` };
+    return { valid: true, error: `Quantity must be at least ${min}` };
   }
 
killedBy: InventoryService - Unit Tests reserveStock should fail when quantity is invalid
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.message.includes('Quantity'))

[Killed] ConditionalExpression
src/utils/validators.js:203:7
     return { valid: false, error: `Quantity must be at least ${min}` };
   }
 
-  if (quantity > max) {
+  if (false) {
     return { valid: false, error: `Quantity cannot exceed ${max}` };
   }
killedBy: InventoryService - Unit Tests reserveStock should log transaction on successful reserve
statusReason: Expected values to be strictly equal:

0 !== 1

[Killed] ConditionalExpression
src/utils/validators.js:203:7
     return { valid: false, error: `Quantity must be at least ${min}` };
   }
 
-  if (quantity > max) {
+  if (true) {
     return { valid: false, error: `Quantity cannot exceed ${max}` };
   }
killedBy: InventoryService - Unit Tests reserveStock should successfully reserve stock when available
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:204:21
   }
 
   if (quantity > max) {
-    return { valid: false, error: `Quantity cannot exceed ${max}` };
+    return { valid: true, error: `Quantity cannot exceed ${max}` };
   }
 
killedBy: Validators Module - Unit Tests validateQuantity should enforce maximum quantity when specified
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/utils/validators.js:216:7
  * @returns {boolean} true if valid category
  */
 export function validateCategory(category) {
-  if (!category || typeof category !== 'string') {
+  if (false) {
     return false;
   }
killedBy: Validators Module - Unit Tests validateCategory should reject empty or null categories
statusReason: Cannot read properties of null (reading 'toLowerCase')

[Killed] BooleanLiteral
src/utils/validators.js:216:7
  * @returns {boolean} true if valid category
  */
 export function validateCategory(category) {
-  if (!category || typeof category !== 'string') {
+  if (category || typeof category !== 'string') {
     return false;
   }
killedBy: CatalogService - Unit Tests filterProducts should filter by category
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'Non-Fiction'
- 'Fiction'

[Killed] BooleanLiteral
src/utils/validators.js:217:12
  */
 export function validateCategory(category) {
   if (!category || typeof category !== 'string') {
-    return false;
+    return true;
   }
 
killedBy: Validators Module - Unit Tests validateCategory should reject empty or null categories
statusReason: Expected values to be strictly equal:

true !== false

[Killed] MethodExpression
src/utils/validators.js:237:30
     'education'
   ];
 
-  const normalizedCategory = category.toLowerCase().trim();
+  const normalizedCategory = category.toUpperCase().trim();
 
   return validCategories.includes(normalizedCategory);
killedBy: CatalogService - Unit Tests filterProducts should filter by category
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'Non-Fiction'
- 'Fiction'

[Killed] MethodExpression
src/utils/validators.js:237:30
     'education'
   ];
 
-  const normalizedCategory = category.toLowerCase().trim();
+  const normalizedCategory = category.toLowerCase();
 
   return validCategories.includes(normalizedCategory);
killedBy: Validators Module - Unit Tests validateCategory should accept categories with whitespace
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/utils/validators.js:251:48
   const errors = [];
 
   // Check if address object exists
-  if (!address || typeof address !== 'object') {
-    return { valid: false, errors: ['Address is required'] };
-  }
+  if (!address || typeof address !== 'object') {}
 
   // Validate street
killedBy: Validators Module - Unit Tests validateAddress should reject null address
statusReason: Cannot read properties of null (reading 'street')

[Killed] EqualityOperator
src/utils/validators.js:251:19
   const errors = [];
 
   // Check if address object exists
-  if (!address || typeof address !== 'object') {
+  if (!address || typeof address === 'object') {
     return { valid: false, errors: ['Address is required'] };
   }
killedBy: Validators Module - Unit Tests validateAddress should accept valid address
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:252:21
 
   // Check if address object exists
   if (!address || typeof address !== 'object') {
-    return { valid: false, errors: ['Address is required'] };
+    return { valid: true, errors: ['Address is required'] };
   }
 
killedBy: Validators Module - Unit Tests validateAddress should reject null address
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BlockStatement
src/utils/validators.js:256:94
   }
 
   // Validate street
-  if (!address.street || typeof address.street !== 'string' || address.street.trim() === '') {
-    errors.push('street');
-  } else if (address.street.trim().length < 5) {
+  if (!address.street || typeof address.street !== 'string' || address.street.trim() === '') {} else if (address.street.trim().length < 5) {
     errors.push('street');
   } else if (address.street.length > 200) {
killedBy: Validators Module - Unit Tests validateAddress street validation should reject missing street
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.errors.includes('street'))

[Killed] ConditionalExpression
src/utils/validators.js:256:7
   }
 
   // Validate street
-  if (!address.street || typeof address.street !== 'string' || address.street.trim() === '') {
+  if (true) {
     errors.push('street');
   } else if (address.street.trim().length < 5) {
killedBy: Validators Module - Unit Tests validateAddress should accept valid address
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/validators.js:258:14
   // Validate street
   if (!address.street || typeof address.street !== 'string' || address.street.trim() === '') {
     errors.push('street');
-  } else if (address.street.trim().length < 5) {
+  } else if (address.street.trim().length <= 5) {
     errors.push('street');
   } else if (address.street.length > 200) {
killedBy: Validators Module - Unit Tests validateAddress street validation should accept street at minimum length (5 chars)
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/utils/validators.js:258:48
   // Validate street
   if (!address.street || typeof address.street !== 'string' || address.street.trim() === '') {
     errors.push('street');
-  } else if (address.street.trim().length < 5) {
-    errors.push('street');
-  } else if (address.street.length > 200) {
+  } else if (address.street.trim().length < 5) {} else if (address.street.length > 200) {
     errors.push('street');
   }
killedBy: Validators Module - Unit Tests validateAddress street validation should reject too short street (4 chars)
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.errors.includes('street'))

[Killed] EqualityOperator
src/utils/validators.js:260:14
     errors.push('street');
   } else if (address.street.trim().length < 5) {
     errors.push('street');
-  } else if (address.street.length > 200) {
+  } else if (address.street.length <= 200) {
     errors.push('street');
   }
killedBy: Validators Module - Unit Tests validateAddress should accept valid address
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/validators.js:260:14
     errors.push('street');
   } else if (address.street.trim().length < 5) {
     errors.push('street');
-  } else if (address.street.length > 200) {
+  } else if (address.street.length >= 200) {
     errors.push('street');
   }
killedBy: Validators Module - Unit Tests validateAddress street validation should accept street at maximum length (200 chars)
statusReason: Expected values to be strictly equal:

false !== true

[Killed] LogicalOperator
src/utils/validators.js:265:7
   }
 
   // Validate city
-  if (!address.city || typeof address.city !== 'string' || address.city.trim() === '') {
+  if ((!address.city || typeof address.city !== 'string') && address.city.trim() === '') {
     errors.push('city');
   } else if (address.city.trim().length < 2) {
killedBy: Validators Module - Unit Tests validateAddress city validation should reject missing city
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] EqualityOperator
src/utils/validators.js:265:60
   }
 
   // Validate city
-  if (!address.city || typeof address.city !== 'string' || address.city.trim() === '') {
+  if (!address.city || typeof address.city !== 'string' || address.city.trim() !== '') {
     errors.push('city');
   } else if (address.city.trim().length < 2) {
killedBy: Validators Module - Unit Tests validateAddress should accept valid address
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/validators.js:267:14
   // Validate city
   if (!address.city || typeof address.city !== 'string' || address.city.trim() === '') {
     errors.push('city');
-  } else if (address.city.trim().length < 2) {
+  } else if (true) {
     errors.push('city');
   } else if (address.city.length > 100) {
killedBy: Validators Module - Unit Tests validateAddress should accept valid address
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/validators.js:267:14
   // Validate city
   if (!address.city || typeof address.city !== 'string' || address.city.trim() === '') {
     errors.push('city');
-  } else if (address.city.trim().length < 2) {
+  } else if (false) {
     errors.push('city');
   } else if (address.city.length > 100) {
killedBy: Validators Module - Unit Tests validateAddress city validation should reject too short city (1 char)
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.errors.includes('city'))

[Killed] ConditionalExpression
src/utils/validators.js:269:14
     errors.push('city');
   } else if (address.city.trim().length < 2) {
     errors.push('city');
-  } else if (address.city.length > 100) {
+  } else if (false) {
     errors.push('city');
   }
killedBy: Validators Module - Unit Tests validateAddress city validation should reject too long city (101 chars)
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.errors.includes('city'))

[Killed] EqualityOperator
src/utils/validators.js:269:14
     errors.push('city');
   } else if (address.city.trim().length < 2) {
     errors.push('city');
-  } else if (address.city.length > 100) {
+  } else if (address.city.length <= 100) {
     errors.push('city');
   }
killedBy: Validators Module - Unit Tests validateAddress should accept valid address
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/validators.js:274:7
   }
 
   // Validate ZIP code
-  if (!address.zip || typeof address.zip !== 'string' || address.zip.trim() === '') {
+  if (true) {
     errors.push('zip');
   } else {
killedBy: Validators Module - Unit Tests validateAddress should accept valid address
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/utils/validators.js:274:85
   }
 
   // Validate ZIP code
-  if (!address.zip || typeof address.zip !== 'string' || address.zip.trim() === '') {
-    errors.push('zip');
-  } else {
+  if (!address.zip || typeof address.zip !== 'string' || address.zip.trim() === '') {} else {
     const zip = address.zip.trim();
     
killedBy: Validators Module - Unit Tests validateAddress zip validation should reject missing zip
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.errors.includes('zip'))

[Killed] BlockStatement
src/utils/validators.js:276:10
   // Validate ZIP code
   if (!address.zip || typeof address.zip !== 'string' || address.zip.trim() === '') {
     errors.push('zip');
-  } else {
-    const zip = address.zip.trim();
-    
-    if (zip.length < 5) {
-      errors.push('zip');
-    } else if (zip.length > 10) {
-      errors.push('zip');
-    } else if (!/^[\d\-\s]+$/.test(zip)) {
-      errors.push('zip');
-    }
-  }
+  } else {}
 
   // Validate country
killedBy: Validators Module - Unit Tests validateAddress zip validation should reject too short zip (4 chars)
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.errors.includes('zip'))

[Survived] MethodExpression
src/utils/validators.js:277:17
   if (!address.zip || typeof address.zip !== 'string' || address.zip.trim() === '') {
     errors.push('zip');
   } else {
-    const zip = address.zip.trim();
+    const zip = address.zip;
     
     if (zip.length < 5) {

[Killed] BlockStatement
src/utils/validators.js:279:25
   } else {
     const zip = address.zip.trim();
     
-    if (zip.length < 5) {
-      errors.push('zip');
-    } else if (zip.length > 10) {
+    if (zip.length < 5) {} else if (zip.length > 10) {
       errors.push('zip');
     } else if (!/^[\d\-\s]+$/.test(zip)) {
killedBy: Validators Module - Unit Tests validateAddress zip validation should reject too short zip (4 chars)
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.errors.includes('zip'))

[Killed] ConditionalExpression
src/utils/validators.js:279:9
   } else {
     const zip = address.zip.trim();
     
-    if (zip.length < 5) {
+    if (true) {
       errors.push('zip');
     } else if (zip.length > 10) {
killedBy: Validators Module - Unit Tests validateAddress should accept valid address
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/validators.js:281:16
     
     if (zip.length < 5) {
       errors.push('zip');
-    } else if (zip.length > 10) {
+    } else if (zip.length >= 10) {
       errors.push('zip');
     } else if (!/^[\d\-\s]+$/.test(zip)) {
killedBy: Validators Module - Unit Tests validateAddress zip validation should accept zip at maximum length (10 chars)
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/validators.js:281:16
     
     if (zip.length < 5) {
       errors.push('zip');
-    } else if (zip.length > 10) {
+    } else if (zip.length <= 10) {
       errors.push('zip');
     } else if (!/^[\d\-\s]+$/.test(zip)) {
killedBy: Validators Module - Unit Tests validateAddress should accept valid address
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:283:16
       errors.push('zip');
     } else if (zip.length > 10) {
       errors.push('zip');
-    } else if (!/^[\d\-\s]+$/.test(zip)) {
+    } else if (/^[\d\-\s]+$/.test(zip)) {
       errors.push('zip');
     }
killedBy: Validators Module - Unit Tests validateAddress should accept valid address
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/utils/validators.js:283:42
       errors.push('zip');
     } else if (zip.length > 10) {
       errors.push('zip');
-    } else if (!/^[\d\-\s]+$/.test(zip)) {
-      errors.push('zip');
-    }
+    } else if (!/^[\d\-\s]+$/.test(zip)) {}
   }
 
killedBy: Validators Module - Unit Tests validateAddress zip validation should reject zip with invalid characters
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.errors.includes('zip'))

[Killed] EqualityOperator
src/utils/validators.js:289:27
   }
 
   // Validate country
-  if (!address.country || typeof address.country !== 'string' || address.country.trim() === '') {
+  if (!address.country || typeof address.country === 'string' || address.country.trim() === '') {
     errors.push('country');
   } else if (address.country.trim().length < 2) {
killedBy: Validators Module - Unit Tests validateAddress should accept valid address
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/utils/validators.js:289:97
   }
 
   // Validate country
-  if (!address.country || typeof address.country !== 'string' || address.country.trim() === '') {
-    errors.push('country');
-  } else if (address.country.trim().length < 2) {
+  if (!address.country || typeof address.country !== 'string' || address.country.trim() === '') {} else if (address.country.trim().length < 2) {
     errors.push('country');
   }
killedBy: Validators Module - Unit Tests validateAddress country validation should reject missing country
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.errors.includes('country'))

[Killed] BlockStatement
src/utils/validators.js:291:49
   // Validate country
   if (!address.country || typeof address.country !== 'string' || address.country.trim() === '') {
     errors.push('country');
-  } else if (address.country.trim().length < 2) {
-    errors.push('country');
-  }
+  } else if (address.country.trim().length < 2) {}
 
   return {
killedBy: Validators Module - Unit Tests validateAddress country validation should reject too short country (1 char)
statusReason: The expression evaluated to a falsy value:

  assert.ok(result.errors.includes('country'))

[Killed] ConditionalExpression
src/utils/validators.js:291:14
   // Validate country
   if (!address.country || typeof address.country !== 'string' || address.country.trim() === '') {
     errors.push('country');
-  } else if (address.country.trim().length < 2) {
+  } else if (true) {
     errors.push('country');
   }
killedBy: Validators Module - Unit Tests validateAddress should accept valid address
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:308:63
  * @returns {object} Validation result
  */
 export function validateSearchQuery(query, options = {}) {
-  const { minLength = 0, maxLength = 100, allowSpecialChars = false } = options;
+  const { minLength = 0, maxLength = 100, allowSpecialChars = true } = options;
 
   // if (!query || typeof query !== 'string') {
killedBy: Validators Module - Unit Tests validateSearchQuery should reject empty string even with minLength 0
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BlockStatement
src/utils/validators.js:311:34
   const { minLength = 0, maxLength = 100, allowSpecialChars = false } = options;
 
   // if (!query || typeof query !== 'string') {
-  if (typeof query !== 'string') {
-    return { valid: false, error: 'Search query is required' };
-  }
+  if (typeof query !== 'string') {}
 
   const trimmedQuery = query.trim();
killedBy: Validators Module - Unit Tests validateSearchQuery should reject non-string queries
statusReason: query.trim is not a function

[Killed] ConditionalExpression
src/utils/validators.js:311:7
   const { minLength = 0, maxLength = 100, allowSpecialChars = false } = options;
 
   // if (!query || typeof query !== 'string') {
-  if (typeof query !== 'string') {
+  if (true) {
     return { valid: false, error: 'Search query is required' };
   }
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] BooleanLiteral
src/utils/validators.js:312:21
 
   // if (!query || typeof query !== 'string') {
   if (typeof query !== 'string') {
-    return { valid: false, error: 'Search query is required' };
+    return { valid: true, error: 'Search query is required' };
   }
 
killedBy: Validators Module - Unit Tests validateSearchQuery should reject non-string queries
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/utils/validators.js:318:7
   const trimmedQuery = query.trim();
 
   // Length validation with nested conditions
-  if (trimmedQuery.length < minLength) {
+  if (true) {
     return { valid: false, error: `Query must be at least ${minLength} characters` };
   }
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] EqualityOperator
src/utils/validators.js:318:7
   const trimmedQuery = query.trim();
 
   // Length validation with nested conditions
-  if (trimmedQuery.length < minLength) {
+  if (trimmedQuery.length >= minLength) {
     return { valid: false, error: `Query must be at least ${minLength} characters` };
   }
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] BooleanLiteral
src/utils/validators.js:319:21
 
   // Length validation with nested conditions
   if (trimmedQuery.length < minLength) {
-    return { valid: false, error: `Query must be at least ${minLength} characters` };
+    return { valid: true, error: `Query must be at least ${minLength} characters` };
   }
 
killedBy: Validators Module - Unit Tests validateSearchQuery should reject queries below minimum length
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ObjectLiteral
src/utils/validators.js:319:12
 
   // Length validation with nested conditions
   if (trimmedQuery.length < minLength) {
-    return { valid: false, error: `Query must be at least ${minLength} characters` };
+    return {};
   }
 
killedBy: Validators Module - Unit Tests validateSearchQuery should reject queries below minimum length
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] EqualityOperator
src/utils/validators.js:322:7
     return { valid: false, error: `Query must be at least ${minLength} characters` };
   }
 
-  if (trimmedQuery.length > maxLength) {
+  if (trimmedQuery.length >= maxLength) {
     return { valid: false, error: `Query cannot exceed ${maxLength} characters` };
   }
killedBy: Validators Module - Unit Tests validateSearchQuery should accept queries at maximum length boundary
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/validators.js:322:7
     return { valid: false, error: `Query must be at least ${minLength} characters` };
   }
 
-  if (trimmedQuery.length > maxLength) {
+  if (trimmedQuery.length <= maxLength) {
     return { valid: false, error: `Query cannot exceed ${maxLength} characters` };
   }
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] BooleanLiteral
src/utils/validators.js:323:21
   }
 
   if (trimmedQuery.length > maxLength) {
-    return { valid: false, error: `Query cannot exceed ${maxLength} characters` };
+    return { valid: true, error: `Query cannot exceed ${maxLength} characters` };
   }
 
killedBy: Validators Module - Unit Tests validateSearchQuery should reject queries exceeding maximum length
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/utils/validators.js:327:7
   }
 
   // Check for special characters if not allowed
-  if (!allowSpecialChars) {
+  if (false) {
     // Allow only alphanumeric, spaces, and basic punctuation
     if (!/^[a-zA-Z0-9\s\-,.'"]+$/.test(trimmedQuery)) {
killedBy: Validators Module - Unit Tests validateSearchQuery should reject empty string even with minLength 0
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/utils/validators.js:327:7
   }
 
   // Check for special characters if not allowed
-  if (!allowSpecialChars) {
+  if (allowSpecialChars) {
     // Allow only alphanumeric, spaces, and basic punctuation
     if (!/^[a-zA-Z0-9\s\-,.'"]+$/.test(trimmedQuery)) {
killedBy: Validators Module - Unit Tests validateSearchQuery should reject empty string even with minLength 0
statusReason: Expected values to be strictly equal:

true !== false
