[Killed] ConditionalExpression
src/utils/validators.js:329:9
   // Check for special characters if not allowed
   if (!allowSpecialChars) {
     // Allow only alphanumeric, spaces, and basic punctuation
-    if (!/^[a-zA-Z0-9\s\-,.'"]+$/.test(trimmedQuery)) {
+    if (true) {
       return { valid: false, error: 'Query contains invalid characters' };
     }
killedBy: CatalogService - Unit Tests searchProducts should find products matching author
statusReason: The expression evaluated to a falsy value:

  assert.ok(results.length > 0)

[Killed] ConditionalExpression
src/utils/validators.js:329:9
   // Check for special characters if not allowed
   if (!allowSpecialChars) {
     // Allow only alphanumeric, spaces, and basic punctuation
-    if (!/^[a-zA-Z0-9\s\-,.'"]+$/.test(trimmedQuery)) {
+    if (false) {
       return { valid: false, error: 'Query contains invalid characters' };
     }
killedBy: Validators Module - Unit Tests validateSearchQuery should reject empty string even with minLength 0
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/utils/validators.js:330:23
   if (!allowSpecialChars) {
     // Allow only alphanumeric, spaces, and basic punctuation
     if (!/^[a-zA-Z0-9\s\-,.'"]+$/.test(trimmedQuery)) {
-      return { valid: false, error: 'Query contains invalid characters' };
+      return { valid: true, error: 'Query contains invalid characters' };
     }
   }
killedBy: Validators Module - Unit Tests validateSearchQuery should reject empty string even with minLength 0
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BlockStatement
src/utils/validators.js:342:44
  * @param {string} code - Discount code to validate
  * @returns {object} Validation result
  */
-export function validateDiscountCode(code) {
-  if (!code || typeof code !== 'string') {
-    return { valid: false, error: 'Discount code is required' };
-  }
-
-  const trimmedCode = code.trim().toUpperCase();
-
-  // Length validation
-  if (trimmedCode.length < 4) {
-    return { valid: false, error: 'Discount code is too short' };
-  }
-
-  if (trimmedCode.length > 20) {
-    return { valid: false, error: 'Discount code is too long' };
-  }
-
-  // Format validation (alphanumeric and hyphens only)
-  if (!/^[A-Z0-9\-]+$/.test(trimmedCode)) {
-    return { valid: false, error: 'Discount code contains invalid characters' };
-  }
-
-  return { valid: true, error: null, code: trimmedCode };
-}
+export function validateDiscountCode(code) {}
 
 /**
killedBy: Validators Module - Unit Tests validateDiscountCode should accept valid discount codes
statusReason: Cannot read properties of undefined (reading 'valid')

[Killed] ConditionalExpression
src/utils/validators.js:343:7
  * @returns {object} Validation result
  */
 export function validateDiscountCode(code) {
-  if (!code || typeof code !== 'string') {
+  if (false) {
     return { valid: false, error: 'Discount code is required' };
   }
killedBy: Validators Module - Unit Tests validateDiscountCode should reject null codes
statusReason: Cannot read properties of null (reading 'trim')

[Killed] BlockStatement
src/utils/validators.js:343:42
  * @returns {object} Validation result
  */
 export function validateDiscountCode(code) {
-  if (!code || typeof code !== 'string') {
-    return { valid: false, error: 'Discount code is required' };
-  }
+  if (!code || typeof code !== 'string') {}
 
   const trimmedCode = code.trim().toUpperCase();
killedBy: Validators Module - Unit Tests validateDiscountCode should reject null codes
statusReason: Cannot read properties of null (reading 'trim')

[Killed] BooleanLiteral
src/utils/validators.js:344:21
  */
 export function validateDiscountCode(code) {
   if (!code || typeof code !== 'string') {
-    return { valid: false, error: 'Discount code is required' };
+    return { valid: true, error: 'Discount code is required' };
   }
 
killedBy: Validators Module - Unit Tests validateDiscountCode should reject empty codes
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ObjectLiteral
src/utils/validators.js:344:12
  */
 export function validateDiscountCode(code) {
   if (!code || typeof code !== 'string') {
-    return { valid: false, error: 'Discount code is required' };
+    return {};
   }
 
killedBy: Validators Module - Unit Tests validateDiscountCode should reject empty codes
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] MethodExpression
src/utils/validators.js:347:23
     return { valid: false, error: 'Discount code is required' };
   }
 
-  const trimmedCode = code.trim().toUpperCase();
+  const trimmedCode = code.toUpperCase();
 
   // Length validation
killedBy: Validators Module - Unit Tests validateDiscountCode should trim whitespace
statusReason: Expected values to be strictly equal:

false !== true

[Killed] MethodExpression
src/utils/validators.js:347:23
     return { valid: false, error: 'Discount code is required' };
   }
 
-  const trimmedCode = code.trim().toUpperCase();
+  const trimmedCode = code.trim().toLowerCase();
 
   // Length validation
killedBy: Validators Module - Unit Tests validateDiscountCode should accept valid discount codes
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/utils/validators.js:350:31
   const trimmedCode = code.trim().toUpperCase();
 
   // Length validation
-  if (trimmedCode.length < 4) {
-    return { valid: false, error: 'Discount code is too short' };
-  }
+  if (trimmedCode.length < 4) {}
 
   if (trimmedCode.length > 20) {
killedBy: Validators Module - Unit Tests validateDiscountCode should reject codes too short (3 chars)
statusReason: Expected values to be strictly equal:

true !== false

[Killed] EqualityOperator
src/utils/validators.js:350:7
   const trimmedCode = code.trim().toUpperCase();
 
   // Length validation
-  if (trimmedCode.length < 4) {
+  if (trimmedCode.length >= 4) {
     return { valid: false, error: 'Discount code is too short' };
   }
killedBy: Validators Module - Unit Tests validateDiscountCode should accept valid discount codes
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:351:21
 
   // Length validation
   if (trimmedCode.length < 4) {
-    return { valid: false, error: 'Discount code is too short' };
+    return { valid: true, error: 'Discount code is too short' };
   }
 
killedBy: Validators Module - Unit Tests validateDiscountCode should reject codes too short (3 chars)
statusReason: Expected values to be strictly equal:

true !== false

[Killed] EqualityOperator
src/utils/validators.js:354:7
     return { valid: false, error: 'Discount code is too short' };
   }
 
-  if (trimmedCode.length > 20) {
+  if (trimmedCode.length >= 20) {
     return { valid: false, error: 'Discount code is too long' };
   }
killedBy: Validators Module - Unit Tests validateDiscountCode should accept codes at maximum length (20 chars)
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/utils/validators.js:354:7
     return { valid: false, error: 'Discount code is too short' };
   }
 
-  if (trimmedCode.length > 20) {
+  if (false) {
     return { valid: false, error: 'Discount code is too long' };
   }
killedBy: Validators Module - Unit Tests validateDiscountCode should reject codes too long (21 chars)
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/utils/validators.js:355:21
   }
 
   if (trimmedCode.length > 20) {
-    return { valid: false, error: 'Discount code is too long' };
+    return { valid: true, error: 'Discount code is too long' };
   }
 
killedBy: Validators Module - Unit Tests validateDiscountCode should reject codes too long (21 chars)
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/utils/validators.js:359:7
   }
 
   // Format validation (alphanumeric and hyphens only)
-  if (!/^[A-Z0-9\-]+$/.test(trimmedCode)) {
+  if (false) {
     return { valid: false, error: 'Discount code contains invalid characters' };
   }
killedBy: Validators Module - Unit Tests validateDiscountCode should reject codes with special characters
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/utils/validators.js:359:7
   }
 
   // Format validation (alphanumeric and hyphens only)
-  if (!/^[A-Z0-9\-]+$/.test(trimmedCode)) {
+  if (/^[A-Z0-9\-]+$/.test(trimmedCode)) {
     return { valid: false, error: 'Discount code contains invalid characters' };
   }
killedBy: Validators Module - Unit Tests validateDiscountCode should accept valid discount codes
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:360:21
 
   // Format validation (alphanumeric and hyphens only)
   if (!/^[A-Z0-9\-]+$/.test(trimmedCode)) {
-    return { valid: false, error: 'Discount code contains invalid characters' };
+    return { valid: true, error: 'Discount code contains invalid characters' };
   }
 
killedBy: Validators Module - Unit Tests validateDiscountCode should reject codes with special characters
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ObjectLiteral
src/utils/validators.js:360:12
 
   // Format validation (alphanumeric and hyphens only)
   if (!/^[A-Z0-9\-]+$/.test(trimmedCode)) {
-    return { valid: false, error: 'Discount code contains invalid characters' };
+    return {};
   }
 
killedBy: Validators Module - Unit Tests validateDiscountCode should reject codes with special characters
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] BooleanLiteral
src/utils/validators.js:363:19
     return { valid: false, error: 'Discount code contains invalid characters' };
   }
 
-  return { valid: true, error: null, code: trimmedCode };
+  return { valid: false, error: null, code: trimmedCode };
 }
 
killedBy: Validators Module - Unit Tests validateDiscountCode should accept valid discount codes
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ObjectLiteral
src/utils/validators.js:363:10
     return { valid: false, error: 'Discount code contains invalid characters' };
   }
 
-  return { valid: true, error: null, code: trimmedCode };
+  return {};
 }
 
killedBy: Validators Module - Unit Tests validateDiscountCode should accept valid discount codes
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] BlockStatement
src/utils/validators.js:371:47
  * @param {string} method - Payment method type
  * @returns {boolean} true if valid payment method
  */
-export function validatePaymentMethod(method) {
-  if (!method || typeof method !== 'string') {
-    return false;
-  }
-
-  const validMethods = [
-    'credit_card',
-    'debit_card',
-    'paypal',
-    'cash_on_delivery',
-    'bank_transfer'
-  ];
-
-  return validMethods.includes(method.toLowerCase());
-}
+export function validatePaymentMethod(method) {}
 
killedBy: Validators Module - Unit Tests validatePaymentMethod should accept credit_card
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] BooleanLiteral
src/utils/validators.js:372:7
  * @returns {boolean} true if valid payment method
  */
 export function validatePaymentMethod(method) {
-  if (!method || typeof method !== 'string') {
+  if (method || typeof method !== 'string') {
     return false;
   }
killedBy: Validators Module - Unit Tests validatePaymentMethod should accept credit_card
statusReason: Expected values to be strictly equal:

false !== true

[Killed] EqualityOperator
src/utils/validators.js:372:18
  * @returns {boolean} true if valid payment method
  */
 export function validatePaymentMethod(method) {
-  if (!method || typeof method !== 'string') {
+  if (!method || typeof method === 'string') {
     return false;
   }
killedBy: Validators Module - Unit Tests validatePaymentMethod should accept credit_card
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/utils/validators.js:373:12
  */
 export function validatePaymentMethod(method) {
   if (!method || typeof method !== 'string') {
-    return false;
+    return true;
   }
 
killedBy: Validators Module - Unit Tests validatePaymentMethod should reject empty method
statusReason: Expected values to be strictly equal:

true !== false

[Killed] MethodExpression
src/utils/validators.js:384:32
     'bank_transfer'
   ];
 
-  return validMethods.includes(method.toLowerCase());
+  return validMethods.includes(method.toUpperCase());
 }
 
killedBy: Validators Module - Unit Tests validatePaymentMethod should accept credit_card
statusReason: Expected values to be strictly equal:

false !== true
